[
  {
    "commentId": 358111,
    "codingamerId": 2874091,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 36827622,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "I've made the following changes:\n\nOutput / Constraints\n* Moved the last part of Output section to Constraints section.\n\nTags\n* Added the tag \"Logic\".",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 26677560000
  },
  {
    "commentId": 306034,
    "codingamerId": 4238671,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 35748929,
    "userVoteValue": 0,
    "nickname": "DavidAugustoVilla",
    "content": "If there are no objections, I'd like to add cover art to this puzzle.",
    "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
    "avatar": 132419401284681,
    "elapsedTime": 37210988000
  },
  {
    "commentId": 4244,
    "codingamerId": 1188212,
    "commentableId": 2005334,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3294844,
    "userVoteValue": 0,
    "nickname": "superredlark",
    "content": "Is it necessary to give the range of \"attributeCount\"?",
    "codingamerHandle": "1d2d89304a3bbb4c205b841516bda13d2128811",
    "avatar": 2920737364455,
    "elapsedTime": 298528628000
  },
  {
    "commentId": 3514,
    "codingamerId": 154906,
    "commentableId": 2005334,
    "responseCount": 3,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3112079,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Solved.\n\nSecond-hand impressions:\n\n* even knowing the ambiguity resolution before hand, I managed to actually code the ordering-doesnt-matter implementation first (happens to solve two thirds of the tests :D ) (because Guess Who *is* commutative)\n\n* Curiosity: why the 6/15 ratio?\n\n* I've updated your \"multiple aliases\" case title to \"multiple attributes\" (See? :P)\n\n* Good to go as far as I'm concerned. Approving.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 301431261000
  },
  {
    "commentId": 3476,
    "codingamerId": 154906,
    "commentableId": 2005334,
    "responseCount": 5,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 3104545,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Haven't got around to solving it on my own yet, but here are preliminary questions/remarks based on statement text alone.\n\n- it took me a long Long time to accept the fact the spies' identities are actually known in advance. Most spy problems revolve around actually identifying them, whereas yours seems more around parallel construction. It took me multiple readings to get it. Not sure yet what would really have helped me.\n\n- it's not obvious to me yet whether the given commands have any ordering. Or how ties should be discriminated. By ordering I mean: can commands be swapped at will, or can I first absolve Tonya and then incriminate Ned using an alias he had in common with Tonya?\n(I trust your examples and test cases protect against that, but I'm still left wondering)\n\n- I suppose C++-style language users would appreciate an indication of how many aliases a suspect went by, e.g. \"Ned 2 basil spice\"",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 301550635000
  },
  {
    "commentId": 2669,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 2797228,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "I added a couple of examples to the Statement, as well as a bit more explanation. I also added another test and validator that require more than 3 commands to solve.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 305204454000
  },
  {
    "commentId": 3479,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3476,
    "votableId": 3104774,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Thanks for your comments.\n\n1) I understand that the problem-to-theme relationship is not intuitive. It's obviously just a pasted-on theme. Perhaps an alternative theming? I've put a decent amount of thought into it, though, and haven't come up with anything yet. Any suggestions would be appreciated.\n\n2) The commands very definitely have ordering. I tried to illustrate this with my examples. In the Tonya, Ned, Cindy example, \"NOT salt, spice\" is not the same thing as \"spice, NOT salt\". In the first list, \"NOT salt\" absolves Tonya, leaving Ned and Cindy undetermined, and then \"spice\" indicates Ned from those two. In the second list, \"spice\" indicates Tonya and Ned, leaving Cindy undetermined, and then \"NOT salt\" doesn't apply to of the remaining undetermined spies (only Cindy).\n\nThe important sentences are \"Each command given will eliminate ALL of the matching suspects from the list, either absolving them as innocent, or indicating them as spies. Commands build on each other, so any suspects eliminated by a command will not be considered for future commands.\"\n\nI have added the following sentence to the statement: \"The ordering of commands is significant, and the test cases are crafted such that the shortest list of commands only has a single valid ordering.\"\n\nYeah. This problem may be more complicated to explain than to solve. :-/ I guess that may be an indication that it's not a suitable puzzle. That's too bad. I kind of like it.\n\n3) I have added the numbers, though I'll state, for the record, that a variable number of inputs is a common problem, and one that's trivial to solve, even in such \"backwater\" languages as C/C++. Command-line parameters, anyone?\n\nAnyway, thanks again for the comments. I welcome any help to make this a better puzzle.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 301547930000
  },
  {
    "commentId": 3527,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3514,
    "votableId": 3113351,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "> why the 6/15 ratio?\n\nWell, I originally came up with the concept when playing the boardgame Codenames with some friends:\n\nhttps://boardgamegeek.com/boardgame/178900/codenames\n\nIn codenames, you need to identify 8 (or 9) spies from a set of 25 suspects. I quickly got tired of trying to create test cases with the 8/25 ratio. They were too complex to keep everything in my head. I found that 15 suspects was pretty doable, and I wanted to keep a similar ratio, but going below 6 made the solution set less interesting.\n\nNot a very scientific answer. :-)",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 301405116000
  },
  {
    "commentId": 4271,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4244,
    "votableId": 3300870,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Thanks. I have added a range specification for attributeCount.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 298446797000
  },
  {
    "commentId": 3531,
    "codingamerId": 154906,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3514,
    "votableId": 3114072,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "I guess the underlying question was also \"why are the size and ratio settings constant?\" :-D\n\n(pros: easier input, stable implementation as numbers go up; cons: the examples can't be construed as test cases)",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 301380459000
  },
  {
    "commentId": 3652,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3514,
    "votableId": 3130942,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Sorry. I somehow missed this question. :-)\n\nI think part of the reason for it is it was one of my first puzzles, and there weren't an awful lot of examples available. I don't think the stub generator was even available at that time, so I just picked something easy to work with for input.\n\nWe're talking 5 months ago that I wrote this puzzle, so I have to shift my mind back a bit.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 301167154000
  },
  {
    "commentId": 3480,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3476,
    "votableId": 3104845,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "After thinking about it a bit more, maybe this would work better if I used more of a Guess Who kind of approach, with actual attributes, rather than aliases. For example, \"moustached\", \"not bald\", \"not female\", \"bearded\", etc. I think I will rework it along these lines.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 301546988000
  },
  {
    "commentId": 3502,
    "codingamerId": 154906,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 3476,
    "votableId": 3110068,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "What I think tripped me for the \"orderingness\" is the mention \"Each command given will eliminate ALL of the matching suspects from the list\". The only explicit lists in the statement are the commands' and the people's, but the fact the elimination applies to a people's \"latest suspect list\" rather than the given \"full suspect list\" seems more implied by the solver's thought process than the statement.\nThe examples do rule one out, but this still needs parsing and understanding 6 command lists, which is a lot.\n\nI don't even do C++ on CG anymore, it's more of a likely help that I often see bitched about in the comments when forgotten. I'll admit it *is* a lot easier to me to conceive how to extract words from a C++ stream when you know how many to expect. (command-line parameters aren't comparable: they're already word-split)\n\nI love the Guess Who aproach, it would indeed make the problem mindset more obvious to me.\n\nWould it be possible to make the solution's uniqueness guarantee a bit more explicit? Right now all I read to that effect is \"Output: the shortest possible list of commmands (...)\" IMHO a sentence in the lines of \"The test cases are constructed so that there is a unique solution\" would go a long way.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 301463030000
  },
  {
    "commentId": 3504,
    "codingamerId": 552776,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3476,
    "votableId": 3110621,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "> the fact the elimination applies to a people's \"latest suspect list\" rather than the given \"full suspect list\" seems more implied by the solver's thought process than the statement.\n\nI understand. How about this: \"Each command given will eliminate ALL of the matching suspects from the current (potentially reduced) list of remaining suspects, either absolving them as innocent, or indicating them as spies.\"\n\n> command-line parameters aren't comparable: they're already word-split\n\nTrue enough. Bad example. Thanks for the dose of sanity. :-)\n\n> I love the Guess Who approach\n\nI have reworked the puzzle along these lines.\n\n> Would it be possible to make the solution's uniqueness guarantee a bit more explicit?\n\nI have added the sentence \"The ordering of commands is significant, and the test cases are crafted such that the <<shortest>> list of commands only has a single valid ordering.\" to the statement, and have put something to that effect in the output description as well.\n\nThanks for the continued help. It is much appreciated. Any other suggestions?\n\nBTW, I believe you have the ability to edit puzzles now, yourself. If you are motivated, you are free to make any modifications to this puzzle that you think are worthwhile. :-)",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 301452988000
  },
  {
    "commentId": 3505,
    "codingamerId": 154906,
    "commentableId": 2005334,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3476,
    "votableId": 3111066,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "All perfectly clear to me now. I'll try and solve it in the afternoon.\n\nI do have edit rights, but I use that as sparingly as possible. Anything bigger than a typo is most likely something to be discussed with the author rather than arbitrarily corrected IMHO.\n\nThere's not much more I can comment on until I try it. I'm out of first impressions ^^",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 301445843000
  }
]