{
  "id": 67830,
  "activeVersion": 9,
  "score": 3,
  "votableId": 30633194,
  "codingamerId": 5068760,
  "views": 149,
  "commentableId": 30495810,
  "title": "Greeting word frequency list",
  "status": "ACCEPTED",
  "type": "CLASHOFCODE",
  "nickname": "K9Dev",
  "publicHandle": "67830b2afdc22e6595a1fa9e6623e5637a80f",
  "codingamerHandle": "214fe5a152ed635c6582cf0129b2f4300678605",
  "lastVersion": {
    "version": 9,
    "autocloseTime": 1698400466237,
    "data": {
      "title": "Greeting word frequency list",
      "topics": [],
      "fastest": true,
      "reverse": false,
      "shortest": true,
      "solution": "import re\n\n# Get the string\ntext = input().lower()\n\n# Create the word frequency dictionary\nword_frequency = {\"hi\":0,\"hello\":0,\"how are you\":0,\"welcome\":0}\n\n# Match all the whole greeting words (so \"welcomed\" isn't counted but \"welcome!\" is)\ngreetings_matches = re.findall(r\"(?i)\\b(hi|hello|welcome|how are you)\\b\", text)\n\n# Loop over all the matches and add 1 to the frequency counter of that word\nfor gm in greetings_matches:\n    word_frequency[gm] += 1\n\n# Sort the dictionary by value\nword_frequency = sorted(word_frequency.items(), key=lambda x:x[1])[::-1]\nindex = 0\nfor word in word_frequency:\n    if word[1]: # check if the value is greater than 0\n        index += 1\n        print(f'{index}. {word[0]}: {word[1]}')\n",
      "statement": "You need to output a sorted list of greetings: {{hi}}/{{hello}}/{{how are you}}/{{welcome}}\nthat appear in the input. it will be sorted by the most frequent greetings from the list of greetings above being placed at the top, so the most frequent greeting would rank as number 1.\nEach line output would have this structure:\n<<[rank]{{.}} [greeting]{{: }}[number of occurrences]>>\n\n\n<<IMPORTANT: >>\n<<1.>> You have to check if the greeting is a separate word, For example the word {{Hindi}} doesn't count as {{hi}}.\n<<2.>> The greetings and counts are case-insensitive, which means: {{Hi}} also counts as {{hi}}.\n<<3.>> Incase of a tie you should sort the list with the priority being: {{welcome}}, then {{how are you}}, then {{hello}} and lastly {{hi}}.\n<<4.>> Greetings and words might not always be separated with a space they could also be like this: \"{{Hi}}, man!\" so that {{hi}} should count.\n<<5.>> Don't include the greeting if it has 0 occurrences in the input.",
      "testCases": [
        {
          "title": "Test 1",
          "isTest": true,
          "testIn": "It was a sunny Tuesday morning when Sam woke up and decided to take a walk through the park. \"Hello trees!\" he said, waving to the tall oaks and maples along the path. Sam loved being outside, especially on such a nice day. \"Hi Mr. Squirrel!\" Sam called out as a small furry creature scurried by. The park was one of Sam\\'s favorite places to say hi to nature. As Sam strolled down the trail, he spotted his friend Lucy waving in the distance. \"Hi Lucy!\" Sam shouted, excited to see his friend. Lucy ran over to meet Sam and said \"Hey! How are you today?\" \"I\\'m great!\" Sam replied. The two friends walked together for a while, chatting and laughing. Eventually they came across a older gentleman sitting on a bench reading a book. \"Hello sir, lovely day isn\\'t it?\" Sam said cheerfully. The man looked up and smiled, \"Why yes, yes it is!\" After wishing the man a pleasant day, Sam and Lucy continued their walk, waving and saying hi to the people they passed along the way. When they reached the end",
          "testOut": "1. hi: 4\n2. hello: 2\n3. how are you: 1",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Test 2",
          "isTest": false,
          "testIn": "Sara woke up eager for the day ahead. She was going to the county fair with her best friend Jenny. She quickly got dressed and went downstairs for breakfast. \"Morning Mom!\" Sara said brightly. Her mom smiled \"Good morning sweetie!\" After a quick breakfast, it was time to head to the fairgrounds. Sara hopped on her bike and rode to Jenny's house. \"Hi Jenny!\" she called out as her friend came outside. \"Hey Sara! You ready for some fun?\" The girls rode their bikes to the fair, chatting the whole way. When they arrived, Sara said \"Hello Mr. Ticketman!\" to the older gentleman at the entrance. He chuckled and tipped his hat in reply. Sara and Jenny made their way through the fair, waving and saying hi to all the vendors and performers. They played carnival games, went on rides, and snacked on classic fair food. After a few hours, they bumped into some other friends from school. \"Well hi there!\" Sara said happily to her classmates. The group of friends enjoyed the fair together for the rest  ",
          "testOut": "1. hi: 3\n2. hello: 1",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 3",
          "isTest": true,
          "testIn": "Mark was super pumped for the first day of school. He had on his favorite shirt and a new backpack full of fresh supplies. \"Goodbye Mom, love you!\" he said as he headed out the door. Mark walked to the bus stop where he saw his friend Jake waiting. \"Hey Jake! Ready for a new year?\" Jake nodded and they chatted about their summers until the bus pulled up. \"Morning!\" Mark said cheerfully as he boarded the bus. The first day of school was always one of Mark's favorites. He loved seeing old friends and meeting new people. When they arrived at school, Mark smiled and said hello to all of his teachers before finding his seat in each classroom. At lunch, Mark and Jake sat with some kids they knew from last year. \"Hi guys! How were your summers?\" Mark asked. After lunch was Mark's favorite subject, art. The art teacher, Ms. Lane, came over to their table. \"Welcome back students! I do hope you're ready for another creative year.\" Mark was thrilled, art was always so fun. The day breezed by     ",
          "testOut": "1. welcome: 1\n2. hello: 1\n3. hi: 1",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Test 4",
          "isTest": false,
          "testIn": "Amanda was so delighted to be starting her first day of middle school. She woke up early, got dressed in a cute new outfit, and went downstairs for breakfast. \"Good morning Mom and Dad!\" Amanda said cheerfully. After eating, she gathered up her backpack and headed out the door.As Amanda walked to school, she waved and said hello to the familiar faces from her neighborhood. When she got to the schoolyard, she immediately spotted her best friend Julia. \"Hi Julia!\" Amanda shouted as she ran over to greet her. Julia smiled wide and said \"Hey Amanda! How are you? Are you excited?\" The two chatted until the bell rang and then said hello to their new teachers as they entered the classrooms.Over the next few periods, Amanda introduced herself and said hi to the students sitting near her that she didn't know yet. At lunch, Amanda and Julia sat together and welcomed some girls that asked if they could join them. During last period, Amanda was thrilled to see they had art class.                ",
          "testOut": "1. hello: 2\n2. hi: 2\n3. how are you: 1",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 5",
          "isTest": true,
          "testIn": "Emma bounced out of bed, excited for her orchestra field trip today. She got dressed in her comfy jeans and orchestra t-shirt and went downstairs. \"Good morning! How are you today?\" Emma greeted her parents brightly. After scarfing down some eggs, Emma grabbed her violin case and sheet music. Emma's dad drove her to school where she met up with her best friend Julia. \"Hi Julia! How are you? Ready for the field trip?\" Julia smiled and said \"Hey Emma! I'm great, how are you? I can't wait for the field trip!\" The girls chatted as they boarded the bus along with their fellow orchestra classmates. Emma and Julia sat together, eager for the day ahead.When they arrived at the concert hall, the orchestra director, Mr. Kaplan, stood before them. \"Hello students! How is everyone this morning? Welcome to the Symphony Hall, I hope you have an enjoyable and inspiring day!\" Emma soaked up every moment as they sat in on a rehearsal and took a backstage tour. She loved watching the musicians perform. ",
          "testOut": "1. how are you: 3\n2. welcome: 1\n3. hello: 1\n4. hi: 1",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Test 6",
          "isTest": false,
          "testIn": "Lucas woke up today feeling a bit under the weather. He slowly got out of bed and got dressed before heading downstairs. \"Good morning Mom, good morning Dad,\" Lucas said in a croaky voice. \"Oh dear, you're not sounding too good Lucas,\" his mom replied. Lucas ate some breakfast before deciding to visit his friend Nathan down the street. He walked slowly along the sidewalk before arriving at Nathan's house and knocking on the door. \"Hey Lucas! How are you doing today?\" Nathan asked. \"Hi Nathan. I'm feeling a little sick, how are you?\" Lucas responded. The two boys hung out for a bit, playing video games together. After a couple hours, Lucas headed home for some lunch. His neighbor Miss Jones was gardening in her front yard. \"Hello Miss Jones! That garden of yours is looking lovely,\" Lucas called out. \"Why thank you Lucas! How are you feeling today?\" she replied. Lucas told her he was feeling under the weather as he continued his walk home.                                                 ",
          "testOut": "1. how are you: 3\n2. hello: 1\n3. hi: 1",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 7",
          "isTest": true,
          "testIn": "Olivia was super pumped for the school talent show tonight. She had a dance routine she'd been working on for weeks that she couldn't wait to perform. After school, Olivia hurried home to get ready. \"Hi Mom! Hi Dad!\" she called out as she rushed up to her room. She turned up some music as she did her hair and makeup.Olivia's friend Ava was joining her in the dance routine and soon arrived at her house. \"Hey Ava! How are you? Are you excited about tonight?\" Ava smiled big and replied \"Hi Olivia! I'm great, how are you? I'm so excited!\" The girls put on their costumes and headed to the school auditorium.They peeked out at the audience as people began to fill up the seats. Olivia saw her parents waving at her and shouted \"Hello Mom and Dad!\" Soon it was time for Olivia and Ava to go on stage and perform their dance. Olivia stepped out and saw all her family and friends cheering. \"Hi everyone!\" Olivia yelled with a smile and wave.Olivia and Ava nailed their dance routine perfectly.        ",
          "testOut": "1. hi: 4\n2. how are you: 2\n3. hello: 1",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Test 8",
          "isTest": false,
          "testIn": "Jackson woke up bright and early for the big soccer championship game today. He got dressed in his uniform, ate a good breakfast, and went outside to wait for his ride. \"Good morning Grandma!\" Jackson said cheerfully as his grandmother pulled up.At the field, Jackson did some warmups with his teammates. Then the referee called the players in and said \"Hello boys! Welcome to the championship game, have fun and play fair!\" Jackson waved to the crowds of parents before taking his position.Right from the start it was an intense game with lots of back and forth play. During timeouts, Jackson guzzled water and caught his breath. His coach kept shouting \"How are we doing team? Looking good!\" At halftime, Jackson's grandmother came down to check on him. \"Hi Grandma! This is a tough game but I'm having a blast!\"In the end, Jackson's team prevailed with a 3-2 victory. Jackson cheered and gave his teammates high fives. He ran over to his grandmother and parents saying \"We did it!                \"",
          "testOut": "1. welcome: 1\n2. hello: 1\n3. hi: 1",
          "isValidator": true,
          "needValidation": true
        }
      ],
      "constraints": "",
      "stubGenerator": "read text:string(1000)\n\nwrite [rank]. [greeting]: [occurrences]",
      "inputDescription": "[[text]]: A String that will contain text with some greetings",
      "solutionLanguage": "Python3",
      "outputDescription": "A sorted list of ranks, greetings and numbers of occurrences of those greetings"
    },
    "draft": false,
    "readyForModeration": true,
    "statementHTML": "<div class=\"statement-body\">\n<div class=\"statement-section statement-goal\">\n   <h2><span class=\"icon icon-goal\">&nbsp;</span><span>Goal </span></h2>\n   <span class=\"question-statement\">You need to output a sorted list of greetings: <const>hi</const>/<const>hello</const>/<const>how are you</const>/<const>welcome</const><br>that appear in the input. it will be sorted by the most frequent greetings from the list of greetings above being placed at the top, so the most frequent greeting would rank as number 1.<br>Each line output would have this structure:<br><strong>[rank]<const>.</const> [greeting]<const>: </const>[number of occurrences]</strong><br><br><br><strong>IMPORTANT: </strong><br><strong>1.</strong> You have to check if the greeting is a separate word, For example the word <const>Hindi</const> doesn't count as <const>hi</const>.<br><strong>2.</strong> The greetings and counts are case-insensitive, which means: <const>Hi</const> also counts as <const>hi</const>.<br><strong>3.</strong> Incase of a tie you should sort the list with the priority being: <const>welcome</const>, then <const>how are you</const>, then <const>hello</const> and lastly <const>hi</const>.<br><strong>4.</strong> Greetings and words might not always be separated with a space they could also be like this: &quot;<const>Hi</const>, man!&quot; so that <const>hi</const> should count.<br><strong>5.</strong> Don't include the greeting if it has 0 occurrences in the input.</span>\n</div>\n<div class=\"statement-section statement-protocol\">\n   <div class=\"blk\">\n      <div class=\"title\">Input</div>\n      <div class=\"question-statement-input\"><var>text</var>: A String that will contain text with some greetings</div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Output</div>\n      <div class=\"question-statement-output\">A sorted list of ranks, greetings and numbers of occurrences of those greetings</div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Constraints</div>\n      <div class=\"question-statement-constraints\"></div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Example</div>\n      <div class=\"statement-inout\">\n         <div class=\"statement-inout-in\">\n            <div class=\"title\">Input</div>\n            <pre class=\"question-statement-example-in\">It was a sunny Tuesday morning when Sam woke up and decided to take a walk through the park. &quot;Hello trees!&quot; he said, waving to the tall oaks and maples along the path. Sam loved being outside, especially on such a nice day. &quot;Hi Mr. Squirrel!&quot; Sam called out as a small furry creature scurried by. The park was one of Sam\\'s favorite places to say hi to nature. As Sam strolled down the trail, he spotted his friend Lucy waving in the distance. &quot;Hi Lucy!&quot; Sam shouted, excited to see his friend. Lucy ran over to meet Sam and said &quot;Hey! How are you today?&quot; &quot;I\\'m great!&quot; Sam replied. The two friends walked together for a while, chatting and laughing. Eventually they came across a older gentleman sitting on a bench reading a book. &quot;Hello sir, lovely day isn\\'t it?&quot; Sam said cheerfully. The man looked up and smiled, &quot;Why yes, yes it is!&quot; After wishing the man a pleasant day, Sam and Lucy continued their walk, waving and saying hi to the people they passed along the way. When they reached the end</pre>\n         </div>\n         <div class=\"statement-inout-out\">\n            <div class=\"title\">Output</div>\n            <pre class=\"question-statement-example-out\">1. hi: 4\n2. hello: 2\n3. how are you: 1</pre>\n         </div>\n      </div>\n   </div>\n</div>"
  },
  "validatedFor": 72553694528,
  "avatar": 109786280493467,
  "commentCount": 20,
  "upVotes": 3,
  "downVotes": 0,
  "validateAction": {
    "actionId": 863761,
    "progress": 1,
    "alreadyDone": false
  },
  "statusHistory": [
    {
      "status": "REFUSED",
      "date": 1694901937000,
      "data": {
        "author": "SYSTEM",
        "reason": "INACTIVITY"
      }
    },
    {
      "status": "PENDING",
      "date": 1695808466237,
      "data": {
        "author": "ACTION",
        "reason": "EDIT"
      }
    },
    {
      "status": "ACCEPTED",
      "date": 1698175406802,
      "data": {
        "author": "ACTION"
      }
    }
  ],
  "editable": true,
  "draft": false,
  "readyForModeration": true
}