[
  {
    "commentId": 306033,
    "codingamerId": 4238671,
    "commentableId": 2840893,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 35748925,
    "userVoteValue": 0,
    "nickname": "DavidAugustoVilla",
    "content": "If there are no objections, I'd like to add cover art to this puzzle.",
    "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
    "avatar": 132419401284681,
    "elapsedTime": 37210970000
  },
  {
    "commentId": 5685,
    "codingamerId": 154906,
    "commentableId": 2840893,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4019759,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "I liked:\n* the potential loss of commutativity wrt the binomial law\n* the asymmetry wrt Pascal's triangle\n\nI disliked:\n* the lack of constraints to provide an order of magnitude of what to optimize for.\n* my end code is a direct implementation of the statement (including combinatorial explosion, adding O(N) list access in for good measure), yet it passes.\n\nAs a result, I'm a bit confused by your comment saying you have to understand the sequence. I don't have the feeling that was my case!\n\nI'd suggest special-casing the definition for endpoints, because the current wording says 0 (instead of \"neutral element\"), which makes sense as it's a description of Pascal's triangle, but makes implementation of the puzzle an exception-in-an-exception. OTOH, stopping in the corners instead of assuming half-unbounded sequences of neutrals could be argued to be part of the point of the problem. Not sure what's best here.\n\nAnyway, good to go. (you can always edit or post a sequel if you want to follow up on my points :D )\n\n(if you edit, make it to provide meaningful test names ;) )",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292977641000
  },
  {
    "commentId": 2969,
    "codingamerId": 552776,
    "commentableId": 2840893,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 2893711,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Don't be fooled into thinking this is a very easy puzzle. The last few tests and validators are a bit tricky! You need to understand the sequence to solve it.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 303939891000
  }
]