[
  {
    "commentId": 412353,
    "codingamerId": 6098116,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 1,
    "votableId": 37790787,
    "userVoteValue": -1,
    "nickname": "Delicious31415",
    "content": "✅ Approved the contribution.\nComment: I think this is good and original (numbers to letters), but I don't get why you single out 8008 or 9...",
    "codingamerHandle": "6fc5bad6d87584d4100190a570f4e37c6118906",
    "avatar": 154204769409682,
    "elapsedTime": 16991475000
  },
  {
    "commentId": 412333,
    "codingamerId": 169033,
    "commentableId": 37371718,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 37736396,
    "userVoteValue": 0,
    "nickname": "Yasseruvski",
    "content": "❌ Rejected the contribution.\nComment: I agree to the previous comment, where this is not obvious for a reverse mode. Usually it should be a human pattern that can be detected to solve the problem, especially for reverse mode there's no much time to solve.",
    "codingamerHandle": "0d647d25cf7b35872d8e9f607f6af1ef330961",
    "avatar": 1729823426851,
    "elapsedTime": 17021768000
  },
  {
    "commentId": 411763,
    "codingamerId": 6620011,
    "commentableId": 37371718,
    "responseCount": 1,
    "upVotes": 3,
    "downVotes": 1,
    "votableId": 37698847,
    "userVoteValue": 1,
    "nickname": "Lance0",
    "content": "❌ Rejected the contribution.\nComment: Before someone else approves this and makes it 3/3 accepted I need to point a few problems out, by pretending to be a user taking this clash.\n\nImmediately after seeing test cases 1/2, it should be clear that you're trying to \"flip the string upside down\", but test cases 1/2 don't give you enough info just yet, which brings me to problem 1.\n\n1. The rule is complicated enough that there is no obvious pattern that guarantees a correct answer from the first few test cases, which means it's too hard for reverse.\n\nAfter seeing this, I would probably check test later test cases, only to be met by **** as the answer to 8008, which brings me to the second issue.\n\n2. Why is there an edge case that's SPECIFICALLY for BOOB? It's an extra rule on top of \"flip the string upside down\", again this is too complicated for reverse.\n\nSo after considering that part in code, you are still trying to fill up your lookup only to get that there is just no 9s in the entire clash, which is certainly weird, so maybe it was just missed? Logically, every other number is already there (including 4, which feels somewhat weird to invert as H), but there really just isnt anything there. The last test case is also obviously a random test case, so what are you supposed to do when 9 shows up? Your best option is *maybe* G, but even then you can't be sure (why would you repeat what you just did with 6), and this is the third issue.\n\n3. The samples are incomplete, it doesn't give you full confidence in what to do when 9 shows up (it never does, but how would you know that), so it wastes time on a phantom issue and forces you to guess what happens in that case.\n\nIn short, this is way too complicated of a reverse rule and does not give you enough info to be confident that your answer should pass.",
    "codingamerHandle": "39deb77f3f915d63eb658f6208ab4db21100266",
    "elapsedTime": 17306870000
  },
  {
    "commentId": 404273,
    "codingamerId": 4225191,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 2,
    "downVotes": 2,
    "votableId": 37572121,
    "userVoteValue": -1,
    "nickname": "xerneas02",
    "content": "✅ Approved the contribution.\nComment: Good problem for reverse mode",
    "codingamerHandle": "7dec489e62c248770024696e5a9f8b391915224",
    "avatar": 146784907860198,
    "elapsedTime": 18486922000
  },
  {
    "commentId": 402292,
    "codingamerId": 2950978,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 2,
    "downVotes": 2,
    "votableId": 37535203,
    "userVoteValue": -1,
    "nickname": "icecuber",
    "content": "✅ Approved the contribution.\nComment: It's a nice problem with appropriate difficulty for reverse mode.",
    "codingamerHandle": "e8c28f95e3e32c69f8a08476678c8cfb8790592",
    "avatar": 22740742148777,
    "elapsedTime": 18890606000
  },
  {
    "commentId": 415141,
    "codingamerId": 3479792,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 411763,
    "votableId": 37845462,
    "userVoteValue": 0,
    "nickname": "StepBack13",
    "content": "I just played this under Reverse conditions, and found it pretty easy to learn the pattern from just test cases, personally. Maybe they've been updated in response to your rejection?\n\nIt would be good for the author to swap the 'Still Easy' test and validator though, imo. \"BEE\" is more helpful as a test than \"BE\" and would help with point 1.\n\nAt first I thought the \"8008\" thing was annoying too, but since it's just one word it didn't actually add much difficulty. Just enough to make this clash unique amongst similar clashes, imo.",
    "codingamerHandle": "da2fe4fbf3c0ab008c6dcf304920ec602979743",
    "avatar": 33990586394707,
    "elapsedTime": 16343724000
  },
  {
    "commentId": 412334,
    "codingamerId": 169033,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 412333,
    "votableId": 37736492,
    "userVoteValue": 0,
    "nickname": "Yasseruvski",
    "content": "I wanted to bring balance between user levels in terms of solving problems.\nI would consider this still debatable on the complexity but it's a tight one.\nIt may be fun having this introduced. I leave the decision to the third approval/rejection.",
    "codingamerHandle": "0d647d25cf7b35872d8e9f607f6af1ef330961",
    "avatar": 1729823426851,
    "elapsedTime": 17021003000
  },
  {
    "commentId": 415140,
    "codingamerId": 3479792,
    "commentableId": 37371718,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 412333,
    "votableId": 37845434,
    "userVoteValue": 0,
    "nickname": "StepBack13",
    "content": "I just played this under Reverse conditions, and it's actually quite easy to learn the pattern from just test cases.\n\nSolving is also really easy because the last test has all of the letters in it, so you can just copy the input (reversed) and the output, then apply a string transformation between them `tr`.\n\nThen you just handle for \"8008\", which at first I thought was annoying, but since it's just one word it doesn't add much difficulty. Just enough to make this clash unique amongst similar clashes.\n\nThe tests are well designed for Reverse, imo.",
    "codingamerHandle": "da2fe4fbf3c0ab008c6dcf304920ec602979743",
    "avatar": 33990586394707,
    "elapsedTime": 16344017000
  }
]