[
  {
    "commentId": 4911,
    "codingamerId": 154906,
    "commentableId": 2390728,
    "responseCount": 8,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3582740,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Solved.\n\nWithout peeking into the validators, which brought me major headaches because of the following two features found in validators only, not in tests:\n- next trapezoid to be flooded touches the edge of the map (V5)\n- next flooded town on one side of a flow split is in the second valley (V7)\n(the other headaches were bugs of mine of the \"way more stupider than that\" category).\n\nI realize this might be related to the particular approach my solution uses, but who knows, could it impact anybody else? Might I suggest swapping?\n\nApart from that, great puzzle, thanks! Upvoting.\n\nA minor suggestion: my solution maintains the flood from as a list of future town victims. But I've checked: that list never ever takes a length above 1. I could do away with the list and use a Maybe/Optional if I could have the two following constraints officialized:\n- portal isn't on a town.\n- no two towns are scheduled for simultaneous flooding.\n\nSounds reasonable?",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 296083260000
  },
  {
    "commentId": 2600,
    "codingamerId": 552776,
    "commentableId": 2390728,
    "responseCount": 1,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 2768584,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "It was a lot of work, but I finally solved this one. I kept underestimating the complexity required for a complete solution.\n\nYes, it is a very difficult puzzle, but that's a good thing. I think the community puzzles need more challenges. This is a very unique problem, and it is well designed and written. The statement is concise and complete. \n\nExcellent job. I wholeheartedly vote to approve this puzzle.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 305577064000
  },
  {
    "commentId": 2058,
    "codingamerId": 1336464,
    "commentableId": 2390728,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 2464035,
    "userVoteValue": 0,
    "nickname": "magaiti",
    "content": "Finally solved it. Thanks for a great puzzle!",
    "codingamerHandle": "eec8bff1779e6e64b0ce890f0d5f53e64646331",
    "avatar": 4034881109815,
    "elapsedTime": 308956304000
  },
  {
    "commentId": 2037,
    "codingamerId": 1336464,
    "commentableId": 2390728,
    "responseCount": 3,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 2454267,
    "userVoteValue": 0,
    "nickname": "magaiti",
    "content": "This puzzle looks pretty original (compared to what we have in the approved section so far). I can't believe someone downvoted it.",
    "codingamerHandle": "eec8bff1779e6e64b0ce890f0d5f53e64646331",
    "avatar": 4034881109815,
    "elapsedTime": 309061479000
  },
  {
    "commentId": 2039,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 2037,
    "votableId": 2457013,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "Probably someone working at the Arkham Tourist Office!",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 309040541000
  },
  {
    "commentId": 2068,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 2058,
    "votableId": 2472496,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "You’re welcome! Since you’ve solved it quickly, I’m curious to know how difficult did you found it (compared to the CG puzzules)? I would rank it myself as \"difficult\", but my solution is probably too much naive and simulation oriented (I’ve found something simpler along the way, but not easier to understand with too many special cases to deal with).",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 308861250000
  },
  {
    "commentId": 2602,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 2600,
    "votableId": 2768723,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "Thank you!\n\nI perfectly understand that you mean by \"underestimating the complexity required for a complete solution\", I’ve been there when designing this problem.\n\nIn fact, my original intent was to have rain pouring on the whole map... until I understood water speed and differential calculus were required to solve it! Having a single water origin simplified things a lot. \n\nThat’s too bad that another person of the Arkham Tourist Office voted against it ;(",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 305575319000
  },
  {
    "commentId": 4913,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 3583862,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "Hummm...\n\nDe l’eau a coulé sous les ponts since I’ve designed this puzzle! I will look into it... but only after having played ball (https://www.youtube.com/watch?v=TT8e7i0ccLQ) with Hypersonic. For now, the only thing I can say is that:\n- the filthy fifth validator is obviously violating a constraint stated in the description, my bad,\n- a new constraint about the gate not sharing the same position as a town could indeed be added,\n- the hidden rule restricting two towns of being flood the \"same\" time to prevent some rounding errors in some approachs could be made official (but how much is \"not the same\" could be tricky to define).\n\nAnyway, congratulations for saving the world.",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 296078987000
  },
  {
    "commentId": 4916,
    "codingamerId": 154906,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 3584391,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Not sure what V5 would violate... It does flood all towns before water is subject to reaching the edge of the map. It's just a nasty surprise to people like me who compute the exact \"next event\" volume, since this pattern-matching case occurs only there.\n\nAbout simultaneous flooding, \"not the same \" IMHO shouldn't need specifying. Despite the DF diagram, the problem is worder in a way that hints to continuous flowing, so that's the sort of ordering to expect. The fact it could work by rounding (does it? I didn't try) is contingent.\n\nWhich makes me doubt the intent. Was the DF diagram meant to say water could be quantized in ASCII units? (the 6x\"~\" could hint toward that) That's at odds with the landscape input format.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 296076925000
  },
  {
    "commentId": 5994,
    "codingamerId": 552776,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4099449,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "I don't quite see what is unique about V5, but I can see the argument for V7, and since I was in there, I decided to go ahead and add a test for V5 anyway. I have added two new sets of test and validator: \"On Edge\" and \"Next One Over\". The test for each is a simple mirror of V5 and V7, and the validator for each is a very minor modification of the corresponding test map.\n\nI have run all tests through both my solution and Aries' solution. Everything passes.\n\nI have also added the collocated portal / town constraint to the constraints section. I'm not confident enough about the simultaneous flooding towns constraint to add it, myself.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 291944136000
  },
  {
    "commentId": 5995,
    "codingamerId": 154906,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4099793,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "I've edited your two new tests to get the visible portion of town names back in the Arkham/Dunwich namespace. ;-)\n\nAbout V5 (that your test on-edge does capture): the right valley could be split into three horizontally-layered trapezoids: from heights 0 to 1 (reach Beta), 1 to 3 (flood Beta, REACH EDGE), 3 to 4 (overflow, shouldn't happen). It used to be the only case where a town that IS to be flooded (not the last) is in an edge-touching trapezoid.\nIronically, my fix was something that I could recognize in Aries' code, even though it appears as though *he* doesn't need it any more: add vertical walls to the side.\nThe more I compare T5 and V5, the less I think they test the same thing.\n\nAbout the simultaneous flooding, well, my code detects it doesn't happen, so that's one more data point :D (I compute my volumes using rationals, so no precision joke to fear there, only latent bugs)\n\nWhat I think I'll do is  update both my code and a copy of Aries' to dump what they think is the threshold volume for the floods, and we'll run from that.\n\nFrom his comment, the intent did appear to be there.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 291941160000
  },
  {
    "commentId": 5999,
    "codingamerId": 154906,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4100355,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Comparison here: http://pastebin.com/raw/kdxNTveQ\n\nWildly different on T6 (same ordering, very different values for the second half---I suspect it's my \"modification\" to Aries' code that's not extensive enough)\n\nAll the rest absolutely the same within 1e-4.\n\nClosest to a tie is V9 at 0.1875. Other pretty close are V7 T9 V5 between 0.5 and 1. *All* of those are a two-city match, so it's obvious they're not intended as ties.\nI think it's safe to assume there are no intended ties.\n\nCross-verification welcome!",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 291936477000
  },
  {
    "commentId": 6003,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4101844,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "a) T1 and T5 do violate the constraint stating that \"The relief is always designed in a way that all towns are doomed to be submerged before water starts overflowing the map itself\". It should be \"all but one town\".\n\nb) My code contains a bug which becomes apparent in T6, but stays inconsequential as long as there is only one portal. I guess I need to correct it before publishing Flood The World II, with moving clouds raining on a whole surface and water flooding on the ground at a specific speed (FtW III will probably introduce winds affected by the relief and the current water level as well as water evaporation depending on the sunshine).\n\nc) Indeed, simultaneous flooding is not intended and inputs have been designed as such (but not with enough care in some cases).\n\nd) V5 doesn’t seem well designed and it is obviously not complementing T5. Same thing for V7.\n\nMy bad... I really need to correct all of these problems. The difficulty of this puzzle was never intended to arise from hermetic validation cases.",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 291920934000
  },
  {
    "commentId": 6004,
    "codingamerId": 154906,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4101923,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "My code kept the flooding to N-1 towns (for no better reason than \"it's one of the things I tried while debugging V5, and it wasn't too hard since my code spits a lazy list of ordered flooded towns\") so I'd never have noticed the T1/T5 issue.\n\nHey, no weather simulation before there's FORTRAN available in the platform, mkay?\n\n:D",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 291920166000
  },
  {
    "commentId": 6013,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4911,
    "votableId": 4108123,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "After having dive back into my code, I’ve realized it has no bug regarding T6 after all. It’s just that I’m not calculating the volume beneath a town, but instead the volume of water which is required to flow from the portal before the town is flooded. It’s frequently the same value, but it is not always the case, in particular when a side start overflowing back into another. Unfortunately, I can’t imagine a test case exploiting this pitfall with a single portal. Too bad...",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 291838361000
  },
  {
    "commentId": 2069,
    "codingamerId": 1336464,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 2058,
    "votableId": 2472640,
    "userVoteValue": 0,
    "nickname": "magaiti",
    "content": "Probably \"hard\". Definitely more than an average \"medium\" puzzle. My solution involves recursion and summing up areas of geometrical shapes.",
    "codingamerHandle": "eec8bff1779e6e64b0ce890f0d5f53e64646331",
    "avatar": 4034881109815,
    "elapsedTime": 308859582000
  },
  {
    "commentId": 2136,
    "codingamerId": 1164731,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 2,
    "downVotes": 0,
    "parentCommentId": 2037,
    "votableId": 2516888,
    "userVoteValue": 0,
    "nickname": "Germain",
    "content": "Your stub do not produce \"working\" code in all languages. (allmost in javascript)\nFor example in Javascript :\nthe first loop inner code is :\nvar inputs = readline().split(' '); \nvar x = parseInt(inputs[0]);\nvar y = parseInt(inputs[1]);\n\nSince you use multiple spaces `inputs[0]` is correct but `inputs[1]` is not. Split giving array like `[2,,,,3]` for a `2   3` textual coords for example. (You should set only one space (eg. `2 3`) between coords)\n\nnote : same things with towns names in the next loop.\n\nMaybe it's why someone downvote it. Of course downvote a puzzle without letting any comment is a bit bad mannered.\n\nThanks for this puzzle with a little background story making it more attractive than simple raw program description :)\n\nPS : hope my english is almost understable :)",
    "codingamerHandle": "69918bfbdd2733ab90deb1a846f4d4a21374611",
    "avatar": 2761489238661,
    "elapsedTime": 308450581000
  },
  {
    "commentId": 2141,
    "codingamerId": 159880,
    "commentableId": 2390728,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 2037,
    "votableId": 2519567,
    "userVoteValue": 0,
    "nickname": "Aries",
    "content": "Thanks for reporting this issue. I’ve reduced all space sequences to a single character and everything now works as expected with Javascript (or any other language exhibiting the same parsing behavior).",
    "codingamerHandle": "65f47e2d1bda2e961cd3e1dc7f04d13c088951",
    "avatar": 4800558763747,
    "elapsedTime": 308433199000
  }
]