{
  "id": 109278,
  "activeVersion": 74,
  "score": 4,
  "votableId": 35330914,
  "codingamerId": 4238671,
  "views": 260,
  "commentableId": 35176669,
  "title": "Literary Alfabet Soupe",
  "status": "ACCEPTED",
  "type": "PUZZLE_INOUT",
  "nickname": "DavidAugustoVilla",
  "publicHandle": "10927847b0d993b9733416113429dd01e93726",
  "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
  "lastVersion": {
    "version": 74,
    "autocloseTime": 1732213634574,
    "freezeTime": 1730226434574,
    "data": {
      "title": "Literary Alfabet Soupe",
      "topics": [
        {
          "labelMap": {
            "2": "Natural language"
          }
        },
        {
          "labelMap": {
            "2": "Unicode"
          }
        },
        {
          "labelMap": {
            "2": "Constraint propagation"
          }
        },
        {
          "labelMap": {
            "2": "Exact cover"
          }
        }
      ],
      "solution": "scrub = lambda text: set(each.lower() for each in text if each.isalpha())\nexcerpts = [scrub(input()) for _ in range(13)]\n\nalphabet = {}\nalphabet['English'] = letters = set('abcdefghijklmnopqrstuvwxyz')\n\nalphabet['Danish'] = letters - set('qz') | set('æåø')\nalphabet['Estonian'] = letters - set('cfqwxy') | set('šžõäöü')\nalphabet['Finnish'] = letters - set('bfqwx') | set('äö')\nalphabet['French'] = letters | set('çœëïüàèùâêîôûé')\nalphabet['German'] = letters | set('ßäöü')\nalphabet['Irish'] = letters - set('jkqvwxyz') | set('áéíóú')\nalphabet['Italian'] = letters - set('jkwxy') | set('àèìòùé')\nalphabet['Portuguese'] = letters - set('kw') | set('çãõàâêôáéíóú')\nalphabet['Spanish'] = letters - set('kw') | set('ñüáéíóú')\nalphabet['Swedish'] = letters - set('qw') | set('åäö')\nalphabet['Turkish'] = letters - set('qwx') | set('ğçşıöü') | {'İ'.lower()}\nalphabet['Welsh'] = letters - set('jkqvxz') | set('ŵŷâêîôû')\n\nmatches = lambda text: set(tongue for tongue in alphabet if text <= alphabet[tongue])\ncompatible = [matches(excerpt) for excerpt in excerpts]\n# Create the converse of compatible, going from language to excerpt index.\nchoices = {tongue: set() for tongue in alphabet}\nfor index, languages in enumerate(compatible):\n    for tongue in languages:\n        choices[tongue].add(index)\n\ndef eliminate(excerpt, language):\n    global compatible, choices\n    # Maintain invariants with the excerpt in this language excluded.\n    removals = {(excerpt, tongue) for tongue in compatible[excerpt]}\n    removals |= {(index, language) for index in choices[language]}\n    for index, tongue in removals:\n        compatible[index].remove(tongue)\n        choices[tongue].remove(index)\n\ndef reduction():\n    global compatible, choices\n    # Find an excerpt for which only a single matching language remains.\n    for index in range(13):\n        if len(compatible[index]) == 1:\n            language = list(compatible[index])[0]\n            return index, language\n    # Find a langugage associated with only a single remaining excerpt.\n    for language in choices:\n        if len(choices[language]) == 1:\n            index = list(choices[language])[0]\n            return index, language\n    raise\n\nresult = [None] * 13\nfor _ in range(13):\n    index, language = reduction()\n    eliminate(index, language)\n    result[index] = language\nfor language in result:\n    print(language)\n",
      "statement": "A quotation from a classic literary work has been translated into a dozen different European languages. However, the translations have all been shuffled in some arbitrary order. With the original mixed in, that's 13 languages altogether. What bad luck!\n\nGiven an [[excerpt]] in every one of these 13 languages, determine the order they're in by matching a unique language to each.\n\nAs a rule in this puzzle, <<English>> will use the 26 letters without diacritics as in {{résumé}}, {{naïve}}, and {{façade}}, nor ligatures as in {{Ægypt}} and {{amœba}}. Alphabets for other languages have further restrictions strictly adhered to, and other possibilities for alphabetic characters as detailed below:\n```\nLanguage   Exclusions   Inclusions\n─────────  ───────────  ─────────────────────────────────────\nDanish          q    z           æ å  ø                      \nEstonian    cf  q wxy        šž         õä  öü               \nFinnish    b f  q wx                     ä  ö                \nFrench                     ç      œ       ëï üàè  ùâêîôû é   \nGerman                  ß                ä  öü               \nIrish         jkqvwxyz                                  áéíóú\nItalian       jk  wxy                         àèìòù      é   \nPortuguese     k  w        ç           ãõ     à    âê ô áéíóú\nSpanish        k  w       ñ                  ü          áéíóú\nSwedish         q w                å     ä  ö                \nTurkish         q wx     ğ çş       İı      öü               \nWelsh         jkqv x z         ŵŷ                  âêîôû     \n           ───────────  ─────────────────────────────────────\n           bcfjkqvwxyz  ßğñçşšžŵŷæœåİıøãõäëïöüàèìòùâêîôûáéíóú```\nWhile this information is sufficient to solve the puzzle, it should be noted that language in general is highly patterned, so there are other approaches that can be used to discriminate the texts. For instance, the stop words {{they}}, {{who}} and {{only}} are exclusively found in <<English>>, and others are highly correlated. This and alternative ideas can similarly lead to valid (if more cumbersome) solutions.",
      "testCases": [
        {
          "title": "Don Quixote",
          "isTest": true,
          "testIn": "En un lugar de la Mancha, de cuyo nombre no quiero acordarme, no ha mucho tiempo que vivía un hidalgo de los de lanza en astillero, adarga antigua, rocín flaco y galgo corredor.\nIn a village of La Mancha, the name of which I have no desire to call to mind, there lived not long since one of those gentlemen that keep a lance in the lance-rack, an old buckler, a lean hack, and a greyhound for coursing.\nI en landsby i La Mancha, hvis navn jeg ikke vil huske, levede der for ikke så længe siden en hidalgo, en af dem med en lanse i våbenstativet, et gammelt skjold, en mager hest og en mynde til jagt.\nMantša külas, mille nime ma ei taha meelde tuletada, elas mitte kaua aega tagasi üks hidalgo, kes hoidis oda relvastendis, vana kilpi, kõhna hobust ja jahiks kasutatavat hagijat.\nEräässä La Manchan kylässä, jonka nimeä en halua muistaa, eli jokin aika sitten aatelismies, niistä jotka pitävät keihästä telineessä, vanhaa kilpeä, laihaa hevosta ja vinttikoiraa juoksemiseen.\nDans un village de la Manche, dont je ne veux pas me souvenir du nom, vivait il n'y a pas si longtemps un hidalgo de ceux qui possèdent une lance au râtelier, un vieux bouclier, un cheval maigre et un lévrier pour la chasse.\nIn einem Dorf in La Mancha, dessen Namen ich nicht nennen will, lebte vor nicht allzu langer Zeit ein Hidalgo, einer von denen, die eine Lanze im Waffenständer, einen alten Schild, ein mageres Ross und einen Windhund zum Jagen haben.\nI sráidbhaile i La Mancha, nach bhfuil fonn orm cuimhneamh ar a ainm, bhí hidalgo ina chónaí, ní fada ó shin, le sleá sa seilf arm, seanchlár sciath, capall tanaí agus galfghadhar chun seilge.\nIn un villaggio della Mancia, il cui nome non voglio ricordare, non molto tempo fa viveva un hidalgo, uno di quelli con la lancia nel rastrelliere, un vecchio scudo, un cavallo magro e un levriero per la caccia.\nNuma aldeia da Mancha, cujo nome não quero lembrar-me, não há muito tempo vivia um fidalgo daqueles que guardam uma lança no armário de armas, um velho escudo, um cavalo magro e um galgo corredor.\nI en by i La Mancha, vars namn jag inte vill minnas, bodde för inte så länge sedan en hidalgo, en av de där med en lans i vapenskåpet, en gammal sköld, en mager häst och en vinthund för jakt.\nAdını hatırlamak istemediğim La Mancha'daki bir köyde, uzun zaman önce olmayan, mızrağını rafında tutan, eski bir kalkan, zayıf bir at ve avcılık için bir tazı olan bir hidalgo yaşıyordu.\nMewn pentref yn La Mancha, nad wyf am gofio'r enw, roedd hidalgo yn byw, nid yn rhy hir yn ôl, gyda gwaywffon yn y rhestr arfau, tarian hen, ceffyl main, a milgi ar gyfer hela.",
          "testOut": "Spanish\nEnglish\nDanish\nEstonian\nFinnish\nFrench\nGerman\nIrish\nItalian\nPortuguese\nSwedish\nTurkish\nWelsh",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Miguel de Cervantes",
          "isTest": false,
          "testIn": "Cuando la misma vida parece una locura, ¿quién sabe dónde yace la verdadera locura? Quizás ser demasiado práctico sea una locura. Renunciar a los sueños --esto puede ser una locura. Demasiada cordura puede ser una locura, y lo más loco de todo: ver la vida tal como es, y no como debería ser.\nQuand la vie elle-même semble folle, qui sait où réside la véritable folie ? Peut-être qu'être trop pratique est une folie. Abandonner ses rêves -- cela peut être une folie. Trop de raison peut être une folie -- et la plus grande folie de toutes : voir la vie telle qu'elle est, et non telle qu'elle devrait être.\nWenn das Leben selbst verrückt erscheint, wer weiß, wo der wahre Wahnsinn liegt? Vielleicht ist es Wahnsinn, zu praktisch zu sein. Seine Träume aufzugeben -- das könnte Wahnsinn sein. Zu viel Vernunft könnte Wahnsinn sein -- und das Verrückteste von allem: das Leben so zu sehen, wie es ist, und nicht, wie es sein sollte!\nQuando la vita stessa sembra una follia, chi sa dove giace la vera follia? Forse essere troppo pratici è follia. Rinunciare ai sogni -- questo potrebbe essere follia. Troppa sanità mentale può essere follia -- e la più grande follia di tutte: vedere la vita com'è, e non come dovrebbe essere!\nQuando a própria vida parece uma loucura, quem sabe onde reside a verdadeira loucura? Talvez ser prático demais seja loucura. Abandonar os sonhos -- isso pode ser loucura. Muita sanidade pode ser loucura -- e a maior loucura de todas: ver a vida como ela é, e não como deveria ser!\nWhen life itself seems lunatic, who knows where madness lies? Perhaps to be too practical is madness. To surrender dreams--this may be madness. Too much sanity may be madness--and maddest of all: to see life as it is, and not as it should be!\nNär livet självt verkar galet, vem vet var galenskapen ligger? Kanske är det galenskap att vara för praktisk. Att ge upp drömmar -- detta kan vara galenskap. För mycket förnuft kan vara galenskap -- och det galnaste av allt: att se livet som det är, och inte som det borde vara!\nNår livet selv synes skørt, hvem ved hvor vanviddet ligger? Måske er det vanvittigt at være for praktisk. At opgive drømme -- det kan være vanvid. For meget fornuft kan være vanvid -- og det mest vanvittige af alt: at se livet som det er, og ikke som det burde være!\nKun itse elämä näyttää hullulta, kuka tietää, missä hulluus piilee? Ehkä on hulluutta olla liian käytännöllinen. Luopua unelmista -- tämä voi olla hulluutta. Liiallinen järkevyys voi olla hulluutta -- ja kaikista hulluin: nähdä elämä sellaisena kuin se on, eikä sellaisena kuin sen pitäisi olla!\nHayatın kendisi delilik gibi görünürken, gerçek deliliğin nerede olduğunu kim bilebilir? Belki de çok pratik olmak deliliktir. Hayallerden vazgeçmek -- bu delilik olabilir. Çok fazla akıl sağlığı delilik olabilir -- ve en büyük delilik: hayatı olduğu gibi görmek, olması gerektiği gibi değil!\nKui elu ise näib hullumeelne, kes teab, kus peitub tõeline hullus? Võib-olla on liiga praktiline olemine hullumeelsus. Unistustest loobumine -- see võib olla hullumeelsus. Liigne mõistlikkus võib olla hullumeelsus -- ja kõige hullumeelsem kõigist: näha elu sellisena, nagu see on, mitte sellisena, nagu see peaks olema!\nPan fydd bywyd ei hun yn ymddangos yn wallgof, pwy a ŵyr ble mae'r gwir wallgofrwydd yn gorwedd? Efallai fod bod yn rhy ymarferol yn wallgofrwydd. Rhoi'r gorau i freuddwydion -- gallai hyn fod yn wallgofrwydd. Gormod o reswm gallai fod yn wallgofrwydd -- a'r peth mwyaf gwallgof o bob un: gweld bywyd fel ag y mae, ac nid fel ag y dylai fod!\nNuair a bhíonn an saol féin cosúil le buile, cé atá in ann a rá cá bhfuil an fhíorbhuile? B'fhéidir go bhfuil sé buile a bheith ró-phraiticiúil. Tabhairt suas ar bhrionglóidí -- is féidir leis seo a bheith ina bhuile. D'fhéadfadh ró-réasúin a bheith ina bhuile -- agus an rud is buile ar fad: an saol a fheiceáil mar atá sé, agus ní mar ba chóir dó a bheith!",
          "testOut": "Spanish\nFrench\nGerman\nItalian\nPortuguese\nEnglish\nSwedish\nDanish\nFinnish\nTurkish\nEstonian\nWelsh\nIrish",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Les Misérables",
          "isTest": true,
          "testIn": "La vie misérable de ce pauvre homme fut longue; il traversa toutes les vicissitudes et toutes les souffrances de l'humanité; et à travers tout cela, il resta doux, patient, résigné, immuable dans son espérance, et indéracinable dans sa foi.\nThe miserable life of this poor man was long; he went through all the vicissitudes and all the sufferings of humanity; and through it all, he remained gentle, patient, resigned, unchanging in his hope, and indomitable in his faith.\nRoedd bywyd truenus y dyn tlawd hwn yn hir; aeth trwy holl drobwyntiau a holl ddioddefiadau dynoliaeth; ac er gwaethaf hyn i gyd, roedd yn aros yn dyner, yn amyneddgar, yn ddigonol, yn ansefydlog yn ei obaith, ac yn anorchfygol yn ei ffydd.\nBhí saol truamhéalach an fhir bhocht seo fada; chuaigh sé trí gach cor agus gach fulaingt a bhain le cine daonna; agus trí sin go léir, d'fhan sé séimh, foighneach, géilleadhach, seasmhach ina dhóchas agus neamhcheansaithe ina chreideamh.\nDas elende Leben dieses armen Mannes war lang; er durchlief alle Wechselfälle und alle Leiden der Menschheit; und durch all das hindurch blieb er sanft, geduldig, ergeben, unverändert in seiner Hoffnung und unerschütterlich in seinem Glauben.\nLa miserable vida de este pobre hombre fue larga; atravesó todas las vicisitudes y todos los sufrimientos de la humanidad; y a través de todo eso, se mantuvo dulce, paciente, resignado, inmutable en su esperanza, e indomable en su fe.\nLa vita miserabile di quest'uomo povero fu lunga; attraversò tutte le vicissitudini e tutte le sofferenze dell'umanità; e attraverso tutto ciò, rimase dolce, paziente, rassegnato, immutabile nella sua speranza, e indomabile nella sua fede.\nA vida miserável deste homem pobre foi longa; ele passou por todas as vicissitudes e todos os sofrimentos da humanidade; e através de tudo isso, ele permaneceu gentil, paciente, resignado, imutável na sua esperança e indomável na sua fé.\nDet elendige liv for denne fattige mand var langt; han gennemgik alle skæbneslag og al menneskehedens lidelser; og gennem det hele forblev han blid, tålmodig, resigneret, uforanderlig i sit håb og urokkelig i sin tro.\nDet eländiga livet för denna fattiga man var långt; han genomgick alla skiftningar och alla mänsklighetens lidanden; och genom allt detta förblev han mild, tålmodig, resignerad, oföränderlig i sitt hopp och orubblig i sin tro.\nTämän köyhän miehen kurja elämä oli pitkä; hän kävi läpi kaikki ihmisyyden koettelemukset ja kärsimykset; ja kaiken tämän kautta hän pysyi lempeänä, kärsivällisenä, alistuneena, muuttumattomana toivossaan ja järkähtämättömänä uskossaan.\nBu fakir adamın sefil hayatı uzundu; insanlığın tüm zorluklarını ve acılarını yaşadı; ve tüm bunlara rağmen nazik, sabırlı, kaderine razı, umudunda değişmez ve inancında sarsılmaz kaldı.\nSelle vaese mehe vilets elu oli pikk; ta läbis kõik inimkonna katsumused ja kannatused; ja kõige selle kaudu jäi ta leebe, kannatlik, alistunud, muutumatu oma lootuses ja vankumatu oma usus.",
          "testOut": "French\nEnglish\nWelsh\nIrish\nGerman\nSpanish\nItalian\nPortuguese\nDanish\nSwedish\nFinnish\nTurkish\nEstonian",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Victor Hugo",
          "isTest": false,
          "testIn": "Aimer une autre personne, c'est voir le visage de Dieu. Tu entends, Cosette ? Dans cette vie, l'amour est plus fort que la mort. Il est plus fort que toutes les luttes, misères et souffrances du monde. Voilà pourquoi nous devons aimer. L'amour sauve et rachète l'âme.\nAmar outra pessoa é ver o rosto de Deus. Você ouve, Cosette? Nesta vida, o amor é mais forte que a morte. É mais forte que todas as lutas, misérias e sofrimentos do mundo. É por isso que devemos amar. O amor salva e redime a alma.\nAmar a otra persona es ver el rostro de Dios. ¿Oyes, Cosette? En esta vida, el amor es más fuerte que la muerte. Es más fuerte que todas las luchas, miserias y sufrimientos del mundo. Por eso debemos amar. El amor salva y redime el alma.\nCaru person arall yw gweld wyneb Duw. Wyt ti'n clywed, Cosette? Yn y bywyd hwn, mae cariad yn gryfach na marwolaeth. Mae'n gryfach na'r holl frwydrau, cystuddiau a dioddefiadau yn y byd. Dyna pam mae'n rhaid i ni garu. Mae cariad yn achub ac yn prynu'r enaid.\nChun grá a thabhairt do dhuine eile, is é sin aghaidh Dé a fheiceáil. An gcloiseann tú, Cosette? Sa saol seo, tá an grá níos láidre ná an bás. Tá sé níos láidre ná na streachailtí, bochtaineacht agus fulaingt ar fad ar domhan. Sin an fáth go gcaithfimid grá a thabhairt. Sábhálann an grá an t-anam agus fuascailt é.\nAtt älska en annan person är att se Guds ansikte. Hör du, Cosette? I detta liv är kärleken starkare än döden. Den är starkare än alla strider, eländen och lidanden i världen. Det är därför vi måste älska. Kärleken räddar och befriar själen.\nEinen anderen Menschen zu lieben, heißt das Gesicht Gottes zu sehen. Hörst du, Cosette? In diesem Leben ist die Liebe stärker als der Tod. Sie ist stärker als alle Kämpfe, Nöte und Leiden in der Welt. Deshalb müssen wir lieben. Die Liebe rettet und erlöst die Seele.\nAt elske en anden person er at se Guds ansigt. Hører du, Cosette? I dette liv er kærligheden stærkere end døden. Den er stærkere end alle kampe, elendigheder og lidelser i verden. Det er derfor vi må elske. Kærlighed frelser og forløser sjælen.\nAmare un'altra persona è vedere il volto di Dio. Senti, Cosette? In questa vita, l'amore è più forte della morte. È più forte di tutte le lotte, miserie e sofferenze del mondo. Ecco perché dobbiamo amare. L'amore salva e redime l'anima.\nToisen ihmisen rakastaminen on kuin nähdä Jumalan kasvot. Kuulethan, Cosette? Tässä elämässä rakkaus on vahvempi kuin kuolema. Se on vahvempi kuin kaikki maailman taistelut, kurjuudet ja kärsimykset. Siksi meidän on rakastettava. Rakkaus pelastaa ja lunastaa sielun.\nBaşka bir insanı sevmek, Tanrı'nın yüzünü görmektir. Duyuyor musun, Cosette? Bu hayatta, sevgi ölümden daha güçlüdür. Dünyadaki tüm mücadelelerden, sefaletten ve acılardan daha güçlüdür. Bu yüzden sevmeliyiz. Sevgi ruhu kurtarır ve bağışlar.\nTeist inimest armastada tähendab näha Jumala nägu. Kuule, Kosette? Selles elus on armastus tugevam kui surm. See on tugevam kui kõik maailma võitlused, viletsused ja kannatused. Sellepärast peame armastama. Armastus päästab ja lunastab hinge.\nTo love another person is to see the face of God. Do you hear, Cosette? In this life, love is stronger than death. It is stronger than all the struggles, miseries, and suffering in the world. This is why we must love. Love saves and redeems the soul.",
          "testOut": "French\nPortuguese\nSpanish\nWelsh\nIrish\nSwedish\nGerman\nDanish\nItalian\nFinnish\nTurkish\nEstonian\nEnglish",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Den grimme ælling",
          "isTest": true,
          "testIn": "Den så under sig sit eget billede, men den var ikke længere en kluntet, sortgrå fugl, styg og fæl, den var selv en svane. Det gør ikke noget at være født i andegården, når man kun har ligget i et svaneæg!\nHis own image; no longer a dark, gray bird, ugly and disagreeable to look at, but a graceful and beautiful swan. To be born in a duck's nest, in a farmyard, is of no consequence to a bird, if it is hatched from a swan's egg.\nLa sua stessa immagine; non più un uccello grigio scuro, brutto e sgradevole da guardare, ma un cigno elegante e bello. Non importa essere nati in un nido di anatre in una fattoria, se si è stati covati da un uovo di cigno.\nOmaenda peegeldus; mitte enam tumehall lind, inetu ja ebameeldiv vaadata, vaid graatsiline ja ilus luik. Pole oluline, kui sa sündisid pardipesas, talus, kui sa koorud luigemunast.\nSua própria imagem; não mais uma ave cinza escura, feia e desagradável de se ver, mas um gracioso e belo cisne. Não importa ter nascido em um ninho de patos, em uma fazenda, se você foi chocado de um ovo de cisne.\nOma kuvansa; ei enää tumma, harmaa lintu, ruma ja epämiellyttävä katsella, vaan sulava ja kaunis joutsen. Ei ole merkitystä, vaikka olisi syntynyt ankka pesässä, maatilalla, kunhan on kuoriutunut joutsenen munasta.\nSu propia imagen; ya no un pájaro gris oscuro, feo y desagradable a la vista, sino un elegante y hermoso cisne. No importa haber nacido en un nido de patos, en una granja, si se ha salido de un huevo de cisne.\nKendi yansıması; artık karanlık, gri bir kuş, çirkin ve bakması nahoş değil, zarif ve güzel bir kuğu. Bir kuğunun yumurtasından çıktıktan sonra, bir ördeğin yuvasında, çiftlikte doğmuş olmanın önemi yoktur.\nSin egen spegelbild; inte längre en mörkgrå fågel, ful och obehaglig att se på, utan en graciös och vacker svan. Det spelar ingen roll om man föds i ett ankbo, på en bondgård, om man har kläckts ur ett svanägg.\nA scáthán féin; níorbh é sin tuilleadh éan dorcha, liath, gránna agus míthaitneamhach ar chor ar bith, ach eala ghrástúil agus álainn. Ní chuireann sé isteach a bheith rugadh i nead lachan, ar fheirm, má thagann tú as ubh eala.\nSon propre reflet; il n'était plus un oiseau gris foncé, laid et désagréable à voir, mais un cygne gracieux et magnifique. Peu importe d'être né dans un nid de canard, dans une basse-cour, quand on a éclos d'un œuf de cygne.\nEi ddrych ei hun; nid oedd bellach yn aderyn tywyll a llwyd, hyll ac annymunol i'w weld, ond yn alarch hardd a graslon. Nid oes ots o gwbl eich bod wedi eich geni mewn nyth hwyaid, mewn buarth fferm, os ydych wedi deor o wy alarch.\nSein eigenes Bild; nicht länger ein dunkler, grauer Vogel, hässlich und unangenehm anzusehen, sondern ein anmutiger und schöner Schwan. Es ist unwichtig, in einem Entennest, auf einem Bauernhof, geboren zu sein, wenn man aus einem Schwanenei geschlüpft ist.",
          "testOut": "Danish\nEnglish\nItalian\nEstonian\nPortuguese\nFinnish\nSpanish\nTurkish\nSwedish\nIrish\nFrench\nWelsh\nGerman",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Hans Christian Andersen",
          "isTest": false,
          "testIn": "Så kunne de se, at det var en rigtig prinsesse, da hun gennem de tyve madrasser og de tyve edderdunsdyner havde mærket ærten. Så ømskindet kunne der ingen være, uden en virkelig prinsesse.\nAlors ils purent voir qu'elle était une vraie princesse, car elle avait ressenti le petit pois à travers vingt matelas et vingt édredons en plumes. Personne d'autre qu'une princesse ne pouvait être aussi délicate.\nThey could see she was a real Princess and no question about it, now that she had felt one pea all the way through twenty mattresses and twenty more feather beds. Nobody but a Princess could be so delicate.\nYna fe welon nhw ei bod yn dywysoges go iawn, oherwydd ei bod wedi teimlo'r eirinen drwy ugain matras ac ugain dillad gwely plu. Ni allai neb fod mor dyner ond tywysoges wirioneddol.\nAllora poterono vedere che era una vera principessa, poiché attraverso i venti materassi e i venti piumini aveva sentito il pisello. Nessuno poteva essere così delicato, se non una vera principessa.\nSiis nad võisid näha, et ta oli tõeline printsess, kuna ta tundis hernest läbi kahekümne madratsi ja kahekümne udusuleteki. Nii õrn ei saanud olla keegi peale tõelise printsessi.\nEntão eles viram que ela era uma verdadeira princesa, pois ela havia sentido a ervilha através de vinte colchões e vinte edredões de penas. Ninguém poderia ser tão delicada, a não ser uma verdadeira princesa.\nHe saattoivat nähdä, että hän oli oikea prinsessa, koska hän tunsi herneen läpi kahdenkymmenen patjan ja kahdenkymmenen untuvapeitteen. Kukaan muu kuin prinsessa ei voisi olla niin herkkä.\nEntonces pudieron ver que era una verdadera princesa, ya que había sentido el guisante a través de veinte colchones y veinte edredones de plumas. Nadie más que una princesa podía ser tan delicada.\nBöylece onun gerçek bir prenses olduğunu görebildiler, çünkü o, yirmi şilte ve yirmi kuştüyü yorganın arasından bir bezelyeyi hissedebilmişti. Hiç kimse, bir prenses dışında bu kadar narin olamazdı.\nDå kunde de se att hon var en riktig prinsessa, eftersom hon hade känt ärtan genom tjugo madrasser och tjugo fjäderbäddar. Ingen kunde vara så ömtålig, utom en riktig prinsessa.\nAnsin d'fhéadfadh siad a fheiceáil gur banphrionsa ceart í, toisc gur bhraith sí an phiseóg tríd fiche tocht agus fiche pluide cleití. Ní fhéadfadh aon duine a bheith chomh mín ach banphrionsa.\nDa konnten sie sehen, dass es eine wirkliche Prinzessin war, weil sie die Erbse durch zwanzig Matratzen und zwanzig Daunendecken hindurch gespürt hatte. So zart konnte niemand sein, außer einer echten Prinzessin.",
          "testOut": "Danish\nFrench\nEnglish\nWelsh\nItalian\nEstonian\nPortuguese\nFinnish\nSpanish\nTurkish\nSwedish\nIrish\nGerman",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Pride and Prejudice",
          "isTest": true,
          "testIn": "It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife. However little known the feelings or views of such a man may be on his first entering a neighbourhood, this truth is so well fixed in the minds of the surrounding families, that he is considered as the rightful property of some one or other of their daughters.\nC'est une vérité universellement reconnue qu'un homme seul en possession d'une grande fortune doit être en quête d'une femme. Si peu connues que puissent être les sentiments ou les opinions d'un tel homme lors de son arrivée dans un voisinage, cette vérité est si bien ancrée dans l'esprit des familles environnantes, qu'il est considéré comme le juste apanage de l'une ou l'autre de leurs filles.\nEs ist allgemein anerkannt, dass ein alleinstehender Mann im Besitz eines großen Vermögens auf der Suche nach einer Frau sein muss. Wie wenig auch die Gefühle oder Ansichten eines solchen Mannes bei seinem ersten Eintreten in eine Nachbarschaft bekannt sein mögen, so ist diese Wahrheit so fest in den Köpfen der umliegenden Familien verankert, dass er als das rechtmäßige Eigentum einer ihrer Töchter angesehen wird.\nÈ una verità universalmente riconosciuta che un uomo solo in possesso di una grande fortuna debba essere alla ricerca di una moglie. Per quanto poco possano essere conosciuti i sentimenti o le opinioni di un tale uomo al suo primo ingresso in un quartiere, questa verità è così ben radicata nella mente delle famiglie circostanti, che viene considerato come la legittima proprietà di una delle loro figlie.\nÉ uma verdade universalmente reconhecida que um homem solteiro em posse de uma grande fortuna deve estar à procura de uma esposa. Por mais desconhecidos que sejam os sentimentos ou pontos de vista de um homem assim ao entrar pela primeira vez num bairro, esta verdade está tão bem fixada nas mentes das famílias vizinhas que ele é considerado a legítima propriedade de uma ou outra de suas filhas.\nDet er en sandhed universelt anerkendt, at en enlig mand med stor formue må være på udkig efter en kone. Uanset hvor lidt kendt en sådan mands følelser eller synspunkter måtte være, når han først træder ind i et kvarter, er denne sandhed så fast forankret i de omkringliggende familiers sind, at han betragtes som den retmæssige ejendom for en af deres døtre.\nSee on üldtunnustatud tõde, et vallaline mees, kellel on suur varandus, peab otsima naist. Kui vähe tuntaksegi sellise mehe tundeid või vaateid tema esimesel sisenemisel naabruskonda, on see tõde nii tugevalt kinnistunud ümbritsevate perede meeltes, et teda peetakse õiguspäraselt ühe või teise tütre omandiks.\nOn yleisesti tunnustettu totuus, että naimaton mies, jolla on suuri omaisuus, etsii vaimoa. Kuinka vähän sellaisen miehen tunteet tai näkemykset voivatkaan olla tiedossa hänen saapuessaan ensimmäisen kerran naapurustoon, tämä totuus on niin syvälle juurtunut ympäröivien perheiden mieliin, että häntä pidetään jonkun heidän tyttärensä oikeutettuna omaisuutena.\nIs fírinne é a aithnítear go huilíoch go gcaithfidh fear singil a bhfuil mórán saibhris aige bheith ag lorg mná céile. Cé chomh beag agus a d'fhéadfadh mothúcháin nó tuairimí a leithéid de fhear a bheith ar eolas nuair a thagann sé isteach i gcomharsanacht don chéad uair, tá an fhírinne seo chomh docht i gcuimhne na dteaghlach máguaird go meastar é mar mhaoin cheart éigin dá n-iníonacha.\nEs una verdad universalmente aceptada que un hombre soltero en posesión de una gran fortuna debe estar en busca de una esposa. Por muy poco que se conozcan los sentimientos o puntos de vista de un hombre así al entrar por primera vez en un vecindario, esta verdad está tan firmemente arraigada en la mente de las familias circundantes, que se le considera como la propiedad legítima de una de sus hijas.\nDet är en allmänt erkänd sanning att en ensam man med en stor förmögenhet måste vara på jakt efter en fru. Hur lite en sådan mans känslor eller åsikter kan vara kända vid hans första ankomst till ett grannskap, är denna sanning så fast förankrad i de omgivande familjernas sinnen att han anses som den rättmätiga ägodelen till någon av deras döttrar.\nİyi bir servete sahip bekar bir adamın bir eş arayacağı evrensel olarak kabul edilen bir gerçektir. Böyle bir adamın duyguları veya görüşleri ilk kez bir mahalleye girdiğinde ne kadar az biliniyor olursa olsun, bu gerçek çevredeki ailelerin zihinlerinde o kadar köklüdür ki, adam onların kızlarından birine ait haklı bir mülk olarak kabul edilir.\nMae'n wirionedd a gydnabyddir yn gyffredinol fod dyn sengl sydd â ffortiwn mawr yn chwilio am wraig. Er mor anghyfarwydd y gallai fod teimladau neu safbwyntiau dyn o'r fath ar ei ymweliad cyntaf â chymdogaeth, mae'r gwirionedd hwn mor gadarn yn meddyliau'r teuluoedd cyfagos, fel y'i hystyrir yn eiddo cyfreithlon un o'u merched.",
          "testOut": "English\nFrench\nGerman\nItalian\nPortuguese\nDanish\nEstonian\nFinnish\nIrish\nSpanish\nSwedish\nTurkish\nWelsh",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Jane Austen",
          "isTest": false,
          "testIn": "How pleasant it is to spend an evening in this way! I declare, after all, there is no enjoyment like reading! How much sooner one tires of anything than of a book! When I have a house of my own, I shall be miserable if I have not an excellent library.\nCom'è piacevole passare una serata in questo modo! Dichiaratamente, dopotutto, non c'è godimento pari alla lettura! Quanto più presto ci si stanca di qualsiasi cosa rispetto a un libro! Quando avrò una casa tutta mia, sarò infelice se non avrò un'eccellente biblioteca.\nKui meeldiv on veeta õhtu niimoodi! Ma kinnitan, et lõpuks pole midagi nauditavamat kui lugemine! Kui kiiresti tüdineb kõigest muust, aga mitte raamatust! Kui mul kunagi on oma maja, olen õnnetu, kui mul pole suurepärast raamatukogu.\nQue agradável é passar uma noite desta forma! Eu declaro, afinal, não há prazer como a leitura! Como nos cansamos de qualquer coisa mais rápido do que de um livro! Quando eu tiver uma casa própria, serei infeliz se não tiver uma excelente biblioteca.\nKuinka miellyttävää onkaan viettää ilta näin! Vakuutan, että loppujen lopuksi ei ole mitään nautinnollisempaa kuin lukeminen! Kuinka paljon nopeammin kyllästyy mihinkään muuhun kuin kirjaan! Kun minulla on oma talo, olen onneton, jos minulla ei ole erinomaista kirjastoa.\n¡Qué agradable es pasar una velada de esta manera! Declaro que, después de todo, no hay disfrute como la lectura. ¡Qué rápido uno se cansa de cualquier cosa, menos de un libro! Cuando tenga una casa propia, seré miserable si no tengo una excelente biblioteca.\nHvor er det dog dejligt at tilbringe en aften på denne måde! Jeg må sige, der er intet, der giver så stor nydelse som at læse! Man bliver træt af alt andet hurtigere end af en bog! Når jeg får mit eget hus, vil jeg være ulykkelig, hvis jeg ikke har et fremragende bibliotek.\nBir akşamı bu şekilde geçirmek ne kadar hoş! Sonuçta, okumak gibi bir zevk yok, bunu açıkça söylüyorum! Bir kitaptan daha hızlı başka bir şeyden bıkmak mümkün değil! Kendi evim olduğunda, mükemmel bir kütüphanem yoksa çok mutsuz olacağım.\nHur trevligt det är att tillbringa en kväll på detta sätt! Jag måste säga, till slut finns det inget nöje som läsning! Hur mycket snabbare man tröttnar på allt annat än en bok! När jag har ett eget hus, kommer jag att vara olycklig om jag inte har ett utmärkt bibliotek.\nNach álainn an rud é oíche a chaitheamh mar seo! Dearbhaím, sa deireadh thiar, níl aon taitneamh cosúil le léamh! Tá sé i bhfad níos éasca tuirse a fháil de rud ar bith seachas leabhar! Nuair a bheidh mo theach féin agam, beidh mé in ísle brí mura mbeidh leabharlann iontach agam.\nComme il est agréable de passer une soirée de cette manière ! Je déclare qu'après tout, il n'y a pas de plaisir comparable à la lecture ! Comme on se lasse plus vite de tout que d'un livre ! Quand j'aurai une maison à moi, je serai malheureuse si je n'ai pas une excellente bibliothèque.\nMor braf yw treulio noson fel hyn! Yr wyf yn datgan, wedi'r cyfan, nid oes dim yn rhoi mwy o fwynhad na darllen! Pa mor gyflym y mae rhywun yn blino ar unrhyw beth heblaw llyfr! Pan fydd gen i dŷ fy hun, byddaf yn anhapus os nad oes gennyf lyfrgell ragorol.\nWie angenehm es ist, einen Abend auf diese Weise zu verbringen! Ich erkläre, am Ende gibt es nichts, das so viel Freude bereitet wie das Lesen! Wie schnell man sich an allem anderen satt sieht, aber nicht an einem Buch! Wenn ich ein eigenes Haus habe, werde ich unglücklich sein, wenn ich keine ausgezeichnete Bibliothek habe.",
          "testOut": "English\nItalian\nEstonian\nPortuguese\nFinnish\nSpanish\nDanish\nTurkish\nSwedish\nIrish\nFrench\nWelsh\nGerman",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Nils Holgerssons underbara resa genom Sverige",
          "isTest": true,
          "testIn": "Det var en gång en pojke. Han var - låt oss säga - ungefär fjorton år gammal; lång och gänglig och ljushårig. Han var inte mycket till nytta, den där pojken. Hans största glädje var att äta och sova; och därefter - tyckte han bäst om att ställa till rackartyg.\nKord oli üks poiss. Ta oli--ütleme--umbes neljateistkümne aastane; pikk ja kondine ning heledapäine. See poiss ei olnud eriti kasulik. Tema suurim rõõm oli süüa ja magada; ja pärast seda--meeldis talle kõige rohkem pahandust teha.\nOlipa kerran poika. Hän oli--sanotaan--noin neljätoistavuotias; pitkä ja hoikka ja vaaleahiuksinen. Se poika ei ollut paljon hyödyksi. Hänen suurin ilonsa oli syödä ja nukkua; ja sen jälkeen--hän piti eniten kepposten tekemisestä.\n C'era una volta un ragazzo. Aveva--diciamo--circa quattordici anni; alto, snodato e biondo. Quel ragazzo non era buono a molto. Il suo piacere principale era mangiare e dormire; e dopo questo--gli piaceva soprattutto fare dispetti.\nHabía una vez un niño. Tenía--digamos--unos catorce años; alto, desgarbado y rubio. Ese niño no servía para mucho. Su mayor deleite era comer y dormir; y después de eso--lo que más le gustaba era hacer travesuras.\nBir zamanlar bir çocuk vardı. O--diyelim ki--on dört yaşlarındaydı; uzun boylu, sıska ve sarı saçlı. O çocuk pek işe yaramazdı. En büyük zevki yemek ve uyumaktı; ondan sonra--en çok yaramazlık yapmaktan hoşlanırdı.\nFadó bhí buachaill ann. Bhí sé--abair--thart ar cheithre bliana déag d'aois; ard agus scaoilte agus gruaig fhionn air. Ní raibh mórán maitheasa ann, an buachaill sin. Bhí an-áthas air ag ithe agus ag codladh; agus ina dhiaidh sin--ba é an rud ab ansa leis ná trioblóid a tharraingt.\nDer var engang en dreng. Han var--lad os sige--omkring fjorten år gammel; lang, ranglet og lyshåret. Han var ikke til megen nytte, den dreng. Hans største glæde var at spise og sove; og efter det--kunne han bedst lide at lave ballade.\nRoedd bachgen yn byw un tro. Roedd yn--dywedwn ni--tua deuddeg oed; tal ac esgeulus a blewyn llwydlas. Nid oedd y bachgen hwnnw'n dda i lawer. Ei brif bleser oedd bwyta a chysgu; ac ar ôl hynny--yr hyn yr oedd yn ei hoffi orau oedd gwneud drygioni.\nIl était une fois un garçon. Il avait--disons--environ quatorze ans; grand, dégingandé et blond. Ce garçon n'était pas très utile. Son plus grand plaisir était de manger et de dormir; et après cela--ce qu'il aimait le plus, c'était faire des bêtises.\nEs war einmal ein Junge. Er war--sagen wir--etwa vierzehn Jahre alt; groß, schlaksig und hellhaarig. Dieser Junge war zu nichts nütze. Seine größte Freude war es, zu essen und zu schlafen; und danach--machte er am liebsten Unfug.\nEra uma vez um menino. Ele tinha--digamos--uns quatorze anos; alto, desajeitado e de cabelos loiros. Aquele menino não servia para muita coisa. Sua maior alegria era comer e dormir; e depois disso--o que mais gostava era de aprontar.\nOnce there was a boy. He was--let us say--something like fourteen years old; long and loose-jointed and towheaded. He wasn't good for much, that boy. His chief delight was to eat and sleep; and after that--he liked best to make mischief.",
          "testOut": "Swedish\nEstonian\nFinnish\nItalian\nSpanish\nTurkish\nIrish\nDanish\nWelsh\nFrench\nGerman\nPortuguese\nEnglish",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Selma Lagerlöf",
          "isTest": false,
          "testIn": "Om den staden, som han hade sett, inte hade sjunkit i havet igen, så skulle den kanske ha blivit lika förfallen som den här efter en tid. Kanske skulle den inte ha stått emot tidens tand, utan ha stått där med taklösa kyrkor och öde hus och övergivna, tomma gator - precis som den här.\nKui see linn, mida ta oli näinud, ei oleks uuesti merre vajunud, siis oleks see võib-olla varsti samamoodi lagunenud nagu see siin. Võib-olla poleks see ajale ja lagunemisele vastu pidanud, vaid oleks seisnud seal katusteta kirikutega, tühjade majade ja kõledate, inimtühjade tänavatega--täpselt nagu see siin.\nSe aquela cidade, que ele tinha visto, não tivesse afundado no mar novamente, talvez ela se tornasse tão decadente quanto esta em pouco tempo. Talvez não tivesse resistido ao tempo e à decadência, e teria ficado ali com igrejas sem teto, casas vazias e ruas desertas e abandonadas--exatamente como esta.\nJos se kaupunki, jonka hän oli nähnyt, ei olisi vajonnut takaisin mereen, niin siitä olisi ehkä tullut yhtä rappeutunut kuin tästä jonkin ajan kuluttua. Ehkä se ei olisi kestänyt aikaa ja rappeutumista, vaan seisoisi siellä katottomien kirkkojen, paljaiden talojen ja autioiden, tyhjien katujen kanssa--ihan kuten tämäkin.\nSe quella città, che aveva visto, non fosse affondata di nuovo nel mare, forse sarebbe diventata altrettanto fatiscente come questa tra un po' di tempo. Forse non avrebbe potuto resistere al tempo e al decadimento, e sarebbe rimasta lì con chiese senza tetto, case spoglie e strade desolate e vuote--proprio come questa.\nSi esa ciudad, que había visto, no se hubiera hundido de nuevo en el mar, tal vez se habría vuelto tan deteriorada como esta en poco tiempo. Tal vez no podría haber resistido al tiempo y a la decadencia, y habría quedado allí con iglesias sin techo, casas vacías y calles desiertas--igual que esta.\nEğer gördüğü o şehir tekrar denizin dibine batmamış olsaydı, belki de kısa bir süre içinde burası kadar harap olurdu. Belki de zamanın ve çürümüşlüğün karşısında dayanamazdı ve çatısız kiliseleri, çıplak evleri ve ıssız, boş sokaklarıyla--tıpkı burası gibi kalırdı.\nMura raibh an chathair sin, a chonaic sé, tar éis dul faoi uisce arís, b'fhéidir go mbeadh sí chomh tréigthe leis an gceann seo tar éis tamaill. B'fhéidir nach bhféadfadh sí seasamh in aghaidh an ama agus na meathlaithe, agus d'fhanfadh sí ann le heaglaisí gan díon, tithe loma agus sráideanna folmha tréigthe--díreach mar atá an ceann seo.\nHvis den by, han havde set, ikke var sunket i havet igen, så ville den måske snart være blevet lige så forfalden som denne her. Måske kunne den ikke have modstået tidens tand og forfald, men ville have stået der med tagløse kirker, bare huse og øde, tomme gader--ligesom denne.\nPe na bai'r ddinas honno, yr oedd wedi'i gweld, wedi suddo'n ôl i'r môr, yna byddai'n debygol o fod mor ddrwg â hon mewn ychydig o amser. Efallai na fyddai wedi gallu gwrthsefyll amser a dirywiad, ond byddai wedi sefyll yno gyda'i heglwysi heb doeau, tai noeth ac yn strydoedd diffaith wag--yn union fel hon.\nSi cette ville, qu'il avait vue, n'était pas retombée dans la mer, elle serait peut-être devenue aussi délabrée que celle-ci en peu de temps. Peut-être qu'elle n'aurait pas pu résister au temps et à la décrépitude, et elle se serait tenue là avec des églises sans toit, des maisons vides et des rues désertes et vides--tout comme celle-ci.\nWenn diese Stadt, die er gesehen hatte, nicht wieder ins Meer gesunken wäre, dann wäre sie vielleicht bald so verfallen wie diese hier. Vielleicht hätte sie der Zeit und dem Verfall nicht widerstanden, sondern wäre dort mit dachlosen Kirchen, leeren Häusern und verlassenen, leeren Straßen gestanden--genauso wie diese.\nIf that city, which he had seen, had not sunk into the sea again, then it would perhaps become as dilapidated as this one in a little while. Perhaps it could not have withstood time and decay, but would have stood there with roofless churches and bare houses and desolate, empty streets-just like this one.",
          "testOut": "Swedish\nEstonian\nPortuguese\nFinnish\nItalian\nSpanish\nTurkish\nIrish\nDanish\nWelsh\nFrench\nGerman\nEnglish",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Die Verwandlung",
          "isTest": true,
          "testIn": "Als Gregor Samsa eines Morgens aus unruhigen Träumen erwachte, fand er sich in seinem Bett zu einem ungeheuren Ungeziefer verwandelt. Er lag auf seinem panzerartig harten Rücken und sah, wenn er den Kopf ein wenig hob, seinen gewölbten, braunen Bauch, der in bogenförmige Versteifungen unterteilt war.\nLorsque Gregor Samsa s'éveilla un matin après des rêves agités, il se trouva transformé dans son lit en un monstrueux insecte. Il était couché sur son dos dur comme une carapace et, en levant légèrement la tête, il vit son ventre brun et bombé, divisé par des arcs rigides.\nCuando Gregor Samsa despertó una mañana después de sueños intranquilos, se encontró en su cama transformado en un monstruoso insecto. Estaba acostado sobre su duro lomo en forma de caparazón y, al levantar un poco la cabeza, vio su vientre marrón abombado, dividido en arcos rígidos.\nWhen Gregor Samsa woke up one morning from unsettling dreams, he found himself changed in his bed into a monstrous vermin. He lay on his back, and if he lifted his head a little he could see his brown belly, slightly domed and divided by arches into stiff sections.\nGregor Samsa bir sabah huzursuz rüyalardan uyandığında, kendini yatağında dev bir böceğe dönüşmüş olarak buldu. Sert, kabuklu sırtüstü yatıyordu ve başını biraz kaldırdığında, kahverengi karnını, kemerli bölümlere ayrılmış olduğunu gördü.\nPan ddeffrodd Gregor Samsa un bore o freuddwydion aflonydd, canfu ei hun wedi'i drawsnewid yn bryfed anghenfil yn ei wely. Roedd yn gorwedd ar ei gefn caled fel cragen, ac wrth godi ei ben ychydig, gwelodd ei fol brown a chrwm, wedi'i rannu'n adrannau crwm anhyblyg.\nQuando Gregor Samsa si svegliò una mattina da sogni inquieti, si trovò trasformato nel suo letto in un mostruoso insetto. Giaceva sulla schiena dura come un'armatura e, alzando un po' la testa, vide il suo ventre marrone, leggermente arcuato e diviso in rigide sezioni.\nQuando Gregor Samsa acordou uma manhã após sonhos perturbadores, encontrou-se transformado na sua cama em um monstruoso inseto. Ele estava deitado de costas, duras como uma carapaça, e, ao levantar um pouco a cabeça, viu seu ventre marrom, ligeiramente arqueado e dividido por arcos rígidos.\nDa Gregor Samsa vågnede en morgen efter urolige drømme, fandt han sig selv forvandlet til et monstrøst insekt i sin seng. Han lå på sin hårde, pansrede ryg, og da han løftede hovedet lidt, kunne han se sin bulede, brune mave, der var opdelt i bueformede sektioner.\nKord, kui Gregor Samsa ühel hommikul ärkas rahututest unedest, leidis ta end oma voodis kohutavaks putukaks muutunud. Ta lamas oma kõval seljal ning kui ta veidi pead tõstis, nägi ta oma pruunikat kõhtu, mis oli jagatud kaarekujuliseks jäigaks jaotuseks.\nKun Gregor Samsa eräänä aamuna heräsi levottomista unista, hän huomasi muuttuneensa vuoteessaan suunnattomaksi hyönteiseksi. Hän makasi selällään, jonka panssarimainen kovuus tuntui, ja kun hän nosti päätään hieman, hän näki ruskean vatsansa, joka oli jaettu kaarimaisiin osiin.\nNuair a dhúisigh Gregor Samsa maidin amháin ó aislingí suaite, fuair sé é féin athraithe ina chorp inifis i leaba a leapa. Luigh sé ar a dhroim crua, cosanta, agus nuair a d'ardaigh sé a cheann beagán, chonaic sé a bholg donn bogtha, roinnte i gcodanna crua cuaire.\nNär Gregor Samsa en morgon vaknade ur oroliga drömmar, fann han sig själv förvandlad till en enorm insekt i sin säng. Han låg på sin hårda, pansaraktiga rygg, och när han lyfte sitt huvud något såg han sin välvda, bruna mage, som var uppdelad i bågformade sektioner.",
          "testOut": "German\nFrench\nSpanish\nEnglish\nTurkish\nWelsh\nItalian\nPortuguese\nDanish\nEstonian\nFinnish\nIrish\nSwedish",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Franz Kafka",
          "isTest": false,
          "testIn": "Du brauchst dein Zimmer nicht zu verlassen, bleib einfach an deinem Tisch sitzen und horche. Du brauchst nicht einmal zu horchen, warte einfach. Du brauchst nicht einmal zu warten, werde einfach still, und die Welt wird sich offenbaren, um entlarvt zu werden; sie hat keine andere Wahl. Sie wird sich in Ekstase vor deinen Füßen wälzen.\nNon hai bisogno di lasciare la tua stanza, basta che resti seduto al tuo tavolo e ascolti. Non hai nemmeno bisogno di ascoltare, aspetta semplicemente. Non hai nemmeno bisogno di aspettare, diventa semplicemente silenzioso, e il mondo si rivelerà, smascherato; non ha altra scelta. Si contorcerà in estasi ai tuoi piedi.\nNid oes angen i ti adael dy ystafell, eistedd wrth dy fwrdd a gwrando. Nid oes angen i ti hyd yn oed wrando, dim ond aros. Nid oes angen i ti hyd yn oed aros, dim ond aros yn llonydd, a bydd y byd yn datgelu ei hun, heb ei guddio; nid oes ganddo ddewis arall. Bydd yn ymlwybro mewn gorfoledd wrth dy draed.\nSa ei pea oma toas lahkuma, istu lihtsalt oma laua taga ja kuula. Sa ei pea isegi kuulama, lihtsalt oota. Sa ei pea isegi ootama, jää lihtsalt vaikseks ja maailm paljastab ennast, ilma maskita; tal pole muud valikut. See keerleb ekstaasis sinu jalgade ees.\nVocê não precisa sair do seu quarto, apenas sente-se à sua mesa e ouça. Você nem sequer precisa ouvir, apenas espere. Você nem sequer precisa esperar, apenas fique em silêncio, e o mundo se revelará, desmascarado; não tem outra escolha. Ele se contorcerá em êxtase aos seus pés.\nSinun ei tarvitse poistua huoneestasi, istu vain pöytäsi ääressä ja kuuntele. Sinun ei edes tarvitse kuunnella, odota vain. Sinun ei edes tarvitse odottaa, rauhoitu vain, ja maailma paljastaa itsensä, riisuttuna naamioistaan; sillä ei ole muuta vaihtoehtoa. Se kieriskelee ekstaasissa jalkojesi juurella.\nNo necesitas salir de tu habitación, solo siéntate en tu mesa y escucha. Ni siquiera necesitas escuchar, simplemente espera. Ni siquiera necesitas esperar, simplemente permanece quieto, y el mundo se revelará, desenmascarado; no tiene otra opción. Se retorcerá en éxtasis a tus pies.\nDu behøver ikke forlade dit værelse, blot sid ved dit bord og lyt. Du behøver ikke engang lytte, bare vent. Du behøver ikke engang vente, bare bliv stille, og verden vil åbenbare sig, afsløret; den har intet andet valg. Den vil vride sig i ekstase ved dine fødder.\nYou do not need to leave your room, just sit at your table and listen. You do not even need to listen, just wait. You do not even need to wait, just become still, and the world will reveal itself, unmasked; it has no other choice. It will writhe in ecstasy at your feet.\nOdanı terk etmen gerekmiyor, sadece masanda otur ve dinle. Dinlemene bile gerek yok, sadece bekle. Beklemene bile gerek yok, sadece sessiz ol, ve dünya kendini açığa çıkaracak, maskesini düşürecek; başka seçeneği yok. Ayaklarının dibinde kendini coşku içinde kıvranarak açığa vuracak.\nDu behöver inte lämna ditt rum, bara sitt vid ditt bord och lyssna. Du behöver inte ens lyssna, bara vänta. Du behöver inte ens vänta, bara bli stilla, och världen kommer att avslöja sig själv, avmaskad; den har inget annat val. Den kommer att vrida sig i extas vid dina fötter.\nNí gá duit do sheomra a fhágáil, suí díreach ag do bhord agus éist. Ní gá duit fiú éisteacht, fan díreach. Ní gá duit fiú fanacht, bí díreach ciúin, agus nochtfaidh an domhan é féin, nochtaithe; níl aon rogha eile aige. Rachaidh sé ina dhúlagar ag do chosa.\nTu n'as pas besoin de quitter ta chambre, reste simplement assis à ta table et écoute. Tu n'as même pas besoin d'écouter, attends simplement. Tu n'as même pas besoin d'attendre, deviens simplement silencieux, et le monde se révèlera, démasqué; il n'a pas d'autre choix. Il se tordra d'extase à tes pieds.",
          "testOut": "German\nItalian\nWelsh\nEstonian\nPortuguese\nFinnish\nSpanish\nDanish\nEnglish\nTurkish\nSwedish\nIrish\nFrench",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Moby-Dick; or, The Whale",
          "isTest": true,
          "testIn": "Call me Ishmael. Some years ago--never mind how long precisely--having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world.\nChiamatemi Ismaele. Alcuni anni fa -- non importa esattamente quanti -- avendo poco o nessun denaro in tasca, e nulla di particolare che mi interessasse a terra, pensai che avrei navigato un po' per vedere la parte acquatica del mondo.\nKutsuge mind Ismaeli. Mõned aastad tagasi -- pole täpselt oluline kui kaua -- mul oli vähe või üldse mitte raha taskus ja mitte midagi erilist, mis mind maal huvitaks, nii et mõtlesin, et läheksin merele ja vaataksin maailma veelist osa.\nChamem-me Ismael. Alguns anos atrás -- não importa exatamente quantos -- com pouco ou nenhum dinheiro na minha bolsa, e nada em especial que me interessasse em terra, pensei em navegar um pouco e ver a parte aquática do mundo.\nKutsukaa minua Ismaeliksi. Muutamia vuosia sitten -- ei ole väliä, kuinka kauan tarkalleen -- minulla oli vähän tai ei ollenkaan rahaa taskussani, eikä mitään erityistä, mikä olisi kiinnostanut minua maissa, joten ajattelin purjehtia vähän ja nähdä maailman vetisen osan.\nLlamadme Ismael. Hace algunos años --no importa cuántos exactamente--, teniendo poco o ningún dinero en el bolsillo y nada en particular que me interesara en tierra, pensé que navegaría un poco y vería la parte acuática del mundo.\nKald mig Ismael. For nogle år siden -- det er ligegyldigt, hvor præcist -- havde jeg lidt eller ingen penge i min pung, og intet særligt der interesserede mig på land, så jeg tænkte, at jeg ville sejle lidt rundt og se den vandige del af verden.\nBana İsmail deyin. Birkaç yıl önce -- ne kadar olduğunu tam olarak boş verin -- cebimde az ya da hiç param yokken ve karada beni ilgilendiren hiçbir şey bulamayınca, dünyadaki sulu bölgeyi görmek için biraz denize açılmaya karar verdim.\nKalla mig Ismael. För några år sedan -- det spelar ingen roll exakt hur länge -- hade jag lite eller inga pengar i börsen, och inget särskilt som intresserade mig i land, så jag tänkte att jag skulle segla omkring lite och se den vattniga delen av världen.\nAppelez-moi Ismaël. Il y a quelques années -- peu importe combien exactement -- n'ayant que peu ou pas d'argent dans ma bourse, et rien de particulier qui m'intéressait à terre, je me suis dit que je voguerais un peu pour voir la partie aquatique du monde.\nGlaoigh Íosmaél orm. Cúpla bliain ó shin -- ná bí buartha cé chomh fada sin -- gan mórán nó aon airgead i mo sparán, agus gan aon rud ar leith a chuir suim ionam ar an gcladach, shíl mé go dtionlacánn beagán chun cuid uisce an domhain a fheiceáil.\nGalwch fi Ishmael. Rai blynyddoedd yn ôl -- does dim ots am faint yn union -- heb fawr ddim neu ddim arian o gwbl yn fy mhoced, ac heb ddim yn benodol i'm diddori ar y tir, penderfynais hwylio am dipyn a gweld rhan ddŵr y byd.\nNennt mich Ismael. Vor einigen Jahren -- es ist nicht wichtig, wie lange genau -- hatte ich wenig oder gar kein Geld in meiner Tasche und nichts Besonderes, das mich an Land interessierte, also dachte ich, ich würde ein bisschen segeln und den wässrigen Teil der Welt sehen.",
          "testOut": "English\nItalian\nEstonian\nPortuguese\nFinnish\nSpanish\nDanish\nTurkish\nSwedish\nFrench\nIrish\nWelsh\nGerman",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Herman Melville",
          "isTest": false,
          "testIn": "Dio ti aiuti, vecchio, i tuoi pensieri hanno creato una creatura in te; e colui il cui pensiero intenso lo rende un Prometeo; un avvoltoio si ciba di quel cuore per sempre; l'avvoltoio, la stessa creatura che egli crea.\nJumal aita sind, vana mees, sinu mõtted on loonud sinus olendi; ja see, kelle intensiivne mõtlemine teeb temast Prometheuse; raisakotkas toitub igavesti sellest südamest; raisakotkas, seesama olend, kelle ta loob.\nDeus te ajude, velho, teus pensamentos criaram uma criatura dentro de ti; e aquele cujo pensamento intenso o torna um Prometeu; um abutre se alimenta desse coração para sempre; o abutre, a própria criatura que ele cria.\nJumala auttakoon sinua, vanha mies, ajatuksesi ovat luoneet sinuun olennon; ja hän, jonka kiivas ajattelu tekee hänestä Prometheuksen; korppikotka syö ikuisesti sydäntäsi; korppikotka, juuri se olento, jonka hän luo.\nQue Dios te ayude, viejo, tus pensamientos han creado una criatura en ti; y aquel cuyo intenso pensar lo convierte en un Prometeo; un buitre se alimenta de ese corazón para siempre; el buitre, la misma criatura que él crea.\nGod help thee, old man, thy thoughts have created a creature in thee; and he whose intense thinking thus makes him a Prometheus; a vulture feeds upon that heart forever; the vulture the very creature he creates.\nGud hjælpe dig, gamle mand, dine tanker har skabt en skabning i dig; og han hvis intense tænkning gør ham til en Prometheus; en grib nager for evigt på det hjerte; gribben, den selvsamme skabning han skaber.\nTanrı sana yardım etsin, ihtiyar adam, düşüncelerin içinde bir yaratık yaratmış; ve bu yoğun düşünceleriyle kendisini bir Prometheus yapan; kalbini sonsuza dek bir akbaba kemiriyor; akbaba, onun yarattığı tam o yaratık.\nGud hjälpe dig, gamle man, dina tankar har skapat en varelse i dig; och den vars intensiva tänkande gör honom till en Prometheus; en gam äter för alltid på det hjärtat; gamen, den varelse han själv skapar.\nGo gcabhraigh Dia leat, a sheanfhear, tá créatúr cruthaithe ag do smaointe ionat; agus an té a chruthaíonn é féin ina Proméitéas tríd an machnamh dian seo; itheann fiach dubh an croí sin go deo; an fiach dubh, an créatúr a chruthaíonn sé féin.\nQue Dieu te vienne en aide, vieil homme, tes pensées ont créé une créature en toi; et celui dont la pensée intense fait de lui un Prométhée; un vautour se nourrit de ce cœur pour l'éternité; le vautour, cette même créature qu'il crée.\nBoed i Dduw dy gynorthwyo, hen ddyn, mae dy feddyliau wedi creu creadur ynot; a'r sawl y mae ei feddwl dwys yn ei wneud yn Prometheus; mae fwltur yn bwydo ar y galon honno am byth; y fwltur, y creadur y mae'n ei greu.\nGott helfe dir, alter Mann, deine Gedanken haben eine Kreatur in dir erschaffen; und derjenige, dessen intensives Denken ihn zu einem Prometheus macht; ein Geier nagt für immer an diesem Herzen; der Geier, genau die Kreatur, die er erschafft.",
          "testOut": "Italian\nEstonian\nPortuguese\nFinnish\nSpanish\nEnglish\nDanish\nTurkish\nSwedish\nIrish\nFrench\nWelsh\nGerman",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Canne al vento",
          "isTest": true,
          "testIn": "Il suono della fisarmonica arrivava fin laggiù; il motivo saltellante e voluttuoso richiamava alla danza, ma a volte si mutava in lamento, come stanco di gioia, come rimpiangendo il piacere che passa e gemendo per l'inutilità di tutte le cose: allora anche l'occhio melanconico delle giumente pareva pieno di una dolcezza nostalgica.\nRoedd sŵn yr accordion yn cyrraedd i lawr hyd yn oed yno; roedd yr alaw siriol ac arddwys yn galw at y ddawns, ond weithiau roedd yn troi'n alar, fel petai'n flinedig o lawenydd, fel petai'n edifarhau am y pleser sy'n pasio ac yn cwyno am wacter pob peth: yna hyd yn oed roedd llygaid melancholaidd y merlod yn llawn melysrwydd hiraethus.\nLe son de l'accordéon parvenait jusque-là; l'air sautillant et voluptueux appelait à la danse, mais parfois il se transformait en une lamentation, comme fatigué de la joie, comme regrettant le plaisir qui passe et gémissant sur la futilité de toutes choses: alors même les yeux mélancoliques des juments semblaient remplis d'une douceur nostalgique.\nDragspelsljudet nådde ända dit ner; den sprittande och sinnliga melodin kallade till dans, men ibland förvandlades den till en klagan, som om den var trött på glädjen, som om den ångrade njutningen som går förbi och jämrade sig över alltings meningslöshet: då tycktes även stona med sina melankoliska ögon vara fulla av en nostalgisk ljuvhet.\nEl sonido del acordeón llegaba hasta allí; la melodía vivaz y voluptuosa invitaba a bailar, pero a veces se convertía en un lamento, como cansada de la alegría, como lamentando el placer que pasa y gimiendo por la futilidad de todas las cosas: entonces hasta los ojos melancólicos de las yeguas parecían llenos de una dulzura nostálgica.\nThe sound of the accordion reached even down there; the lively and voluptuous tune called for dancing, but at times it turned into a lament, as if weary of joy, as if lamenting the pleasure that fades and moaning for the futility of all things: then even the melancholic eyes of the mares seemed full of nostalgic sweetness.\nAkordioni heli jõudis isegi sinna alla; elav ja ihaldav meloodia kutsus tantsule, kuid vahel muutus see kaebuseks, justkui väsinuna rõõmust, justkui kahetseks mööduvat naudingut ja kurdaks kõigi asjade tühisust: siis tundus ka mära melanhoolne silm täis nostalgilist magusust.\nHarmonikan ääni kantautui alas sinne asti; eloisa ja aistillinen sävel kutsui tanssiin, mutta toisinaan se muuttui valitukseksi, ikään kuin kyllästyneenä iloon, kuin katuen ohimenevää nautintoa ja valittaen kaiken turhuutta: silloin myös tammojen surumieliset silmät näyttivät olevan täynnä nostalgista suloisuutta.\nAkordeonun sesi oraya kadar ulaşıyordu; coşkulu ve ihtiraslı melodi dansa davet ediyordu, ama bazen neşeden yorulmuş gibi bir ağıta dönüşüyordu, sanki geçen zevki pişmanlıkla anıyor ve her şeyin boşuna olduğunu inleyerek dile getiriyordu: o zaman kısrakların melankolik gözleri bile nostaljik bir tatlılıkla dolu görünüyordu.\nShroich fuaim an fhidiléara fiú síos ansin; ghlaoigh an ceol pléisiúrtha agus suáilceach ar an damhsa, ach uaireanta d'iompaigh sé ina chaoi, amhail is go raibh sé tuirseach de lúcháir, amhail is go raibh sé ag cuimhneamh ar an taitneamh a d'imigh thart agus ag caoineadh faoin bhfánach atá i ngach rud: ansin fiú shamhlaigh súile brónacha na láracha lán de mhilseacht chumhach.\nDer Klang des Akkordeons drang bis dorthin; die lebhafte und sinnliche Melodie rief zum Tanz, aber manchmal verwandelte sie sich in eine Klage, als wäre sie der Freude müde, als würde sie das Vergnügen, das vorübergeht, bereuen und über die Nichtigkeit aller Dinge klagen: dann schienen selbst die melancholischen Augen der Stuten voller nostalgischer Süße zu sein.\nO som do acordeão chegava até lá embaixo; a melodia saltitante e voluptuosa chamava para a dança, mas às vezes se transformava em lamento, como se cansada de alegria, como se lamentasse o prazer que passa e gemesse pela futilidade de todas as coisas: então até os olhos melancólicos das éguas pareciam cheios de uma doçura nostálgica.\nLyden af harmonikaen nåede helt derned; den livlige og sanselige melodi kaldte til dans, men undertiden blev den til en klagesang, som træt af glæde, som om den fortrød den forbipasserende fornøjelse og sukkede over alle tings forgængelighed: da syntes selv de melankolske øjne hos hopperne at være fulde af en nostalgisk sødme.",
          "testOut": "Italian\nWelsh\nFrench\nSwedish\nSpanish\nEnglish\nEstonian\nFinnish\nTurkish\nIrish\nGerman\nPortuguese\nDanish",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Grazia Deledda",
          "isTest": false,
          "testIn": "Quasi quasi pensava che il suo cuore era buono e generoso, o almeno, se precisamente non pensava così nella profondità sincera della coscienza -- in quella profondità che non mentisce mai -- e dalla quale sgorgava quel senso di tristezza che la avvolgeva, -- lo pensava con la mente calcolatrice. Così, confortata, si addormentò.\nShe very nearly thought that her heart was good and generous, or at least, if she didn't precisely think so in the sincere depth of her conscience--in that depth that never lies--from which arose that sense of sadness that enveloped her--she thought it with her calculating mind. Thus, comforted, she fell asleep.\nSie war sehr nahe daran zu denken, dass ihr Herz gut und großzügig war, oder zumindest, wenn sie dies nicht in der ehrlichen Tiefe ihres Gewissens dachte -- in jener Tiefe, die niemals lügt -- und aus der dieses Gefühl der Traurigkeit aufstieg -- das sie umgab, dachte sie es mit einem berechnenden Geist. So getröstet schlief sie ein.\nBron ei bod yn meddwl bod ei chalon yn dda ac yn hael, neu o leiaf, os nad oedd hi'n meddwl hynny yn union yn nyfnder diffuant ei chydwybod--yn y dyfnder hwnnw na ddywed celwydd byth--ac o ble'r oedd y teimlad o dristwch a oedd yn ei hamgylchynu wedi tarddu--roedd hi'n meddwl hynny gyda'i meddwl cyfrifiol. Felly, wedi'i chysuro, syrthiodd hi i gysgu.\nElle en venait presque à penser que son cœur était bon et généreux, ou du moins, si elle ne pensait pas exactement ainsi dans la sincère profondeur de sa conscience--dans cette profondeur qui ne ment jamais--et d'où émanait ce sentiment de tristesse qui l'enveloppait--elle le pensait avec son esprit calculateur. Ainsi, réconfortée, elle s'endormit.\nIs beag nár smaoinigh sí go raibh a croí cineálta agus flaithiúil, nó ar a laghad, mura raibh sí go hiomlán den tuairim sin go domhain ina coinsias -- sa doimhneacht sin nach luíonn choíche -- agus óna d'eascair an t-uaigneas a bhí ina timpeall -- smaoinigh sí é le hintinn ríomhaire. Mar sin, misnigh aici, thit sí ina codladh.\nHon var mycket nära att tänka att hennes hjärta var gott och generöst, eller åtminstone, om hon inte tänkte så i sitt samvetes djupa, ärliga innersta -- i den djupheten som aldrig ljuger -- och varifrån den sorgens känsla som omslöt henne uppstod -- tänkte hon det med ett beräknande sinne. Så, tröstad, somnade hon.\nKalbinin iyi ve cömert olduğunu neredeyse düşünüyordu; en azından, eğer bunu vicdanının samimi derinliklerinde -- asla yalan söylemeyen o derinlikte -- düşünmediyse ve onu saran o hüzün duygusu da bu derinlikten doğuyorsa -- bunu hesapçı bir zihinle düşündü. Böylece, teselli bulmuş, uykuya daldı.\nHun var meget tæt på at tænke, at hendes hjerte var godt og generøst, eller i det mindste, hvis hun ikke tænkte sådan i samvittighedens ærlige dybde -- i det dyb, som aldrig lyver -- og hvorfra den følelse af tristhed -- der omsluttede hende, udsprang, tænkte hun det med et beregnende sind. Således, trøstet, faldt hun i søvn.\nCasi, casi pensaba que su corazón era bueno y generoso, o al menos, si no pensaba exactamente así en la profundidad sincera de su conciencia--en esa profundidad que nunca miente--y de la cual surgía ese sentido de tristeza que la envolvía--lo pensaba con su mente calculadora. Así, confortada, se durmió.\nHän oli hyvin lähellä ajatella, että hänen sydämensä oli hyvä ja antelias, tai ainakin, jos hän ei ajatellut niin sydämensä syvimmässä omassatunnossa -- siinä syvyydessä, joka ei koskaan valehtele -- ja josta kumpusi se surullisuuden tunne -- joka ympäröi häntä, hän ajatteli niin laskelmoivalla mielellä. Niinpä, lohdutettuna, hän nukahti.\nEla quase pensava que seu coração era bom e generoso, ou pelo menos, se não pensava assim na profundidade sincera de sua consciência -- naquela profundidade que nunca mente -- e da qual brotava aquele sentimento de tristeza que a envolvia -- pensava assim com uma mente calculista. Assim, reconfortada, adormeceu.\nPeaaegu mõtles ta, et tema süda on hea ja helde, või vähemalt, kui ta seda oma südametunnistuse sügavas aususes ei uskunud -- selles sügavuses, mis ei valeta kunagi -- ja kust tõusis see kurbuse tunne, mis teda ümbritses -- mõtles ta seda kalkuleeriva mõistusega. Nii lohutatuna uinus ta.",
          "testOut": "Italian\nEnglish\nGerman\nWelsh\nFrench\nIrish\nSwedish\nTurkish\nDanish\nSpanish\nFinnish\nPortuguese\nEstonian",
          "isValidator": true,
          "needValidation": true
        }
      ],
      "difficulty": "medium",
      "constraints": "Length of [[excerpt]] is less than 500 bytes. Each of 13 is written in a unique language.",
      "coverBinaryId": 131922227824546,
      "stubGenerator": "loop 13 read excerpt:string(500)\nloop 13 write language",
      "inputDescription": "<<Lines 1 to 13:>> A string [[excerpt]] in UTF-8 encoding",
      "solutionLanguage": "Python3",
      "outputDescription": "<<Lines 1 to 13:>> {{Danish}}, {{English}}, {{Estonian}}, {{Finnish}}, {{French}}, {{German}}, {{Irish}}, {{Italian}}, {{Portuguese}}, {{Spanish}}, {{Swedish}}, {{Turkish}}, or {{Welsh}}"
    },
    "draft": false,
    "readyForModeration": true,
    "statementHTML": "<div class=\"statement-body\">\n<div class=\"statement-section statement-goal\">\n   <h2><span class=\"icon icon-goal\">&nbsp;</span><span>Goal </span></h2>\n   <span class=\"question-statement\">A quotation from a classic literary work has been translated into a dozen different European languages. However, the translations have all been shuffled in some arbitrary order. With the original mixed in, that's 13 languages altogether. What bad luck!<br><br>Given an <var>excerpt</var> in every one of these 13 languages, determine the order they're in by matching a unique language to each.<br><br>As a rule in this puzzle, <strong>English</strong> will use the 26 letters without diacritics as in <const>r&eacute;sum&eacute;</const>, <const>na&iuml;ve</const>, and <const>fa&ccedil;ade</const>, nor ligatures as in <const>&AElig;gypt</const> and <const>am&oelig;ba</const>. Alphabets for other languages have further restrictions strictly adhered to, and other possibilities for alphabetic characters as detailed below:<br><pre style=\"font-family: monospace\"></pre><pre style=\"font-family: monospace\"><br>Language   Exclusions   Inclusions<br>─────────  ───────────  ─────────────────────────────────────<br>Danish          q    z           &aelig; &aring;  &oslash;                      <br>Estonian    cf  q wxy        &scaron;ž         &otilde;&auml;  &ouml;&uuml;               <br>Finnish    b f  q wx                     &auml;  &ouml;                <br>French                     &ccedil;      &oelig;       &euml;&iuml; &uuml;&agrave;&egrave;  &ugrave;&acirc;&ecirc;&icirc;&ocirc;&ucirc; &eacute;   <br>German                  &szlig;                &auml;  &ouml;&uuml;               <br>Irish         jkqvwxyz                                  &aacute;&eacute;&iacute;&oacute;&uacute;<br>Italian       jk  wxy                         &agrave;&egrave;&igrave;&ograve;&ugrave;      &eacute;   <br>Portuguese     k  w        &ccedil;           &atilde;&otilde;     &agrave;    &acirc;&ecirc; &ocirc; &aacute;&eacute;&iacute;&oacute;&uacute;<br>Spanish        k  w       &ntilde;                  &uuml;          &aacute;&eacute;&iacute;&oacute;&uacute;<br>Swedish         q w                &aring;     &auml;  &ouml;                <br>Turkish         q wx     ğ &ccedil;ş       İı      &ouml;&uuml;               <br>Welsh         jkqv x z         ŵŷ                  &acirc;&ecirc;&icirc;&ocirc;&ucirc;     <br>           ───────────  ─────────────────────────────────────<br>           bcfjkqvwxyz  &szlig;ğ&ntilde;&ccedil;ş&scaron;žŵŷ&aelig;&oelig;&aring;İı&oslash;&atilde;&otilde;&auml;&euml;&iuml;&ouml;&uuml;&agrave;&egrave;&igrave;&ograve;&ugrave;&acirc;&ecirc;&icirc;&ocirc;&ucirc;&aacute;&eacute;&iacute;&oacute;&uacute;</pre><pre style=\"font-family: monospace\"></pre><br>While this information is sufficient to solve the puzzle, it should be noted that language in general is highly patterned, so there are other approaches that can be used to discriminate the texts. For instance, the stop words <const>they</const>, <const>who</const> and <const>only</const> are exclusively found in <strong>English</strong>, and others are highly correlated. This and alternative ideas can similarly lead to valid (if more cumbersome) solutions.</span>\n</div>\n<div class=\"statement-section statement-protocol\">\n   <div class=\"blk\">\n      <div class=\"title\">Input</div>\n      <div class=\"question-statement-input\"><strong>Lines 1 to 13:</strong> A string <var>excerpt</var> in UTF-8 encoding</div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Output</div>\n      <div class=\"question-statement-output\"><strong>Lines 1 to 13:</strong> <const>Danish</const>, <const>English</const>, <const>Estonian</const>, <const>Finnish</const>, <const>French</const>, <const>German</const>, <const>Irish</const>, <const>Italian</const>, <const>Portuguese</const>, <const>Spanish</const>, <const>Swedish</const>, <const>Turkish</const>, or <const>Welsh</const></div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Constraints</div>\n      <div class=\"question-statement-constraints\">Length of <var>excerpt</var> is less than 500 bytes. Each of 13 is written in a unique language.</div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Example</div>\n      <div class=\"statement-inout\">\n         <div class=\"statement-inout-in\">\n            <div class=\"title\">Input</div>\n            <pre class=\"question-statement-example-in\">En un lugar de la Mancha, de cuyo nombre no quiero acordarme, no ha mucho tiempo que viv&iacute;a un hidalgo de los de lanza en astillero, adarga antigua, roc&iacute;n flaco y galgo corredor.\nIn a village of La Mancha, the name of which I have no desire to call to mind, there lived not long since one of those gentlemen that keep a lance in the lance-rack, an old buckler, a lean hack, and a greyhound for coursing.\nI en landsby i La Mancha, hvis navn jeg ikke vil huske, levede der for ikke s&aring; l&aelig;nge siden en hidalgo, en af dem med en lanse i v&aring;benstativet, et gammelt skjold, en mager hest og en mynde til jagt.\nMant&scaron;a k&uuml;las, mille nime ma ei taha meelde tuletada, elas mitte kaua aega tagasi &uuml;ks hidalgo, kes hoidis oda relvastendis, vana kilpi, k&otilde;hna hobust ja jahiks kasutatavat hagijat.\nEr&auml;&auml;ss&auml; La Manchan kyl&auml;ss&auml;, jonka nime&auml; en halua muistaa, eli jokin aika sitten aatelismies, niist&auml; jotka pit&auml;v&auml;t keih&auml;st&auml; telineess&auml;, vanhaa kilpe&auml;, laihaa hevosta ja vinttikoiraa juoksemiseen.\nDans un village de la Manche, dont je ne veux pas me souvenir du nom, vivait il n'y a pas si longtemps un hidalgo de ceux qui poss&egrave;dent une lance au r&acirc;telier, un vieux bouclier, un cheval maigre et un l&eacute;vrier pour la chasse.\nIn einem Dorf in La Mancha, dessen Namen ich nicht nennen will, lebte vor nicht allzu langer Zeit ein Hidalgo, einer von denen, die eine Lanze im Waffenst&auml;nder, einen alten Schild, ein mageres Ross und einen Windhund zum Jagen haben.\nI sr&aacute;idbhaile i La Mancha, nach bhfuil fonn orm cuimhneamh ar a ainm, bh&iacute; hidalgo ina ch&oacute;na&iacute;, n&iacute; fada &oacute; shin, le sle&aacute; sa seilf arm, seanchl&aacute;r sciath, capall tana&iacute; agus galfghadhar chun seilge.\nIn un villaggio della Mancia, il cui nome non voglio ricordare, non molto tempo fa viveva un hidalgo, uno di quelli con la lancia nel rastrelliere, un vecchio scudo, un cavallo magro e un levriero per la caccia.\nNuma aldeia da Mancha, cujo nome n&atilde;o quero lembrar-me, n&atilde;o h&aacute; muito tempo vivia um fidalgo daqueles que guardam uma lan&ccedil;a no arm&aacute;rio de armas, um velho escudo, um cavalo magro e um galgo corredor.\nI en by i La Mancha, vars namn jag inte vill minnas, bodde f&ouml;r inte s&aring; l&auml;nge sedan en hidalgo, en av de d&auml;r med en lans i vapensk&aring;pet, en gammal sk&ouml;ld, en mager h&auml;st och en vinthund f&ouml;r jakt.\nAdını hatırlamak istemediğim La Mancha'daki bir k&ouml;yde, uzun zaman &ouml;nce olmayan, mızrağını rafında tutan, eski bir kalkan, zayıf bir at ve avcılık i&ccedil;in bir tazı olan bir hidalgo yaşıyordu.\nMewn pentref yn La Mancha, nad wyf am gofio'r enw, roedd hidalgo yn byw, nid yn rhy hir yn &ocirc;l, gyda gwaywffon yn y rhestr arfau, tarian hen, ceffyl main, a milgi ar gyfer hela.</pre>\n         </div>\n         <div class=\"statement-inout-out\">\n            <div class=\"title\">Output</div>\n            <pre class=\"question-statement-example-out\">Spanish\nEnglish\nDanish\nEstonian\nFinnish\nFrench\nGerman\nIrish\nItalian\nPortuguese\nSwedish\nTurkish\nWelsh</pre>\n         </div>\n      </div>\n   </div>\n</div>"
  },
  "validatedFor": 38682093706,
  "avatar": 132419401284681,
  "commentCount": 20,
  "upVotes": 6,
  "downVotes": 2,
  "validateAction": {
    "actionId": 1029038,
    "progress": 1,
    "alreadyDone": false
  },
  "statusHistory": [
    {
      "status": "ACCEPTED",
      "date": 1732046514124,
      "data": {
        "author": "ACTION"
      }
    }
  ],
  "editable": true,
  "draft": false,
  "readyForModeration": true
}