[
  {
    "commentId": 23536,
    "codingamerId": 512097,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 12001839,
    "userVoteValue": 0,
    "nickname": "Stilgart",
    "content": "I have just added a tag and set the difficulty of this puzzle to medium.\n\n@anst: When I have approved this contribution as a puzzle, I was taking into account the fact that not all languages have access to a bignum library, and that this puzzle can be solved without using such a library.",
    "codingamerHandle": "f6389a8319f07b08072b207feb2572c9790215",
    "avatar": 69893904259383,
    "elapsedTime": 196214130000
  },
  {
    "commentId": 4329,
    "codingamerId": 154906,
    "commentableId": 3097141,
    "responseCount": 2,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 3319537,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Fixed some trivial typos.\nFixed the more serious \"you're only required to output the first 1000 digits\": nope, with the current system it's more than an indulgence: it's an strict rule.\n\nClarified that the input is line-based with no comma.\n\nSolved independently. I was about to spontaneously do DP (i.e. Pascal's), and then the obvious number of distincts arrangements of {M*south, N*east} hit me in the face and my brain didn't want to do anything else, so I'll have nCr like everybody else.\n\nThen I scratched my head for a very long time until I got to peek at your program, mumble and complain, and clarified the problem statement that the grid dimensions count the roads, not the buildings.\n\nSo it's both upvotable and approvable.\nSo it's both upvoted and approved.\n\nWhich is noteworthy: I've approved 3 tonight, one with no vote and one with a downvote. Congratulations!\n\nDo cross-verify the road vs building count: it's late, but I'm not letting someone else claim my XP O:-)\n\nLet it be said here that I disagree with the \"you'll need a powerful data type\" assertion, but I don't feel that's mine to correct.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 298133354000
  },
  {
    "commentId": 4205,
    "codingamerId": 1286024,
    "commentableId": 3097141,
    "responseCount": 1,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 3281225,
    "userVoteValue": 0,
    "nickname": "Math_Genius",
    "content": "I think this is too hard for a CoC, but I'm not sure it's hard enough for a community puzzle, assuming you know the trick\n\nPerhaps if you pushed the bounds up even higher to force people to use the n choose k formula? (I'm assuming it's more efficient to compute 3 factorials...as opposed to m*n additions?)\n\nThough I guess the answers become really enormous at that point\nBut you could easily request the answers mod some big prime?",
    "codingamerHandle": "795935133e9f5c30544fe14ab3f65e874206821",
    "avatar": 3508369705926,
    "elapsedTime": 298728228000
  },
  {
    "commentId": 3770,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 5,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3156954,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "As someone observed, it comes down to a Pascal's triangle (with bignums).\nSo looks like it's too well known and too easy for a community puzzle. \nI've moved it to CoC (and simplified the statement).",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 300817890000
  },
  {
    "commentId": 3795,
    "codingamerId": 878974,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3770,
    "votableId": 3166166,
    "userVoteValue": 0,
    "nickname": "nicola",
    "content": "It’s me (oops, I did not sign).\nI think that it’s easy for someone who knows the trick but tough if not (like the Nim CoC).",
    "codingamerHandle": "21bf42f790de293c3aef398f18cd2627479878",
    "onlineSince": 1770701591260,
    "avatar": 26090852120005,
    "elapsedTime": 300651095000
  },
  {
    "commentId": 4275,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4205,
    "votableId": 3302878,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "Yeah, that's great idea! \nAdmittedly it changes the game and so I've added a case for that.\nNow you have to know the trick (not quite trivial) -- or, better yet,  find it yourself.\nThis is not very difficult if you have ever heard about Pascal's triangle\nAnd if you haven't, you'll find out via forum and wikipedia (which is even better).\n\nI think computing modulo prime is not necessary. It's good to see some pretty big numbers in action (which is another reason d'etre for this puzzle).\n[Edit: well, something *is* necessary for technical reasons : a full-size output accepted in the IDE doesn't pass here in the puzzle editor... so I've adjusted to the first 1000 digits.]\n\nLet me just remark that now the situation is pretty similar to the fine \"The Heart of the City\" puzzle. There you have to identify the city model with some math object(s) and then it's pretty easy to solve (a cute puzzle of the week!). Yet, our two cities (and the math behind) are quite different.\nSo now, Ladies and Gentelmen, upvote and approval please :D",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 298409922000
  },
  {
    "commentId": 4331,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4329,
    "votableId": 3319570,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "Thanks for your input!\n\nConcerning road vs building count, they seem to be alike  (I had a graph-like image in mind, where buildings are vertices and roads are edges). Your clarification might be useful anyway.\n\n\"Powerful datatype\" was originally meant as a hint to use some bignum class (in languages where it's not given for granted). \nLater, I added one more phrase which is more explicit so this \"powerful\" is indeed unnecessary (so now deleted).",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 298132354000
  },
  {
    "commentId": 4332,
    "codingamerId": 154906,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 4329,
    "votableId": 3319767,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "FWIW, my natural representation of an m×n town boasts m×n buildings and (m+1)+(n+1) roads.  Because buildings are surrounded by roads, even the ones at the edge of the town.\n\nIMHO defaulting to road counts wouldn't fly, but I'll have to wait for a night's sleep to argue for it properly.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 298125639000
  },
  {
    "commentId": 3797,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3770,
    "votableId": 3166578,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "So maybe I misinterpreted your first contribution. \nDo you think it'd better fit in community puzzles?\n\nHere are my thoughts.\nI asked someone for his opinion and he pointed me to the Project Euler problem 15... It turns out, the present statement appears to be a  generalisation of PE15 with big integers as a bonus. \n\nSo I'd be tempted to say it's moderately difficult.\n(Maybe too difficult fora a clash.)\n\nBut maybe not original enough for a community puzzle?\nWell, the accent here is is on the arbitrary precision arithmetic (the Metropolis case needs more than 64 bits).\nI think it's worth knowing (even if in some languages it's indeed given for granted).",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 300646489000
  },
  {
    "commentId": 3801,
    "codingamerId": 878974,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3770,
    "votableId": 3167919,
    "userVoteValue": 0,
    "nickname": "nicola",
    "content": "I don’t know if it’s better in CoC or not, yes, it might be too difficult for CoC.",
    "codingamerHandle": "21bf42f790de293c3aef398f18cd2627479878",
    "onlineSince": 1770701591260,
    "avatar": 26090852120005,
    "elapsedTime": 300611603000
  },
  {
    "commentId": 3808,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3770,
    "votableId": 3172330,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "Ok, I restored puzzle tag.",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 300561714000
  },
  {
    "commentId": 4276,
    "codingamerId": 828213,
    "commentableId": 3097141,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3770,
    "votableId": 3303207,
    "userVoteValue": 0,
    "nickname": "anst",
    "content": "> \"I think that it’s easy for someone who knows the trick but tough if not \"\nOk,  now after some rethinking, this is actually what makes this puzzle interesting\n(as suggested below, I added a case where the binomial is really necessary).\n\nYou have to know or -- better yet-- discover yourself a suitable mathematical object.\nAnd I do not think it's too difficult if you do not know (forum here + wikipedia would do; that's the best option). Once you've got it,  it's pretty easy.\n\nAlso, while python solution seems almost trivial, it is less so in other languages where you have to handle a proper class for such big numbers. IMHO, merits to be used in a puzzle.",
    "codingamerHandle": "bf22e1bbcc95d09ac399705242c143f8312828",
    "avatar": 1734651202684,
    "elapsedTime": 298404892000
  }
]