[
  {
    "commentId": 309234,
    "codingamerId": 4238671,
    "commentableId": 3349404,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 35806303,
    "userVoteValue": 0,
    "nickname": "DavidAugustoVilla",
    "content": "Given that it's been many years, I'm removing \"part 1\" from the title. Also, I may have inadvertently changed the difficulty to Very Hard thinking that was the default when it was missing. Readjusted to Hard, hope that's correct.",
    "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
    "avatar": 132419401284681,
    "elapsedTime": 36569831000
  },
  {
    "commentId": 306038,
    "codingamerId": 4238671,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 35748950,
    "userVoteValue": 0,
    "nickname": "DavidAugustoVilla",
    "content": "If there are no objections, I'd like to add cover art to this puzzle.",
    "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
    "avatar": 132419401284681,
    "elapsedTime": 37210584000
  },
  {
    "commentId": 115228,
    "codingamerId": 2874091,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 29104772,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "I've fixed two issues in the inputs just now:\n\n* Test 1 (Syntax: Constants): number of lines is 25 instead of 24.\n\n* Test 5 and Validator 5 (Syntax: Multiplication): numGood is 2 instead of 1.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 88415507000
  },
  {
    "commentId": 13303,
    "codingamerId": 154906,
    "commentableId": 3349404,
    "responseCount": 4,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 8293960,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Well, that took a fair amount of time!\n\nA very clear specification, as usual.  Combined with the test cases, it had the answer to all I needed to solve.  No actual trial and error needed, though it would have been more enjoyable if I had actually been able to implement it upfront in the correct final way.\n\nPossible improvement leads, discovered along the way:\n\n* \"punctuation is ignored\", but it's not really well defined. I've had to make exceptions of the following characters that Unicode does consider as punctuation: apostrophe, asterisk, underscore, square brackets.\n\n* in the same vein, does the apostrophe split words? In my case, it didn't since it wasn't punctuation any more. Which I needed to get \"you're\" as a single token. Which means I had to recognize both \"youre\" and \"you're\" explicitly.\n\n(previous two might be because I wasn't \"guided\" to the same tokenizing path as yours, but that's kind of the point, there's no easy way for me to know until I'be trawled through the entire test set)\n\n* the set of piled exceptions around the handling of context switching was mildly annoying. It turned out accepted by the tests in the end, but I'm still not totally clear what a context change at end of line means. IIRC, they were all no-ops in the test scripts' context. At any rate, implementing the switch but only if nothing actionable was also found in the same line made my code dirtier than I like.\n\n* if I'm not mistaken, the case of an \"a\" token *not* being followed by a noun doesn't occur until the very last test case.  This kind of broke the flow of TDD, \"green\"ing one test at a time until the entire puzzle is implemented, which was otherwise perfect.  I'm not sure it's feasible before the \"me and you\" tests, since some alternative is needed, but that would be a better place than the very end.\n\n* Nested arithmetic was obviously a pain with my left-to-right ad-hoc parsing, but it does contribute a lot to the puzzle's \"interestingness\".  Might actually make me consider it for \"very hard\", but let's hear from others.\n\n* The puzzle as a whole left me rather uneasy about error handling.\n\n* Also a bit of uneasyness around the arithmetic. It's deterministic, right?\n\nI think that sums it up.  I'll repeat it's a great puzzle, with high-quality test cases.  I've never had to peek at a validator.  My first code-that-passes is 160 lines long, but I'll definitely clean that up before I even consider publishing :-)\n\nAll the best,\nJayBeEmmy aka the Subtractor",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 239297248000
  },
  {
    "commentId": 12684,
    "codingamerId": 1695697,
    "commentableId": 3349404,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 8029770,
    "userVoteValue": 0,
    "content": "It's an interesting puzzle. I'll approve it after the points below have been addressed.\n\n1. Suggest revising\n\"jude is john's context for all subsequent statements.\"\nto\n\"jude is john's context.\"\nAs explained in the statement in the 2nd paragraph after, the context is not for \"all\" subsequent statements but instead persists until a new context is set.\n\n2. Suggest revising\n\"So for the constant… If eel is a bad noun, this phrase represents the constant…\"\nto\n\"So for the phrase… If eel is a bad noun, this phrase represents the constant…\"\n\n3. Input\n\"numBad]\" should be revised to \"numBad\".\n\n4. Input\nSuggest\n(a) revising \"input program\" to \"chat transcript\", and\n(b) deleting \"(program)\" from \"The chat transcript (program) to be interpreted\"\nI think it is better for consistency that \"program\" refers to the code to be written by the player only.\n\n5. Difficulty\nSuggest setting the difficulty to at least \"Hard\".",
    "codingamerHandle": "8b160497ff3badd8f07a3b709fac1c047965961",
    "elapsedTime": 242116438000
  },
  {
    "commentId": 6440,
    "codingamerId": 1174780,
    "commentableId": 3349404,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4320689,
    "userVoteValue": 0,
    "nickname": "Convly",
    "content": "Awesome puzzle, I'll do it when i'll have enough time !\n\nBtw, who're the others one ? :slight_smile:\n\n[CG]VonFlagPole = >[CG]VonRickRoll\n[CG]JayPullTongue => [Cg]jupoulton\n[CG]SuckyAppl => [CG]SaiksyApo\n[CG]TB or [CG]ThisBo => [CG]Thibaud\n[CG]VFP => ?\n[CG]SA => ?\n[CG]JustAx => ?\n[CG]JA ?",
    "codingamerHandle": "e610ecd0fa656c701cd8cc68a0aab5cc0874711",
    "avatar": 25204201211357,
    "elapsedTime": 289781708000
  },
  {
    "commentId": 6441,
    "codingamerId": 552776,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 6440,
    "votableId": 4320721,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "[CG]VFP is just an abbreviation for [CG]VonFlagPole, only used in the observer comments. Same thing for [CG]SA ([CG]SuckyApple) and [CG]JA ([CG]JustAxe).\n\nAnd [CG]JustAxe is... you, [CG]JSX! :-)",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 289781526000
  },
  {
    "commentId": 12922,
    "codingamerId": 552776,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 12684,
    "votableId": 8146851,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Thank you for your careful attention to detail, and for all your suggestions. I agree with every point, and have made all suggested changes.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 241048672000
  },
  {
    "commentId": 13304,
    "codingamerId": 154906,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 13303,
    "votableId": 8294394,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Addenda:\n\n* the fact that uncontexted chat is better ignored is also a bit late in the specs (it's really only in the test chat logs). This had some impact on my code organization.\n\n* is the concatenate-all-on-a-single line form of output necessary?\n\nI'm down to 87 lines, that's a lot more manageable. :D",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 239288903000
  },
  {
    "commentId": 313885,
    "codingamerId": 2874091,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 309234,
    "votableId": 35928670,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "It's not advisable to change any puzzle title because that'll create an inconsistency with the forum topic (see screenshot below):\n\nhttps://imgur.com/a/ooBQQVy\n\nI tried updating the forum topic just now, yet the DISCUSSIONS tab on the front page of the puzzle became broken (the page wouldn't load), so I restored the topic.\n\nI don't know how CG's puzzle URLs work, but apparently the link shown in the screenshot still works even when the puzzle name changes.\n\nAnyway, I believe it's better for you to restore the original puzzle name because of the forum topic issue. Alternatively, you may raise a bug report and ask CG staff to revise the forum topic for you.\n\nIf you've revised other puzzle titles, please follow up similarly. Thanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 35419561000
  },
  {
    "commentId": 13314,
    "codingamerId": 552776,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 13303,
    "votableId": 8300453,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "Thanks for the input, JBM! Very thorough, as always. I appreciate it! :-) I will try to respond point-by-point...\n\n * Punctuation (2 bullets): Hmm... This could be a sticking point. By ignored, I intended to say that it can be safely removed from the input before parsing. This is what I do in my own solution:\n\n        line = Regex.Replace(line, @\"[!?.,;:\"\"']\", string.Empty);\n\n    However, I didn't consider the fact that some of the syntax requires \"punctuation\". Asterisks and angle brackets are essential. The square brackets probably could have been removed without affecting anything, I think. Same with underscores. I'll have to think if there's a better way to express this idea in the problem statement.\n\n * Context: I think you misunderstood the context switch a little bit. The only time that a context switch can occur on a line with something actionable is if the *nick* is the first word on that line. For example:\n\n        <TearyMoon> *SoftCounterKitcheh*, you're a really excellent coder too!\n\n    Perhaps this is a bit too obscure, though. Maybe I should change the spec to say that any context change happens first, before anything else on the line is executed, regardless of where it appears in the line, and that any line COULD have context change and operations in it. I don't think this would change any of the test cases any. It's actually a superset of the current specification. Thoughts?\n\n * Subtraction: Maybe I'm misunderstanding what you're saying. The test with JayBeEmmy in it has an example of a \"_constant_ but not _constant_\" statement in it:\n\n        <RickyMoppet> Your nick is reminiscent of an old, boring, confusing meme, but not a bad meme, though.\n\n    Is this different from what you were talking about?\n\n * Difficult of nested arithmetic: I agree with you. The puzzle difficulty is set at Very Hard.\n\n * Error Handling: I ran out of room in the puzzle description. This is one of the things I had planned for a Part 2 (or higher). The lukewarm reception of Part 1, along with the amount of time required to prepare it, discouraged me from ever writing Part 2.\n\n * Arithmetic determinism: I spent some time on this. I'm pretty sure it's deterministic. I can't come up with a combination that's ambiguous. Maybe something like \"an _adjective_ _good_ squared and a _bad_ too\" could be interpreted as (2 + -1) instead of (2^2 + -1) if you consider \"squared\" to be flavor text. But I wrote the arithmetic spec without an allowance for intervening flavor text. I considered allowing flavor text, but it's a bit too confusing. Multiple passes through a line until nothing more can be reduced should always give correct results.\n\n * Uncontexted chat: I can see this. I will add a new test that specifically exercises this. \n\n * Single line output: This also comes from the Part 1 / Part N issue. I had intended to add a number-to-ASCII command, for more robust output, including line breaks.\n\nThanks again for the feedback!\n\n - danBhentschel",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 239230101000
  },
  {
    "commentId": 13315,
    "codingamerId": 154906,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 13303,
    "votableId": 8300637,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Yay, you're alive!\n\n\nPunctuation: yes, anything that can be explained in not-too-many words would go a long way.  Not too worrisome, though, all can be inferred in-fine from the tests.\n\nContext: I think I've got the right implementation in the end.  It just feels dirty, as my pure approach really has to handle it in two places, and the tests do feature no-ops (name-dropping at end-of-line that don't appear to be part of arithmetic and refer to the person who was already the context at that point).  In addition to having to maintain the \"did I actually do something\" state.\nI have to take care of first-word context switch first, else I wouldn't operate actions properly.  I can't do flavored context switches directly, because it's not immediately apparent whether or not they're part of arithmetic (hence *not* switches).  I can't \"just do\" flavored context switches in the end, as I don't know whether or not an action happened unless I tracked it.  That's the sort of mental complexity I faced.\n\nNot sure I get your superset aproach.  The anti-algorithm I described was necessary, I think, or I wouldn't have done it.  IMHO the complexity is in determining whether a *nick* namedrop is a switch or a top-of-stack read.\n\nSubtraction: I don't remember I actually said anything about it?\n\nNested arithmetic: it really reminds me of the LOLCODE model. :-D\n\nLukewarm reception: I plead guilty.  That puzzle is great, but it *is* a mouthful, non-trivial to understand let alone get in.  Much of the fun of it is reading the actual chat lines, and the CG interface's limited width on my home computer kills a lot of that.\n\nDeterminism: well, I wrote a recursive parser, but it seems to work anyway.  Maybe some constraint that no arithmetic special word (or action, FTM) can be a declared noun?\n\nUncontexted chat: the way I see it, the problem comes from the fact it's a breeding pool for arithmetic errors, who are unspecified.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 239228248000
  },
  {
    "commentId": 13316,
    "codingamerId": 552776,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 13303,
    "votableId": 8300674,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "\" if I'm not mistaken, the case of an \"a\" token *not* being followed by a noun doesn't occur until the very last test case.  \"\n\n - I misread this. I thought you were talking about subtraction. I understand now. I agree there should be a test for this earlier on. Thanks.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 239227923000
  },
  {
    "commentId": 6442,
    "codingamerId": 1174780,
    "commentableId": 3349404,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 6440,
    "votableId": 4320810,
    "userVoteValue": 0,
    "nickname": "Convly",
    "content": "You're right for the initials, i'd read the testcases too quickly!\nOh and I'm in? I'm so hyped! :smiley:\nI will definitely do it, and again thank you for bringing all these incredible and interesting contributions to the platform. You're awesome!",
    "codingamerHandle": "e610ecd0fa656c701cd8cc68a0aab5cc0874711",
    "avatar": 25204201211357,
    "elapsedTime": 289781115000
  }
]