[
  {
    "commentId": 14955,
    "codingamerId": 154906,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 9077338,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Normalized I/O section's line endings (test 1 and validator 4 impacted)",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 231007792000
  },
  {
    "commentId": 14872,
    "codingamerId": 878974,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 9056135,
    "userVoteValue": 0,
    "nickname": "nicola",
    "content": "The wires only need to be written like this: EKMFLGDQVZNTOWYHXUSPAIBRCJ.",
    "codingamerHandle": "21bf42f790de293c3aef398f18cd2627479878",
    "onlineSince": 1770701591260,
    "avatar": 26090852120005,
    "elapsedTime": 231230921000
  },
  {
    "commentId": 14772,
    "codingamerId": 1336138,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 5,
    "downVotes": 0,
    "votableId": 9037844,
    "userVoteValue": 0,
    "nickname": "wyrdoe",
    "content": "I think it is confusing to refer to the wires by the alphabet letters they connect, I think it is better to use numbers to refer to the positions the wires attach. \n\nHow about expressing it like this:\nLet's take a rotor with only 5 letters (A, B, C, D, E). There are wires that set the substitutions between positions on these rotors, these are refered to by the positions they connect. For instance:\n0-1, 1-3, 2-4, 3-2, 4-0\nSo initially since A is in position 0, B in position 1 this means our substitution is A - B, B - D, C - E, D - C, E - A.\nSo if we now rotate the rotor, our letters are now in the order (E, A, B, C, D). This means that since the wires did not move, the index substitutions now connect the letters E - A, A - C, B - D, C - B, D - E.\n\nDoing another rotation ends up with the cypher: D - E, E - B, A - C, B - A, C - D.\nHere is a wiring diagram showing these rotations:\n\nA   B   C   D   E\n|   |_  |__/___/_\n|___  |___/_  / |\n    |    /  |/  |\n    |   / _/|   |\n    |   |/  |   |\n    | _/|   |   |\n    |/  |   |   |\n    |   |   |   |\n __/|   |   |   |\n|   |   |   |   |\nA   B   C   D   E\n\nE   A   B   C   D\n|   |_  |__/___/_\n|___  |___/_  / |\n    |    /  |/  |\n    |   / _/|   |\n    |   |/  |   |\n    | _/|   |   |\n    |/  |   |   |\n    |   |   |   |\n __/|   |   |   |\n|   |   |   |   |\nE   A   B   C   D\n\nD   E   A   B   C\n|   |_  |__/___/_\n|___  |___/_  / |\n    |    /  |/  |\n    |   / _/|   |\n    |   |/  |   |\n    | _/|   |   |\n    |/  |   |   |\n    |   |   |   |\n __/|   |   |   |\n|   |   |   |   |\nD   E   A   B   C",
    "codingamerHandle": "cc7e7953ea0396b86531628b8c515c278316331",
    "avatar": 3842558689204,
    "elapsedTime": 231460363000
  },
  {
    "commentId": 14757,
    "codingamerId": 1502463,
    "commentableId": 8935995,
    "responseCount": 3,
    "upVotes": 0,
    "downVotes": 1,
    "votableId": 9032947,
    "userVoteValue": 0,
    "nickname": "jitsch",
    "content": "The reflector is missing in the stub generator input, e.g.\nloopline 26 wireRef:word(3)\ninserted as line 7.\nThe rotation is not how it really worked. It worked like a normal counter (like in a car or tape deck).\nWith your implementation it will jump from 099 to 110 instead of continuing with 100. But reading the instructions carefully, one can figure out, what you mean (if you really insist on this behaviour).",
    "codingamerHandle": "362ccb9990dd8936ff38704cdc6b5adb3642051",
    "avatar": 15422411815708,
    "elapsedTime": 231522451000
  },
  {
    "commentId": 14674,
    "codingamerId": 1032745,
    "commentableId": 8935995,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 9004113,
    "userVoteValue": 0,
    "nickname": "selenae",
    "content": "I think I understand what rotation does: the wires contain the amount of shift; in the example it's {+1, +2, +2, -1, +1}. It might be clearer if you describe the wires that way instead of as output letters.\nWhen the wire inputs are not given in alphabetical order, are the shifts distances along this scrambled alphabet? i.e. in Test 1 the wire K->B is a shift of 21, so after one turn this wire will move to E->I ?\n\nI don't understand what a \"triggering letter\" is.  Is this a clock-like gear that pushes the second rotor after each full rotation (26 ticks) of the first rotor? Or does the second rotor move whenever the first rotor's output is the triggering letter? Or something else?\n\nFinally, does rotation happen immediately when a key is pressed, so the output is based on a NEW rotor position?",
    "codingamerHandle": "5a73250918c0a9051e30da402aaad0125472301",
    "avatar": 8151522711179,
    "elapsedTime": 231867493000
  },
  {
    "commentId": 14665,
    "codingamerId": 154906,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 9001965,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "In the current state, this doesn't feel like it's solvable without external information.\n\nIt's not clear/explained how we go from the list of wires to the next one (after rotation?).\nNo example matches the statement, that could have helped.\n\nWhat actually rotates? Why is the word \"substitution\" there? Nothing gets visibly substituted.\n\nSo let's not even get started about the reflector or how it propagates back.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 231889880000
  },
  {
    "commentId": 14683,
    "codingamerId": 155774,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 14674,
    "votableId": 9005813,
    "userVoteValue": 0,
    "nickname": "dwarfie",
    "content": "I apologize, wires where iverted because i kept original rotor description which go from right to left. I changed inputs to have INPUT-OUTPUT (IMHO more understandable). So for test 1 : A->E then A->J (from B->K) \n\nI'll try to explain more how the rotation is triggered ... but it is mechanical, ... so i need to make it simple to understand ... not so easy\n\nI'll explicit that ALL rotations are done before coding and that ouput is base on new position. I wrote it at first rotor but it is not clear enough.",
    "codingamerHandle": "2ad5cc4919ed368f16de4aecd570e21e477551",
    "avatar": 17785582865119,
    "elapsedTime": 231830555000
  },
  {
    "commentId": 14769,
    "codingamerId": 155774,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 14757,
    "votableId": 9034470,
    "userVoteValue": 0,
    "nickname": "dwarfie",
    "content": "Oops ... You are right , i forgot to add it to stub genearator. Fixed\n\nI tested my implementation with real messages and with many enigma simulators to have a real working solution\n\nI spend long time to find the documentation that explain the double stepping mechanism of the middle rotor to solve it\n\nYou can check : http://www.intelligenia.org/downloads/rotors1.pdf",
    "codingamerHandle": "2ad5cc4919ed368f16de4aecd570e21e477551",
    "avatar": 17785582865119,
    "elapsedTime": 231487292000
  },
  {
    "commentId": 14826,
    "codingamerId": 1502463,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 2,
    "downVotes": 0,
    "parentCommentId": 14757,
    "votableId": 9048651,
    "userVoteValue": 0,
    "nickname": "jitsch",
    "content": "Please excuse me. You are right, too. I was to lazy to even read the full wiki article about it (the german version explains it very detailed). I'm sorry.\nI will do (better) research in the future.\nBut what this shows, that one can solve this puzzle without external information.\nHey, you even used the substitutions from the real rotors and reflectors.\n\nI removed some spaces in front of \"?\"s and \":\"s and corrected some grammatical mistakes (is->are, his->its); I hope you don't mind.\nValidator 3 and Longest Message had blanks after the last wire of the first rotor.\nAnd last but not least I changed the explanation \"at next input, rotation of second and third rotor.\" with \"at next input, the third rotor <<and>> the second rotor (once again) will rotate.\"\n\nYou could mention that the reflectors have only contacts on one side  (because of JBMs last sentence) and that if A connects to E then E connects to A which will normally not be the case for rotors. But that here the same notation is used to be able to reuse the written code from the rotors.\nYou could mention that \"encode/decode\" is the same by design, so that noone is puzzling when to encode and when to decode.\nYou could add a constraint about how long the messages can get (the \"Longest Message\" is 988 characters long, but in the stub generator you write string(256)). That might lead to errors in some languages.",
    "codingamerHandle": "362ccb9990dd8936ff38704cdc6b5adb3642051",
    "avatar": 15422411815708,
    "elapsedTime": 231348750000
  },
  {
    "commentId": 14847,
    "codingamerId": 155774,
    "commentableId": 8935995,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 14757,
    "votableId": 9050530,
    "userVoteValue": 0,
    "nickname": "dwarfie",
    "content": "No problem. Yes i used real rotors, i wanted it to be  as realistic as possible  (even without plubgoard).\n\nThanks for the corrections of typo and the blanks (i missed this one)\n\nI added constraints and updated the stub.",
    "codingamerHandle": "2ad5cc4919ed368f16de4aecd570e21e477551",
    "avatar": 17785582865119,
    "elapsedTime": 231307346000
  }
]