{
  "id": 51528,
  "activeVersion": 42,
  "score": 6,
  "votableId": 28708504,
  "codingamerId": 4433844,
  "views": 223,
  "commentableId": 28577643,
  "title": "Gadsby and The Great Gatsby",
  "status": "ACCEPTED",
  "type": "CLASHOFCODE",
  "nickname": "Lisa-Has-Ideas",
  "publicHandle": "515288fe783b9efff9c74cb3289bcfca9cd4c",
  "codingamerHandle": "6057618d773e6e27a20abefa031c4e674483344",
  "lastVersion": {
    "version": 42,
    "autocloseTime": 1682951924635,
    "data": {
      "title": "Gadsby and The Great Gatsby",
      "topics": [],
      "fastest": true,
      "reverse": true,
      "shortest": true,
      "solution": "using System; using System.Linq; using System.IO; using System.Text; using System.Collections; using System.Collections.Generic; using System.Globalization;\n\t\t\t\npublic class Program\n{\n\tpublic static void Main()\n\t{\n\t\tstring Excerpt = Console.ReadLine();\n\t\tvar ExcerptWords = Excerpt.Split(' ');\n\n\t\tstring noGs = \"\";\n\t\t\n\t\tforeach (string word in ExcerptWords)\n\t\t{\n\t\t\tbool hasG = word.ToLower().Contains('g');\n\t\t\tif (hasG)\n\t\t\t{\n\t\t\t\tif (noGs != \"\")\n\t\t\t\t{\t\n\t\t\t\t\tConsole.WriteLine(noGs.Trim());\n\t\t\t\t\tnoGs = \"\";\n\t\t\t\t}\n\t\t\t\tDisplayGword(word);\t\t\t\t\t\n\t\t\t}\n\t\t\telse\n\t\t\t{\n\t\t\t\tnoGs = noGs + word + \" \";\n\t\t\t}\n\t\t}\n\t\tif (noGs.Trim() != \"\") Console.WriteLine(noGs.Trim());\n\t}\n\t\n\tpublic static void DisplayGword(string gword)\n\t{\n\t\tint len = gword.Length;\n\t\n\t\tstring topBorder = new string ('v', len+4);\n\t\tstring bottomBorder = new string ('^', len+4);\n\t\tConsole.WriteLine(topBorder);\n\t\tConsole.WriteLine(\"> \" + gword.Trim() + \" <\");//stars);\n\t\tConsole.WriteLine(bottomBorder);\n\t}\n}",
      "statement": "<<Background:>>\nGadsby is a 1939 novel by Ernest Vincent Wright which does not include any words that contain the letter E, the most common letter in English.\n\nIt isn't the same as The Great Gatsby, but you want to do something similar with that novel and the letter {{G}}.\n\n<<Your task:>>\nGiven an [[excerpt]], output that same excerpt, except put any word containing {{G}} (or {{g}}) on its own line surrounded by a box, where the box looks like this:\n\n`vvvvvvvvv\n> gword <\n^^^^^^^^^`\n<<or>>\n\n`vvvvvvvvvvvvvvvvvvvv\n> This_has_G_in_it <\n^^^^^^^^^^^^^^^^^^^^` \n<<Notes:>>\n➤ The box width depends on the word length\n➤ To keep it simple, <<any punctuation next to a word counts as part of that word>>; for example {{Egg,}} and {{charming.)}} are words, including the comma and period and parentheses\n➤ Trim off any leading or trailing blank spaces\n\n\n\n\n\nExcerpts are from The Great Gatsby by F. Scott Fitzgerald.",
      "testCases": [
        {
          "title": "Test 1",
          "isTest": true,
          "testIn": "To the wingless a more arresting phenomenon is their dissimilarity",
          "testOut": "To the\nvvvvvvvvvvvv\n> wingless <\n^^^^^^^^^^^^\na more\nvvvvvvvvvvvvv\n> arresting <\n^^^^^^^^^^^^^\nphenomenon is their dissimilarity",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 1",
          "isTest": false,
          "testIn": "It was a matter of chance that I should have rented a house in one of the strangest communities in North America. It was on that slender riotous island which extends itself due east of New York and where there are, among other natural curiosities, two unusual formations of land. Twenty miles from the city a pair of enormous eggs, identical in contour and separated only by a courtesy bay, jut out into the most domesticated body of salt water in the Western Hemisphere, the great wet barnyard of Long Island Sound. They are not perfect ovals--like the egg in the Columbus story they are both crushed flat at the contact end-- but their physical resemblance must be a source of perpetual confusion to the gulls that fly overhead.",
          "testOut": "It was a matter of chance that I should have rented a house in one of the\nvvvvvvvvvvvvv\n> strangest <\n^^^^^^^^^^^^^\ncommunities in North America. It was on that slender riotous island which extends itself due east of New York and where there are,\nvvvvvvvvv\n> among <\n^^^^^^^^^\nother natural curiosities, two unusual formations of land. Twenty miles from the city a pair of enormous\nvvvvvvvvv\n> eggs, <\n^^^^^^^^^\nidentical in contour and separated only by a courtesy bay, jut out into the most domesticated body of salt water in the Western Hemisphere, the\nvvvvvvvvv\n> great <\n^^^^^^^^^\nwet barnyard of\nvvvvvvvv\n> Long <\n^^^^^^^^\nIsland Sound. They are not perfect ovals--like the\nvvvvvvv\n> egg <\n^^^^^^^\nin the Columbus story they are both crushed flat at the contact end-- but their physical resemblance must be a source of perpetual confusion to the\nvvvvvvvvv\n> gulls <\n^^^^^^^^^\nthat fly overhead.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 2",
          "isTest": true,
          "testIn": "'This Mr. Gatsby you spoke of is my neighbor--' I said.",
          "testOut": "'This Mr.\nvvvvvvvvvv\n> Gatsby <\n^^^^^^^^^^\nyou spoke of is my\nvvvvvvvvvvvvvvv\n> neighbor--' <\n^^^^^^^^^^^^^^^\nI said.",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 2",
          "isTest": false,
          "testIn": "I participated in that delayed Teutonic migration known as the Great War.",
          "testOut": "I participated in that delayed Teutonic\nvvvvvvvvvvvvv\n> migration <\n^^^^^^^^^^^^^\nknown as the\nvvvvvvvvv\n> Great <\n^^^^^^^^^\nWar.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 3",
          "isTest": true,
          "testIn": "I lived at West Egg, the--well, the less fashionable of the two, though this is a most superficial tag to express the bizarre and not a little sinister contrast between them. My house was at the very tip of the egg, only fifty yards from the Sound, and squeezed between two huge places that rented for twelve or fifteen thousand a season. The one on my right was a colossal affair by any standard--it was a factual imitation of some Hôtel de Ville in Normandy, with a tower on one side, spanking new under a thin beard of raw ivy, and a marble swimming pool and more than forty acres of lawn and garden.",
          "testOut": "I lived at West\nvvvvvvvv\n> Egg, <\n^^^^^^^^\nthe--well, the less fashionable of the two,\nvvvvvvvvvv\n> though <\n^^^^^^^^^^\nthis is a most superficial\nvvvvvvv\n> tag <\n^^^^^^^\nto express the bizarre and not a little sinister contrast between them. My house was at the very tip of the\nvvvvvvvv\n> egg, <\n^^^^^^^^\nonly fifty yards from the Sound, and squeezed between two\nvvvvvvvv\n> huge <\n^^^^^^^^\nplaces that rented for twelve or fifteen thousand a season. The one on my\nvvvvvvvvv\n> right <\n^^^^^^^^^\nwas a colossal affair by any standard--it was a factual imitation of some Hôtel de Ville in Normandy, with a tower on one side,\nvvvvvvvvvvvv\n> spanking <\n^^^^^^^^^^^^\nnew under a thin beard of raw ivy, and a marble\nvvvvvvvvvvvv\n> swimming <\n^^^^^^^^^^^^\npool and more than forty acres of lawn and\nvvvvvvvvvvv\n> garden. <\n^^^^^^^^^^^",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 3",
          "isTest": false,
          "testIn": "It was Gatsby's mansion. Or rather, as I didn't know Mr. Gatsby it was a mansion inhabited by a gentleman of that name. My own house was an eye-sore, but it was a small eye-sore, and it had been overlooked, so I had a view of the water, a partial view of my neighbor's lawn, and the consoling proximity of millionaires--all for eighty dollars a month.",
          "testOut": "It was\nvvvvvvvvvvvv\n> Gatsby's <\n^^^^^^^^^^^^\nmansion. Or rather, as I didn't know Mr.\nvvvvvvvvvv\n> Gatsby <\n^^^^^^^^^^\nit was a mansion inhabited by a\nvvvvvvvvvvvvv\n> gentleman <\n^^^^^^^^^^^^^\nof that name. My own house was an eye-sore, but it was a small eye-sore, and it had been overlooked, so I had a view of the water, a partial view of my\nvvvvvvvvvvvvvv\n> neighbor's <\n^^^^^^^^^^^^^^\nlawn, and the\nvvvvvvvvvvvvv\n> consoling <\n^^^^^^^^^^^^^\nproximity of millionaires--all for\nvvvvvvvvvv\n> eighty <\n^^^^^^^^^^\ndollars a month.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 4",
          "isTest": true,
          "testIn": "Across the courtesy bay the white palaces of fashionable East Egg glittered along the water, and the history of the summer really begins on the evening I drove over there to have dinner with the Tom Buchanans. Daisy was my second cousin once removed and I'd known Tom in college. And just after the war I spent two days with them in Chicago.",
          "testOut": "Across the courtesy bay the white palaces of fashionable East\nvvvvvvv\n> Egg <\n^^^^^^^\nvvvvvvvvvvvvv\n> glittered <\n^^^^^^^^^^^^^\nvvvvvvvvv\n> along <\n^^^^^^^^^\nthe water, and the history of the summer really\nvvvvvvvvvv\n> begins <\n^^^^^^^^^^\non the\nvvvvvvvvvvv\n> evening <\n^^^^^^^^^^^\nI drove over there to have dinner with the Tom Buchanans. Daisy was my second cousin once removed and I'd known Tom in\nvvvvvvvvvvvv\n> college. <\n^^^^^^^^^^^^\nAnd just after the war I spent two days with them in\nvvvvvvvvvvvv\n> Chicago. <\n^^^^^^^^^^^^",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 4",
          "isTest": false,
          "testIn": "Her husband, among various physical accomplishments, had been one of the most powerful ends that ever played football at New Haven-a national figure in a way, one of those men who reach such an acute limited excellence at twenty-one that everything afterward savors of anti-climax. His family were enormously wealthy--even in college his freedom with money was a matter for reproach--but now he'd left Chicago and come east in a fashion that rather took your breath away: for instance he'd brought down a string of polo ponies from Lake Forest. It was hard to realize that a man in my own generation was wealthy enough to do that.",
          "testOut": "Her husband,\nvvvvvvvvv\n> among <\n^^^^^^^^^\nvarious physical accomplishments, had been one of the most powerful ends that ever played football at New Haven-a national\nvvvvvvvvvv\n> figure <\n^^^^^^^^^^\nin a way, one of those men who reach such an acute limited excellence at twenty-one that\nvvvvvvvvvvvvvv\n> everything <\n^^^^^^^^^^^^^^\nafterward savors of anti-climax. His family were enormously wealthy--even in\nvvvvvvvvvvv\n> college <\n^^^^^^^^^^^\nhis freedom with money was a matter for reproach--but now he'd left\nvvvvvvvvvvv\n> Chicago <\n^^^^^^^^^^^\nand come east in a fashion that rather took your breath away: for instance he'd\nvvvvvvvvvvv\n> brought <\n^^^^^^^^^^^\ndown a\nvvvvvvvvvv\n> string <\n^^^^^^^^^^\nof polo ponies from Lake Forest. It was hard to realize that a man in my own\nvvvvvvvvvvvvvv\n> generation <\n^^^^^^^^^^^^^^\nwas wealthy\nvvvvvvvvvv\n> enough <\n^^^^^^^^^^\nto do that.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 5",
          "isTest": true,
          "testIn": "And so it happened that on a warm windy evening I drove over to East Egg to see two old friends whom I scarcely knew at all. Their house was even more elaborate than I expected, a cheerful red and white Georgian Colonial mansion overlooking the bay. The lawn started at the beach and ran toward the front door for a quarter of a mile, jumping over sun-dials and brick walks and burning gardens",
          "testOut": "And so it happened that on a warm windy\nvvvvvvvvvvv\n> evening <\n^^^^^^^^^^^\nI drove over to East\nvvvvvvv\n> Egg <\n^^^^^^^\nto see two old friends whom I scarcely knew at all. Their house was even more elaborate than I expected, a cheerful red and white\nvvvvvvvvvvvv\n> Georgian <\n^^^^^^^^^^^^\nColonial mansion\nvvvvvvvvvvvvvvv\n> overlooking <\n^^^^^^^^^^^^^^^\nthe bay. The lawn started at the beach and ran toward the front door for a quarter of a mile,\nvvvvvvvvvvv\n> jumping <\n^^^^^^^^^^^\nover sun-dials and brick walks and\nvvvvvvvvvvv\n> burning <\n^^^^^^^^^^^\nvvvvvvvvvvv\n> gardens <\n^^^^^^^^^^^",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 5",
          "isTest": false,
          "testIn": "he strolled over to the garage and found George Wilson sick in his office--really sick, pale as his own pale hair and shaking all over.",
          "testOut": "he strolled over to the\nvvvvvvvvvv\n> garage <\n^^^^^^^^^^\nand found\nvvvvvvvvvv\n> George <\n^^^^^^^^^^\nWilson sick in his office--really sick, pale as his own pale hair and\nvvvvvvvvvvv\n> shaking <\n^^^^^^^^^^^\nall over.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 6",
          "isTest": true,
          "testIn": "He had changed since his New Haven years. Now he was a sturdy, straw haired man of thirty with a rather hard mouth and a supercilious manner. Two shining, arrogant eyes had established dominance over his face and gave him the appearance of always leaning aggressively forward. Not even the effeminate swank of his riding clothes could hide the enormous power of that body-- he seemed to fill those glistening boots until he strained the top lacing and you could see a great pack of muscle shifting when his shoulder moved under his thin coat.",
          "testOut": "He had\nvvvvvvvvvvv\n> changed <\n^^^^^^^^^^^\nsince his New Haven years. Now he was a sturdy, straw haired man of thirty with a rather hard mouth and a supercilious manner. Two\nvvvvvvvvvvvv\n> shining, <\n^^^^^^^^^^^^\nvvvvvvvvvvvv\n> arrogant <\n^^^^^^^^^^^^\neyes had established dominance over his face and\nvvvvvvvv\n> gave <\n^^^^^^^^\nhim the appearance of always\nvvvvvvvvvvv\n> leaning <\n^^^^^^^^^^^\nvvvvvvvvvvvvvvvv\n> aggressively <\n^^^^^^^^^^^^^^^^\nforward. Not even the effeminate swank of his\nvvvvvvvvvv\n> riding <\n^^^^^^^^^^\nclothes could hide the enormous power of that body-- he seemed to fill those\nvvvvvvvvvvvvvv\n> glistening <\n^^^^^^^^^^^^^^\nboots until he strained the top\nvvvvvvvvvv\n> lacing <\n^^^^^^^^^^\nand you could see a\nvvvvvvvvv\n> great <\n^^^^^^^^^\npack of muscle\nvvvvvvvvvvvv\n> shifting <\n^^^^^^^^^^^^\nwhen his shoulder moved under his thin coat.",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 6",
          "isTest": false,
          "testIn": "His speaking voice, a gruff husky tenor, added to the impression of fractiousness he conveyed. There was a touch of paternal contempt in it, even toward people he liked--and there were men at New Haven who had hated his guts.",
          "testOut": "His\nvvvvvvvvvvvv\n> speaking <\n^^^^^^^^^^^^\nvoice, a\nvvvvvvvvv\n> gruff <\n^^^^^^^^^\nhusky tenor, added to the impression of fractiousness he conveyed. There was a touch of paternal contempt in it, even toward people he liked--and there were men at New Haven who had hated his\nvvvvvvvvv\n> guts. <\n^^^^^^^^^",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 7",
          "isTest": true,
          "testIn": "Turning me around by one arm he moved a broad flat hand along the front vista, including in its sweep a sunken Italian garden, a half acre of deep pungent roses and a snub-nosed motor boat that bumped the tide off shore.",
          "testOut": "vvvvvvvvvvv\n> Turning <\n^^^^^^^^^^^\nme around by one arm he moved a broad flat hand\nvvvvvvvvv\n> along <\n^^^^^^^^^\nthe front vista,\nvvvvvvvvvvvvv\n> including <\n^^^^^^^^^^^^^\nin its sweep a sunken Italian\nvvvvvvvvvvv\n> garden, <\n^^^^^^^^^^^\na half acre of deep\nvvvvvvvvvvv\n> pungent <\n^^^^^^^^^^^\nroses and a snub-nosed motor boat that bumped the tide off shore.",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 7",
          "isTest": false,
          "testIn": "The only completely stationary object in the room was an enormous couch on which two young women were buoyed up as though upon an anchored balloon. They were both in white and their dresses were rippling and fluttering as if they had just been blown back in after a short flight around the house. I must have stood for a few moments listening to the whip and snap of the curtains and the groan of a picture on the wall. Then there was a boom as Tom Buchanan shut the rear windows and the caught wind died out about the room and the curtains and the rugs and the two young women ballooned slowly to the floor.",
          "testOut": "The only completely stationary object in the room was an enormous couch on which two\nvvvvvvvvv\n> young <\n^^^^^^^^^\nwomen were buoyed up as\nvvvvvvvvvv\n> though <\n^^^^^^^^^^\nupon an anchored balloon. They were both in white and their dresses were\nvvvvvvvvvvvv\n> rippling <\n^^^^^^^^^^^^\nand\nvvvvvvvvvvvvvv\n> fluttering <\n^^^^^^^^^^^^^^\nas if they had just been blown back in after a short\nvvvvvvvvvv\n> flight <\n^^^^^^^^^^\naround the house. I must have stood for a few moments\nvvvvvvvvvvvvv\n> listening <\n^^^^^^^^^^^^^\nto the whip and snap of the curtains and the\nvvvvvvvvv\n> groan <\n^^^^^^^^^\nof a picture on the wall. Then there was a boom as Tom Buchanan shut the rear windows and the\nvvvvvvvvvv\n> caught <\n^^^^^^^^^^\nwind died out about the room and the curtains and the\nvvvvvvvv\n> rugs <\n^^^^^^^^\nand the two\nvvvvvvvvv\n> young <\n^^^^^^^^^\nwomen ballooned slowly to the floor.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 8",
          "isTest": true,
          "testIn": "The younger of the two was a stranger to me. She was extended full length at her end of the divan, completely motionless and with her chin raised a little as if she were balancing something on it which was quite likely to fall. If she saw me out of the corner of her eyes she gave no hint of it--indeed, I was almost surprised into murmuring an apology for having disturbed her by coming in.",
          "testOut": "The\nvvvvvvvvvvv\n> younger <\n^^^^^^^^^^^\nof the two was a\nvvvvvvvvvvvv\n> stranger <\n^^^^^^^^^^^^\nto me. She was extended full\nvvvvvvvvvv\n> length <\n^^^^^^^^^^\nat her end of the divan, completely motionless and with her chin raised a little as if she were\nvvvvvvvvvvvvv\n> balancing <\n^^^^^^^^^^^^^\nvvvvvvvvvvvvv\n> something <\n^^^^^^^^^^^^^\non it which was quite likely to fall. If she saw me out of the corner of her eyes she\nvvvvvvvv\n> gave <\n^^^^^^^^\nno hint of it--indeed, I was almost surprised into\nvvvvvvvvvvvvv\n> murmuring <\n^^^^^^^^^^^^^\nan\nvvvvvvvvvvv\n> apology <\n^^^^^^^^^^^\nfor\nvvvvvvvvvv\n> having <\n^^^^^^^^^^\ndisturbed her by\nvvvvvvvvvv\n> coming <\n^^^^^^^^^^\nin.",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 8",
          "isTest": false,
          "testIn": "The other girl, Daisy, made an attempt to rise--she leaned slightly forward with a conscientious expression--then she laughed, an absurd, charming little laugh, and I laughed too and came forward into the room.",
          "testOut": "The other\nvvvvvvvvv\n> girl, <\n^^^^^^^^^\nDaisy, made an attempt to rise--she leaned\nvvvvvvvvvvvv\n> slightly <\n^^^^^^^^^^^^\nforward with a conscientious expression--then she\nvvvvvvvvvvvv\n> laughed, <\n^^^^^^^^^^^^\nan absurd,\nvvvvvvvvvvvv\n> charming <\n^^^^^^^^^^^^\nlittle\nvvvvvvvvvv\n> laugh, <\n^^^^^^^^^^\nand I\nvvvvvvvvvvv\n> laughed <\n^^^^^^^^^^^\ntoo and came forward into the room.",
          "isValidator": true,
          "needValidation": true
        },
        {
          "title": "Test 9",
          "isTest": true,
          "testIn": "She laughed again, as if she said something very witty, and held my hand for a moment, looking up into my face, promising that there was no one in the world she so much wanted to see. That was a way she had. She hinted in a murmur that the surname of the balancing girl was Baker. (I've heard it said that Daisy's murmur was only to make people lean toward her; an irrelevant criticism that made it no less charming.)",
          "testOut": "She\nvvvvvvvvvvv\n> laughed <\n^^^^^^^^^^^\nvvvvvvvvvv\n> again, <\n^^^^^^^^^^\nas if she said\nvvvvvvvvvvvvv\n> something <\n^^^^^^^^^^^^^\nvery witty, and held my hand for a moment,\nvvvvvvvvvvv\n> looking <\n^^^^^^^^^^^\nup into my face,\nvvvvvvvvvvvvv\n> promising <\n^^^^^^^^^^^^^\nthat there was no one in the world she so much wanted to see. That was a way she had. She hinted in a murmur that the surname of the\nvvvvvvvvvvvvv\n> balancing <\n^^^^^^^^^^^^^\nvvvvvvvv\n> girl <\n^^^^^^^^\nwas Baker. (I've heard it said that Daisy's murmur was only to make people lean toward her; an irrelevant criticism that made it no less\nvvvvvvvvvvvvvv\n> charming.) <\n^^^^^^^^^^^^^^",
          "isValidator": false,
          "needValidation": true
        },
        {
          "title": "Validator 9",
          "isTest": false,
          "testIn": "I told her how I had stopped off in Chicago for a day on my way east and how a dozen people had sent their love through me.",
          "testOut": "I told her how I had stopped off in\nvvvvvvvvvvv\n> Chicago <\n^^^^^^^^^^^\nfor a day on my way east and how a dozen people had sent their love\nvvvvvvvvvvv\n> through <\n^^^^^^^^^^^\nme.",
          "isValidator": true,
          "needValidation": true
        }
      ],
      "stubGenerator": "read Excerpt:string(1000)\nwrite Excerpt with G-words emphasized",
      "inputDescription": "<<Line 1:>> A single string that is that [[excerpt]]",
      "solutionLanguage": "C#",
      "outputDescription": "<<Multiple lines: >> That same [[excerpt]], but with words containing {{G}} (or {{g}}) surrounded by a box"
    },
    "draft": false,
    "readyForModeration": true,
    "statementHTML": "<div class=\"statement-body\">\n<div class=\"statement-section statement-goal\">\n   <h2><span class=\"icon icon-goal\">&nbsp;</span><span>Goal </span></h2>\n   <span class=\"question-statement\"><strong>Background:</strong><br>Gadsby is a 1939 novel by Ernest Vincent Wright which does not include any words that contain the letter E, the most common letter in English.<br><br>It isn't the same as The Great Gatsby, but you want to do something similar with that novel and the letter <const>G</const>.<br><br><strong>Your task:</strong><br>Given an <var>excerpt</var>, output that same excerpt, except put any word containing <const>G</const> (or <const>g</const>) on its own line surrounded by a box, where the box looks like this:<br><br><pre style=\"font-family: monospace\">vvvvvvvvv<br>&gt; gword &lt;<br>^^^^^^^^^</pre><br><strong>or</strong><br><br><pre style=\"font-family: monospace\">vvvvvvvvvvvvvvvvvvvv<br>&gt; This_has_G_in_it &lt;<br>^^^^^^^^^^^^^^^^^^^^</pre> <br><strong>Notes:</strong><br>➤ The box width depends on the word length<br>➤ To keep it simple, <strong>any punctuation next to a word counts as part of that word</strong>; for example <const>Egg,</const> and <const>charming.)</const> are words, including the comma and period and parentheses<br>➤ Trim off any leading or trailing blank spaces<br><br><br><br><br><br>Excerpts are from The Great Gatsby by F. Scott Fitzgerald.</span>\n</div>\n<div class=\"statement-section statement-protocol\">\n   <div class=\"blk\">\n      <div class=\"title\">Input</div>\n      <div class=\"question-statement-input\"><strong>Line 1:</strong> A single string that is that <var>excerpt</var></div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Output</div>\n      <div class=\"question-statement-output\"><strong>Multiple lines: </strong> That same <var>excerpt</var>, but with words containing <const>G</const> (or <const>g</const>) surrounded by a box</div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Constraints</div>\n      <div class=\"question-statement-constraints\"></div>\n   </div>\n   <div class=\"blk\">\n      <div class=\"title\">Example</div>\n      <div class=\"statement-inout\">\n         <div class=\"statement-inout-in\">\n            <div class=\"title\">Input</div>\n            <pre class=\"question-statement-example-in\">To the wingless a more arresting phenomenon is their dissimilarity</pre>\n         </div>\n         <div class=\"statement-inout-out\">\n            <div class=\"title\">Output</div>\n            <pre class=\"question-statement-example-out\">To the\nvvvvvvvvvvvv\n&gt; wingless &lt;\n^^^^^^^^^^^^\na more\nvvvvvvvvvvvvv\n&gt; arresting &lt;\n^^^^^^^^^^^^^\nphenomenon is their dissimilarity</pre>\n         </div>\n      </div>\n   </div>\n</div>"
  },
  "validatedFor": 88053452296,
  "avatar": 94714081045618,
  "commentCount": 21,
  "upVotes": 7,
  "downVotes": 1,
  "validateAction": {
    "actionId": 791007,
    "progress": 1,
    "alreadyDone": false
  },
  "denyAction": {
    "actionId": 788487,
    "progress": 0.3333333333333333,
    "alreadyDone": false
  },
  "statusHistory": [
    {
      "status": "ACCEPTED",
      "date": 1682675894491,
      "data": {
        "author": "ACTION"
      }
    }
  ],
  "editable": true,
  "draft": false,
  "readyForModeration": true
}