[
  {
    "commentId": 283162,
    "codingamerId": 5300766,
    "commentableId": 35172214,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 35395762,
    "userVoteValue": 0,
    "nickname": "jddingemanse",
    "content": "He where did the 'lowest possible point' as output go (which was there in the original clash contribution)? I thought that was a bit more interesting than 'yes' or 'no' - as well as a bit clearer for debugging.\n\nSorry, I'm too late with this comment I realize. Since this puzzle is live there are already people getting it solved based on the yes or no, so changing it now would not be good.",
    "codingamerHandle": "d95f1456c7409de3e7dcc202f89a3d646670035",
    "avatar": 98376709796567,
    "elapsedTime": 40632832000
  },
  {
    "commentId": 280819,
    "codingamerId": 3305510,
    "commentableId": 35172214,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 35360215,
    "userVoteValue": 0,
    "nickname": "TBali",
    "content": "✅ Approved the contribution.\nComment: I was hesitating about ticking the \"contribution is original enough\" because there are already some similar simple flood-fill/DFS/BFS puzzles, but we cannot get enough of these, can we... :-)",
    "codingamerHandle": "08e6e13d9f7cad047d86ec4d10c777500155033",
    "avatar": 26750785092441,
    "elapsedTime": 41017017000
  },
  {
    "commentId": 280027,
    "codingamerId": 1720510,
    "commentableId": 35172214,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 35349176,
    "userVoteValue": 0,
    "nickname": "DeanTheMachine",
    "content": "✅ Approved the contribution.\nComment: Simple enough DFS puzzle.  The steepness factor is what makes it different than other DFS puzzles.",
    "codingamerHandle": "1d380533c44a49f2743d4171bd8a0f4b0150271",
    "avatar": 19926056859805,
    "elapsedTime": 41114358000
  },
  {
    "commentId": 278675,
    "codingamerId": 2290633,
    "commentableId": 35172214,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 35329294,
    "userVoteValue": 0,
    "nickname": "field3",
    "content": "✅ Approved the contribution.\nComment: A fun puzzle-style problem that teaches you how to explore efficiently.",
    "codingamerHandle": "383fcd61feda976632248fa1eea901563360922",
    "onlineSince": 1770693220663,
    "avatar": 75961127697737,
    "elapsedTime": 41305314000
  },
  {
    "commentId": 283426,
    "codingamerId": 4238671,
    "commentableId": 35172214,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 283162,
    "votableId": 35398791,
    "userVoteValue": 0,
    "nickname": "DavidAugustoVilla",
    "content": "You are correct, the deleted clash version asked for the lowest attainable elevation. I had originally written that this way as well, but binary decisions aren't the best for clashes, so it was lowest elevation for most of its existence. When I recreated this as a solo puzzle, I went back to the binary decision. In my opinion it fits the theme of the puzzle better.\n\nThere are many questions you could ask about exploration without changing the algorithm much: highest elevation attainable, total area explored, etc. What I like about these two ideas is that the search can be terminated as soon as you hit ocean. While that was true of lowest elevation, it may not have been obvious and depends on nothing being at lower elevation than ocean. With yes or no, stopping is a lot more obvious. That's significant because it means there's no need for bounds checking.\n\nThis is intended to be an easy puzzle, so it's fine if someone doesn't really know how to do flood fill efficiently. Maybe they have an algorithm that just times out before reporting no. Math and computation can be really brutal. I say, better to have an early success and then refine that algorithm later on harder puzzles. I hadn't considered ease of debugging, however. That's an interesting counterpoint.\n\nMy biggest concern with binary output is the possibility of cheating the system without doing any work, by random guessing for instance. But if this is a problem, it can be circumvented by adding many more test cases. I believe completion is all that matters here, not percent completion as in clashes. That's why there are currently 13 validators. The smaller dimension maps aren't all that difficult to make. At this point, that's probably the only way the puzzle should be updated.",
    "codingamerHandle": "455d71552aef838a0c75b7617e2d22d41768324",
    "avatar": 132419401284681,
    "elapsedTime": 40606980000
  }
]