[
  {
    "commentId": 5952,
    "codingamerId": 552776,
    "commentableId": 3329754,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4088831,
    "userVoteValue": 0,
    "nickname": "player_one",
    "content": "I have slightly modified the problem statement, and have voted to approve this puzzle. Nicely done. I like the way your tests guided me through the discovery of patterns.",
    "codingamerHandle": "fefb3b0a360d9451bde5553900470e2d677255",
    "avatar": 52487021619351,
    "elapsedTime": 292097600000
  },
  {
    "commentId": 5815,
    "codingamerId": 154906,
    "commentableId": 3329754,
    "responseCount": 3,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4049712,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Started solving it.\n\nFirst issues:\n- at no point is the sequence going through zero. Yet the constraints make it necessary to handle it. It's an ugly special case, could you please remove it? (from the constraints) I sincerely think it's really unneeded in this problem.\n- my bruteforce implementation passes all tests but the final validator. This likely means it's harder than the matching test, which is going to be a massive headache on the forum once this is validated. At a bare minimum, swap them?\n- the upper constraint on [[n]] make it seem like my bruteforce implementationg oughtn't get that far. A (much) larger [[n]] for the final test is likely warranted. Possibly a larger constraint as well.\n\nFirst minor suggestions: that S0 is not as readable as it should be. I'd suggest notating as S(0) instead. And defining iteration by using S(n) and S(n-1).\n\nApart from that, cool idea, I like it! It's like an easier version of Roller Coaster.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292603853000
  },
  {
    "commentId": 5800,
    "codingamerId": 1103438,
    "commentableId": 3329754,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4044193,
    "userVoteValue": 0,
    "nickname": "btharper",
    "content": "Inspired by https://youtu.be/LYKn0yUTIU4 (may contain spoilers for the problem)",
    "codingamerHandle": "5d881e966b225e70e65711553e65f8f18343011",
    "avatar": 5678142876588,
    "elapsedTime": 292651125000
  },
  {
    "commentId": 5816,
    "codingamerId": 154906,
    "commentableId": 3329754,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5815,
    "votableId": 4049816,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Finished solving it. (and my solution appears to be every so slightly overkill, though I've not fully pinned down why yet) (so it's an even easier version of Roller Coaster than I thought) (not that there's anything wrong with that)\n\nThe only serious blocker to approval AFAIC is the final validator that's too hard relative to the final test. The minor blocker is that some of the validator names are a bit too revealing as to their actual contents.\nThe rest is nice-to-have, not blocking.\n\nGood job!\n\n(is the answer as to why my solution is too much in the youtube? how long is it?)",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292602494000
  },
  {
    "commentId": 5881,
    "codingamerId": 1103438,
    "commentableId": 3329754,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5815,
    "votableId": 4066086,
    "userVoteValue": 0,
    "nickname": "btharper",
    "content": "- What makes zero a special and challenging case? That it can be represented in zero bit length? Otherwise it's just \"zero\" and 4 letters. I may not understand your take, but the change doesn't make much difference, originally I just wanted to omit negatives.\n- It was harder, didn't need to be that way and they've been changed so the challenge is harder than the validator (new, higher cap anyway, so a new test case was added). I hadn't tried this outside of python and I was hoping the numbers used would be big enough to make brute force prohibitive, but pushing the cap higher may be needed to stop that.\n- Changed to put the S(n) style, highlighting kept (for now at least, I think your concern was elsewhere)\n- Validators altered slightly to be less lazy on my part\n- The video is about 10 minutes in total and talks about how this style of converting numbers to words, counting letters, and repeating always leads to a certain end cycle. In english everything goes down to four. In this representation everything ends at either 13 or 18. But in some languages there are cycles at the end; French in particular loops between 4 > 6 > 3 > 5 > 4 > ....\n\nShort version: Eliminated zeros, increase maximum, changed \"Big Numbers\" test case / validator, changed variable types to longs (>>2^32), more difference between test cases and validators.\n\nIf anything didn't get fixed, or something new needs fixing, don't hesitate to let me know.",
    "codingamerHandle": "5d881e966b225e70e65711553e65f8f18343011",
    "avatar": 5678142876588,
    "elapsedTime": 292422142000
  },
  {
    "commentId": 5886,
    "codingamerId": 154906,
    "commentableId": 3329754,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5815,
    "votableId": 4066372,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Zero is a special case because its role in the natural algorithm to convert to binary (namely, repeated division by two) is a recursion terminator that does*not* add four to S, except if we're on S(0) specifically.\nI notice your solution sidesteps that by using built-in string conversion. Well, that works too :-)\n\nIndeed, my first non-bruteforce solution only checked for a cycle in the sequence. (It's trivially provable there always is one) It's only later that I noticed it always ended on 18 by a cycle of *only one, found the other attractor by exhaustive search, and simplified my solution a great deal more.\nI'll check the video in the morning.\n\nI'm voting to approve. Great problem, thanks!",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292414304000
  }
]