[
  {
    "commentId": 167493,
    "codingamerId": 3479792,
    "commentableId": 11167948,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 31839344,
    "userVoteValue": 0,
    "nickname": "StepBack13",
    "content": "Pretty hard clash for people without a physics background. I have one and it still took me 3:30 to solve.\n\nI found it hard to read the formula formatting \"(Vx)\" and \"(Vy)\" and took a while to realise they were \"V_x\" and \"V_y\". I think it would be clearer if you used underscores like above, personally.\n\nThe coding of the clash is not really complex at all, the hard part is understanding kinematics and knowing that you can find the time to reach the floor by subsituting certain things for Y and V_y in the second equation. So it's an easy clash for anyone who knows it but a very hard one for anyone who doesn't. It'd be nice if some clashers do manage to solve it without prior knowledge though, teach themselves some kinematics. :)\n\nIn my clash the two other humans got 50% and 25% but didn't share code, so I'm not sure where they got stuck/confused.",
    "codingamerHandle": "da2fe4fbf3c0ab008c6dcf304920ec602979743",
    "avatar": 33990586394707,
    "elapsedTime": 68831059000
  },
  {
    "commentId": 21547,
    "codingamerId": 795321,
    "commentableId": 11167948,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 4,
    "votableId": 11242432,
    "userVoteValue": 0,
    "nickname": "berthy424",
    "content": "Hi,\nI agree with the fact to output integers, but I don't agree to compute X with the rounded value of t.\nDon't give formulas (let peoples find them by them-self). Only give the value of G (9.81) to use in computing output",
    "codingamerHandle": "9d3455176cac63eaa02affb64868bf8d123597",
    "avatar": 16935610968358,
    "elapsedTime": 204966394000
  },
  {
    "commentId": 21552,
    "codingamerId": 1569823,
    "commentableId": 11167948,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 21547,
    "votableId": 11244080,
    "userVoteValue": 0,
    "nickname": "Niako",
    "content": "If formulas were not given, that would be a pen & paper physics problem (I know it's easy, but people on CG are not supposed to know how to solve that, in particular in CoC). See discussions here for instance https://www.codingame.com/contribute/view/1912ed718fdb06816b8c76c2bbc2346b4a70",
    "codingamerHandle": "eb89cbdf69d07106c84edf1d191caaf33289651",
    "avatar": 11911528647474,
    "elapsedTime": 204948794000
  },
  {
    "commentId": 21554,
    "codingamerId": 3431470,
    "commentableId": 11167948,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 21547,
    "votableId": 11244536,
    "userVoteValue": 0,
    "nickname": "Durbano77",
    "content": "Thanks for the feedback, the reason behind the formulas was as Niako explained - its a clash and people should be spending more time figuring out how to implement the formulas than looking up the right ones.\nAs for the time as an integer, the reason behind that was since I was asking them to output the time in seconds anyways, it made sense to me to ask for the distance using that result (Like a mini 2-part question)",
    "codingamerHandle": "f7156d72feeb3d241c1addf29c3799510741343",
    "avatar": 32651620864806,
    "elapsedTime": 204944889000
  }
]