[
  {
    "commentId": 18249,
    "codingamerId": 2874091,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 10266717,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Added \"write answer\" to stub generator so that the initial default code shows the syntax for debugging and outputting the answer.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 217345550000
  },
  {
    "commentId": 5946,
    "codingamerId": 154906,
    "commentableId": 3989924,
    "responseCount": 7,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 4085057,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Solved. A few notes on what went good, what went wrong:\n\nConsistency: symbols or numbers? Choose one, but don't mix it up. Right now it's in the middle, names are kind of important (constraints on distinct player names (that's not needed), but you're also asking for a numeric position in the output.\nMy suggestion: pick one or the other. Using numerics would make the validators' inputs a *lot* shorter. Using symbolics would also achieve consistency. But asking both for board position and name is redundant.\n\nTalking about the I/O format, it would fit a lot better within the platform if you relied on whitespace rather than commas. Your stub generator isn't able to reference all the variables you declare in the input section, that ought to be a hint. Remember that kind of parsing is the common denominator around here. You want your problem to be about Monopoly, not string management.\nSuggestion: replace input commas with newlines.\n\nYour output format considers visit and jail as the same place. Why not, but the original game (as well as your problem) handles both positions differently.\n\nYour rules section is quite hard to read. It helps that I've already implemented monopolies, so I mostly implemented the rules from memory instead of from them, but someone who never played it is going to have a harder time.\nSuggestions:\n- talk about normal movement first; then about doubles; then about what happens when you're in jail\n- don't talk about both \"turns spent\" and \"number of rolls\" in the same rule\n- don't use thte word \"backward\"\n\nIt looks as though you're aiming for standard boards. It would be helpful to go all the way through and actually specify that visit/jail is 10, gotojail is 30.\nSame with the board size, if it's always 40, don't make a variable out of it.\n\nAll words typeset as variables in your second paragraphs aren't variables in the end.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292129232000
  },
  {
    "commentId": 5864,
    "codingamerId": 154906,
    "commentableId": 3989924,
    "responseCount": 1,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 4062051,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Idea looks nice. I'll give it a go in the weekend.\n\nSide note (this concerns multiple of your puzzles, but I'm on this one now): please go easy on the typesetting. The bottom half of your statement is like a third of each color, and they're not really used in a way that's consistent with the rest of the site, let alone within the puzzle. IMHO, it doesn't help reading *at all*. Quite the opposite in fact.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292460185000
  },
  {
    "commentId": 5842,
    "codingamerId": 878974,
    "commentableId": 3989924,
    "responseCount": 3,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4058645,
    "userVoteValue": 0,
    "nickname": "nicola",
    "content": "Why not simplified game boards for the first test cases?\nFor example, no jail at all (and no double in the dice results of course) or shorter boards in order because beginners will be overwhelmed by the mass of exceptions in the rules.\nYou can also propose boards that are not copyrighted, for example CG puzzles, coding languages…",
    "codingamerHandle": "21bf42f790de293c3aef398f18cd2627479878",
    "onlineSince": 1770701591260,
    "avatar": 26090852120005,
    "elapsedTime": 292486323000
  },
  {
    "commentId": 5840,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 4057627,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "Got some troubles to describe rules, if something isn't clear, just leave a comment and/or edit the statement if you want to :)\n\nHope you'll enjoy it !",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292513396000
  },
  {
    "commentId": 5843,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5842,
    "votableId": 4059059,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "- I could do that for the first cases, but I stayed on the thought that the game board will be constant. That's why I also tried to create a simple case with double to understand how it will work in the exemple.\n- Is that a problem that I'm creating a puzzle about a copyrighted game board ? Well I mean, to use your idea, i could also create a CoC for a simple circular board, without jails and without doubles that could be created for any kind of boards. What do you think ?",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292480936000
  },
  {
    "commentId": 5865,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5864,
    "votableId": 4062080,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "I do agree about this lol, done that like at 1AM and i thought it was a good idea here, but in the IDE, i do agree about that doesn't help at all, will fix that now",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292460016000
  },
  {
    "commentId": 5960,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 4089893,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "Hi, thanks for your feedback :)\nI mostly edited the statement, but here's the recap in the text below :\n\n- Edited the output, you now need to print the player's name with the player's position, separated with a comma ','\n- Removed the sentence about \"distincts names\"\n- Replaced commas for dices casted into newlines\n- Clarified the rules section\n- Added a note about the Go To Jail and Visit Only / In Jail positions\n- Removed the stub variables on the statement (boardline, dices...)\n- Remove the \"40\" from the input for lines' numbers about the board lines\n\nSo i chose to not handle if the player is on the space In Jail or Visit Only. I consider in this puzzle that you need to print the latest position and not the player's state at the latest position (you need to handle that anyways)\nI also didn't understand why you disliked the word \"backwards\" ( I even don't know what word could replace it)",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292086883000
  },
  {
    "commentId": 5961,
    "codingamerId": 154906,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 4089907,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "What I meant about \"backwards\" is that you don't need it. When you go to jail, you don't go forward or backward to jail, you skip directly to jail (do not pass go, do not collect...). Adding a direction there is not needed, and makes it quite confusing if you happen to roll a third double when you're *before* jail.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 292086743000
  },
  {
    "commentId": 5962,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 4089921,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "Mmh okay i understand, i'm gonna remove it",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292086624000
  },
  {
    "commentId": 12779,
    "codingamerId": 1695697,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 8071731,
    "userVoteValue": 0,
    "content": "Did large-scale editing to the entire puzzle statement.\n\nChanged all inputs/outputs from comma-separated to space-separated.\n\nRenamed all test cases and validators.\n\nModified the first validator so that it is different from the test case.\n\nModified the first test case and validator to remove doubles (which should be tested later).\n\nModified the last test case and last validator to increase the number of dice rolls from 37 to 57 mainly for the purpose of including longer runs of doubles.\n\nAbout the long list of board position names... Really one can solve the puzzle without using those names (or even without reading them as inputs). I'm not sure about removing them from the inputs though, because they may be useful for debugging for some players (better \"visualisation\").",
    "codingamerHandle": "8b160497ff3badd8f07a3b709fac1c047965961",
    "elapsedTime": 241691045000
  },
  {
    "commentId": 12780,
    "codingamerId": 154906,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 8072305,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Great job!\n\nI've got a smaller-scale finishing edit to make (defer talking about jail/doubles interaction in the base rules until both have been seen), but apart from the little parsing changes, my code still works, so I'll likely approve right after.\n\nI suggest the following compromise for the position names: I'll comment in the I/O section that they're not needed to solve the puzzle.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 241683863000
  },
  {
    "commentId": 12781,
    "codingamerId": 1695697,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 8072362,
    "userVoteValue": 0,
    "content": "Yes, making such a comment is good.",
    "codingamerHandle": "8b160497ff3badd8f07a3b709fac1c047965961",
    "elapsedTime": 241683472000
  },
  {
    "commentId": 12783,
    "codingamerId": 154906,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5946,
    "votableId": 8072578,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "I've also upgraded the difficulty to Medium, on grounds that War is in medium and this is harder than War.",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 241681993000
  },
  {
    "commentId": 5851,
    "codingamerId": 878974,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5842,
    "votableId": 4060493,
    "userVoteValue": 0,
    "nickname": "nicola",
    "content": "The idea is not to overwhelm beginners with all the rules.\nThey might first code rule by rule to help them debugging.",
    "codingamerHandle": "21bf42f790de293c3aef398f18cd2627479878",
    "onlineSince": 1770701591260,
    "avatar": 26090852120005,
    "elapsedTime": 292470285000
  },
  {
    "commentId": 5852,
    "codingamerId": 1174714,
    "commentableId": 3989924,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 5842,
    "votableId": 4060751,
    "userVoteValue": 0,
    "nickname": "Shoko84",
    "content": "I understand what you mean, and that's why (except the exemple) all tests are in order of what you need to handle in the puzzle\n\nFor exemple: \"Simple test\" tests only a basic movement of the sum of dices, \"Around the board test\" what test above + one of all players did at least a lap, etc..\n\nSo honestly, I think \"that\" can be considered as a \"rule by rule\" coding + don't forget i'm going to do harder versions, so this version is for what you call beginners.",
    "codingamerHandle": "b23e9b2c3708c21e0a0221b1d6c0a9eb4174711",
    "avatar": 9552765056380,
    "elapsedTime": 292468475000
  }
]