[
  {
    "commentId": 226312,
    "codingamerId": 6132028,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 34295931,
    "userVoteValue": 0,
    "nickname": "NicknamedTwice",
    "content": "May I inquire about the methodology used in the development of your test cases? The intricate and sophisticated designs you have crafted are both aesthetically captivating and intellectually intriguing.",
    "codingamerHandle": "d2434fa80c97cbc8809e37d800f205eb8202316",
    "avatar": 136778820182751,
    "elapsedTime": 51281040000
  },
  {
    "commentId": 104062,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 28139877,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "✅ Approved the contribution.\nComment: Nice job! Plenty of comments below.",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 94577584000
  },
  {
    "commentId": 104050,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 9,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 28137337,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "Great puzzle! I found this puzzle very challenging and deserving of the \"Hard\" identifier. I learned a lot doing the puzzle, primarily due to the challenge of how to keep track of pieces that go together and I believe it is a strong contribution to the community.\n\nI do have one \"presentation\" suggestion that you are free to use or not. Your test case names are kind of long and wordy. I don't think it would hurt your puzzle at all if you shortened them and left out some of the detail of what makes each test case unique. As I was solving the puzzle, I didn't give any thought to what meaning the test case names were trying to convey. I would have no issue with names such as:\n\n2 x 2 Simple Pieces\n2 x 2 Harder Pieces   (maybe \"harder\" implies ambiguity and rotation?)\n\nI'll wait to submit my approval until you can share your thoughts on the test case names.",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 94591904000
  },
  {
    "commentId": 103887,
    "codingamerId": 4618693,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 28128808,
    "userVoteValue": 0,
    "nickname": "cedricdd",
    "content": "✅ Approved the contribution.\nComment: Enjoyed solving this puzzle.\nStatement is clear and difficulty level is adequate.",
    "codingamerHandle": "20f5f88d86185be4439fc7297df0aa073968164",
    "avatar": 85418008807758,
    "elapsedTime": 94661055000
  },
  {
    "commentId": 103424,
    "codingamerId": 1781409,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 28091126,
    "userVoteValue": 0,
    "nickname": "schubc",
    "content": "✅ Approved the contribution.\nComment: Nice",
    "codingamerHandle": "80f96c2d985efde5268251d447c80f0f9041871",
    "avatar": 12267390898127,
    "elapsedTime": 94871898000
  },
  {
    "commentId": 101804,
    "codingamerId": 2874091,
    "commentableId": 20870732,
    "responseCount": 5,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 27526760,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "All sections\n* Suggest to change [[pictureWitdh]] to [[pictureWidth]].\n\nGoal section\n* Suggest to change the first note as:\nWith the given assembling rules, you can determine that if the puzzle is composed of [[nColumns]] columns and [[nRows]] rows of pieces with size [[pieceSize]], then the final picture will have [[pictureWidth]] columns and [[pictureHeight]] rows of characters, where\n   • [[pictureWidth]] = {{1 + (}}[[pieceSize]] {{- 1) * }}[[nColumns]]\n   • [[pictureHeight]] = {{1 + (}}[[pieceSize]] {{- 1) * }}[[nRows]]\n\nConstraints section\n* I don't understand what this part means:\n\"(which also means that if two pieces have the same borders, then they have the same content)\"\n\nFor example, in \"15x15 simple pieces\" Test, many pieces have the same border (e.g. left border), yet they don't have the same contents.\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 95792168000
  },
  {
    "commentId": 101793,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 27524412,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Hi everyone,\nI currently don't have much time for Codingame. Yet I just remembered that I have this puzzle pending. Then I will finally not create other episodes, but I now offer you this puzzle for validation, in order not to waste the time spent on this puzzle.\nHope you will enjoy it !",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 95807305000
  },
  {
    "commentId": 56837,
    "codingamerId": 2671545,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 21426856,
    "userVoteValue": 0,
    "nickname": "CodinBot",
    "content": "I hope you received enough feedback from the community to improve your contribution. Once you have made the necessary updates, publish your contribution!",
    "codingamerHandle": "79ae4f668f3f26561f3408f3de3c13375451762",
    "avatar": 19333912201092,
    "elapsedTime": 129820343000
  },
  {
    "commentId": 56275,
    "codingamerId": 672359,
    "commentableId": 20870732,
    "responseCount": 3,
    "upVotes": 2,
    "downVotes": 0,
    "votableId": 21281171,
    "userVoteValue": 0,
    "nickname": "Lesmana",
    "content": "i like this puzzle. the general idea is easy to understand. if the pieces are actual paper pieces on a table it is easy to solve by hand. but it is (somewhat) hard to code. i am not sure if i agree with hard difficulty entirely. more on that later.\n\nhere some thoughts:\n\nthe description really needs work. there are spelling mistakes and the wording  is sometimes confusing or even wrong.\n\nthe input is confusing. pieceSize 4 means a piece is 4 by 4. you should state explicitly that the pieces are alway square. (it makes sense because they should be rotateable but state it anyway)\n\nnColumns and nRows refer to the number of pieces in the complete picture. having those two in the same line as pieceSize is really confusing.\n\npictureWitdh and pictureHeight is nice to have but ultimately redundant. because they can be inferred from nPieces and pieceSize. as you wrote yourself in the notes at the end of the description.\n\n\"Next pictureHeight lines\" is wrong. in the first example the pictureHeight is 7 but there are 16 lines. correct is \"Next pieceSize x nPieces lines\"\n\ni would arrange the input like follows:\n\nline 1: pieceSize and nPieces.\nline 2: nColumns and nRows\nNext pieceSize x nPieces lines ...\n\ndrop the Disambiguisation part of the description. instead rewrite it to state some guarantees. for example: there is always just one possible solution. the first piece is always in the correct orientation.\n\ni would change the border of the complete picture to some other strongly visible character. for example #. this changes little in the code (detect # instead of space) but it helps immensely for the human when inspecting the input and output.\n\ni think it is a good idea to make \"episodes\" of this puzzle. perhaps a medium episode without rotation. a hard episode with rotation. and a very hard episode with rotation and mirroring.\n\nanother difficulty variation idea: in the medium variant the border character (# as i suggested above) is guaranteed to only ever appear in the border. in the hard variant the border character might also appear anywhere else. yet the border is still guaranteed to be the border character. and in the very hard variant the border character is no longer guaranteed. (i would still write most test cases to have the strongly visible border character for the human to see. and just one or two test cases that have no unique border character.)",
    "codingamerHandle": "5a5f2939edab42600791aa8084f8ad0f953276",
    "avatar": 107843062966039,
    "elapsedTime": 130894123000
  },
  {
    "commentId": 56023,
    "codingamerId": 2121726,
    "commentableId": 20870732,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 21195453,
    "userVoteValue": 0,
    "nickname": "FoxLee",
    "content": "Matching a border is not hard.\nI feel it very hard to copy hundreds of lines from your test case input to my editor, and have to do it a dozen times.",
    "codingamerHandle": "853864aee672509387b3724e695bdc076271212",
    "avatar": 57728447113543,
    "elapsedTime": 131410518000
  },
  {
    "commentId": 55412,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 21037577,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Hi ! It seems like a \"classic\" puzzle to me, so I hope I didn't miss some already existing contribution.\nI suggested a solution using a brute-force algorithm. One may consider more efficient solutions using graphs for example in order to solve more complex test cases. But it seems the output is limited to 1000 characters :'( . Then I cannot put more complex and beautiful pictures...\nAlso, I can make some \"episodes\" for this puzzle by adding an easier one that has no piece rotation, and a more complex one which force us to use a smarter solution. But let's first see what you think about this one.\nThank you in advance for your feedback !",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 132414788000
  },
  {
    "commentId": 56024,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 56023,
    "votableId": 21195717,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "* \"Matching a border is not hard.\"\n> It is not only string comparison, it is also mapping, recursion for brute-forcing, manipulation of 2D arrays... If most of the people think it should be set as medium, I will do it, but I will wait for more opinions.\n* \"I feel it very hard to copy hundreds of lines from your test case input to my editor\"\n> It is not designed for that :p CodinGame will do the work for you: you know there is a button \"Test in IDE\" on the top-right corner of the page ? If you still want to use your own editor, I heard about a tool managing the synchronization between some editors and CodinGame, but I didn't catch up on that. Maybe you can ask on the Discord.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 131408726000
  },
  {
    "commentId": 56312,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 56275,
    "votableId": 21294426,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Thank you for your detailed feedback ! I will answer with along text too :p\n\n* the description really needs work. there are [...]\n> I corrected 2-3 mistakes, but I have the feeling that you found more ones. So feel free to edit if you want (and thank you in advance if you do so)\n\n* the input is confusing. pieceSize 4 means a piece is 4 by 4 [...]\n> Input edited !\n\n* nColumns and nRows refer to the number of pieces [...]\n> My input structure was:\nLine1: base values (pieceSize, nColumns, nRows)\nLine2: redundant values (nPieces, pictureWitdh, pictureHeight).\nBut since you think it is confusing, I split them into more lines.\n\n* pictureWitdh and pictureHeight is nice to have but [...]\n> I gave them as input because of the stub. It seems the stub cannot do computation.\n\n* \"Next pictureHeight lines\" is wrong. in the first example the [...]\n> You're right, correction made !\n\n* drop the Disambiguisation part of the description. instead [...]\n> I moved and shortened this part from the statement to the constraints.\n\n* i would change the border of the complete picture [...]\n> Done, I edited all the test cases.\n\n* i think it is a good idea to make \"episodes\" [...]\n> At the end of this WIP period, I will post two versions : with and without rotation.\nAccording to the difficulty you gave, I finally don't know if you consider this version (with rotation) as medium or hard...\nAbout a harder version:\n- I am not a big fan of mirroring. The structure of the solution will not change, it will only make us add new cases. And since it breaks the physics of a real puzzle, it does not worth it.\n- About ambiguous borders, it was already the case with the previous test cases, with borders as spaces. So the current brute-forcing solution would be enough for that.\n- I would like a harder version to force us to use graph theory (cycle detection for example). However the output size is limited. Then either I need to find small test cases which force us to use graphs or I need to change the output format so that we don't print the whole picture.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 130790767000
  },
  {
    "commentId": 101809,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 101804,
    "votableId": 27528229,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Thank you for your feedback ! Typo and goal section fixed.\nAbout the constraint, I added a small explanation. I will not explain you in order not to influence you, but maybe you can tell me if you understand what I mean this way.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 95782645000
  },
  {
    "commentId": 104057,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 28138462,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Hi, thank you for your feedback!\nThe names describe what the tests have in common and what differs. It enables the user to solve the puzzle \"step by step\" (by first not taking rotation into account, or not using backtracking when there is no ambiguity), and still check the appropriate tests for each step.\nHowever, you give me the idea to add a \"Tests description\" section, so that I can make the names of the tests simple while still allowing users to get the needed information. It was also the opportunity to add test \"comments\" :p\nHope you will like it this way!",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 94585600000
  },
  {
    "commentId": 104058,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 28138900,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "I admire your generosity! I would not give the Codingamer so many clues, but this is your puzzle and I do like your new idea better than the long test case names. Let's clean up a few grammar things in the new part and you are ready to go!\n\nPlease change \"Tests description:\" to \"Test Descriptions:\"\n\nIn Test 1 and Test 5, please remove the space between the word \"that\" and the question mark (?).",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 94582652000
  },
  {
    "commentId": 104059,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 28139046,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "By the way...my solution has no backtracking. I read the discussions you had last year and it looks like you have ideas for even harder puzzles. I haven't completely thought through what a harder puzzle might look like, but when I was coding my solution, I was thinking about the possibility of needing backtracking. In the end, I was kind of glad I didn't need to do any backtracking. So, what I'm saying is this. If you have more ideas for follow-on puzzles, I hope you find time to explore them because I like your work!",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 94581803000
  },
  {
    "commentId": 104061,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 28139649,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Thx for the review, typo fixed!\nI don't consider I give \"clues\", they are only \"parameters\" for me. No ambiguity and no rotation could be part of the rules (for simpler puzzle).\nAbout backtracking, if you test my solution, you will see I log a \"dead end\" count, which shows I need backtracking. But indeed, if you do \"smarter\" tests while placing each piece, you might make the right choice directly :p In this case, my tests are certainly not hard enough. But like I said (in my very first comment), unfortunately, I am limited to 1000 characters in the ouput... (And now I have less time than before)",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 94578806000
  },
  {
    "commentId": 324412,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 36195882,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "I have revisited this puzzle and I am adding it to my recently-published Algorithm X playground. I have a new question. Why do you say \"a bit\" of ambiguity for test case 3 and test case 7? I am not able to find any ambiguity for those test cases.",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 33425562000
  },
  {
    "commentId": 324478,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 36196614,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Hello Timinator,\nOh I see indeed that you are very motivated with your playground!\nWell, about the ambiguity, I trusted the value \"deadends\". I print it in the provided solution (you can test it yourself, also, I just changed the solution to not stop when a solution is found but really search all dead ends). But it really depends on your algorithm.\nIn fact, with my dummy algorithm, there is always some ambiguity because I start with the top left corner first without knowing which of the four corners to put. That is only when I encounter the first well-oriented piece that I know if I am right or if I have to backtrack to the beginning and test another corner.\nYet I encounter more than 3 dead ends (for each bad global orientation) with the test 3/7. Indeed it is strange at first. Then I debugged by dumping the dead-end states, and in fact it is because the global shape is not a square. In this case, when I start building the picture with a 90° angle, I try to put global border (with \"######\") in the middle of the puzzle, and then many pieces have that same \"######\" border, then it brings even more ambiguity (that is because in the rule I didn't say a \"######\" border is *necessarily* a border of the whole picture.\nFinally, the need for backtracking depends on your remaining reasoning. How did you avoid the ambiguity for the global orientation? Do you start building pieces around the first given one (with correct orientation) instead of a corner?",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 33417686000
  },
  {
    "commentId": 324481,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 36196717,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "I am working on my write-up for my playground right now. I will send it to you when I am finished. In my original solution, from two years ago, I \"build\" the puzzle piece by piece. I do not do that anymore. Now ,I follow a process of logical candidate reduction, the same way I propose handling logic puzzles like Sudoku.\n\nTo me, the ambiguity comes from two or more pieces being identical. It is ambiguous as to which piece belongs in which location since they can all be switched with each other. This type of ambiguity only happens in test case 4 and 8.",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 33416412000
  },
  {
    "commentId": 324808,
    "codingamerId": 4337092,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 36203791,
    "userVoteValue": 0,
    "nickname": "Timinator",
    "content": "Here you go:\n\nhttps://www.codingame.com/playgrounds/156252/algorithm-x/picture-puzzle",
    "codingamerHandle": "2df7157da821f39bbf6b36efae1568142907334",
    "avatar": 87736728529732,
    "elapsedTime": 33339236000
  },
  {
    "commentId": 325006,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 104050,
    "votableId": 36206217,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Happy to be part of your playground! :p\nAbout ambiguity, I consider fully identical pieces (like in test 4) doesn't result in any ambiguity, because in this case, whatever the choice we do between the identical pieces, we will not need to backtrack to choose another identical piece. I consider the ambiguity occurs when some borders are identical but not all. In this case, backtracking is necessary (when there very few logic) to choose between the pieces when the ambiguous border is encountered.\nFinally, please note that if you are motivated in having more challenging picture puzzles that would require smarter algorithms and challenge Algorithm X, I would be happy to let you create such CodinGame puzzle! I said when I created this puzzle that unfortunately we are limited to 1000 characters in output, then picture size is limited. To solve this issue, two solutions:\n- Either consider only printing in output piece id+orientation instead of the ascii picture. Advantage: more compact then we can have more pieces. Drawback: the user will not be forced to see the beautiful pictures + we are still limited in size.\n- Or build a solo game. Advantages: No limit in output size + the referee can test among multiple solutions if any + we can use real pictures! Drawback: more work to do ^^'",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 33312298000
  },
  {
    "commentId": 101861,
    "codingamerId": 2874091,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 101804,
    "votableId": 27530135,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Thank you!\n\nI'm still not sure... Do you mean \"if two pieces SHARE the same BORDER, then the BORDER characters will be the same\"?",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 95754448000
  },
  {
    "commentId": 101869,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 101804,
    "votableId": 27531152,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "No, you still didn't get it :'(\nWell, I added an example now, then I think I cannot make it more clear. Also I moved the explanation to the \"Guarantees\" section in order to keep the \"Constraints\" section concise.\nActually, this rule is valid only when pieces have a minimal size of 3x3. I imagine that is why you didn't get it considering the \"15x15 simple pieces\" example.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 95740989000
  },
  {
    "commentId": 101871,
    "codingamerId": 2874091,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 101804,
    "votableId": 27531308,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Ah, I was confused because I didn't expect there could be more than one of the same piece. Maybe that needs to be highlighted?",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 95739632000
  },
  {
    "commentId": 101874,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 101804,
    "votableId": 27531441,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "Indeed, it's done. Also I moved again the explanation into \"Notes\" since it is no longer a guarantee/constraint.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 95738578000
  },
  {
    "commentId": 56380,
    "codingamerId": 672359,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 56275,
    "votableId": 21312903,
    "userVoteValue": 0,
    "nickname": "Lesmana",
    "content": "i have edited the text. i tried to keep my changes minimal as to not change your style of writing. it is your puzzle after all.\n\ni changed the example in the description to also have the border character #.\n\ni also changed the first piece to have the correct orientation. it is guaranteed that the first given piece is always in the correct rotation. i think it is better to also have the first piece in the example in the correct rotation. just for consistency.\n\nabout the difficulty: i did some thinking. in the end, whether there is rotation or not, border character or not, it boils down to a backtracking algorithm. so the main difficulty is to implement this backtracking. once the backtracking is done there is only minor change in difficulty for added rotation or border character. so i take back my suggestion for episodes in medium or hard difficulty based on rotation or not.\n\nmore about the difficulty:\n\nsee the very hard puzzle \"squares order\". https://www.codingame.com/training/expert/squares-order\n\nin that puzzle the main difficulty is also implementing the backtracking (and the constraints to keep the tree short and the branching low). so if that puzzle is very hard, i think your puzzle also qualifies for very hard.",
    "codingamerHandle": "5a5f2939edab42600791aa8084f8ad0f953276",
    "avatar": 107843062966039,
    "elapsedTime": 130674846000
  },
  {
    "commentId": 56409,
    "codingamerId": 4451820,
    "commentableId": 20870732,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 56275,
    "votableId": 21325732,
    "userVoteValue": 0,
    "nickname": "Teiglin",
    "content": "* i have edited the text. [...]\n> Thank you again ! I see you also added a \"Guarantees\" part. I don't know if you were aware that I had already wrote it in the Constraints section. But anyway, let's put it twice.\n\n* i changed the example [...]. i also changed the first piece [...]\n> Indeed it enables to see better how the pieces are put together. Yet I think it could give the feeling that the assembly rule is less global than it is. But the visual aspect is what matters the most :p Anyway, the example of the test case shows how global are the rules.\n\n* in that puzzle the main difficulty is also implementing the backtracking\n> Here I want to say that it is this \"squares order\" puzzle that should not be \"very hard\". Using operations research, one can be confronted to much more complex puzzles than backtracking. Then as I said to FowLee (who considers this puzzle easier than hard), I will wait for more opinions before changing the difficulty.\n\n* About the difficulty: i did some thinking. in the end, [...]\n> That is why I think the best way to change difficulty is by using other things than backtracking. A very hard puzzle would be to assemble pieces using operations research (graphs). Also, I think an episode with medium difficulty could be to remove the ambiguity (two identical borders are necessarily side by side) so that backtracking is no longer needed.",
    "codingamerHandle": "a2479be594111a93820fb21d274e6d710281544",
    "avatar": 75444428976198,
    "elapsedTime": 130599388000
  }
]