[
  {
    "commentId": 33221,
    "codingamerId": 1616900,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 15357100,
    "userVoteValue": 0,
    "nickname": "Carlos Souza",
    "content": "✅ Approved the contribution.\nComment: I didn't know the solution, but I could solve by brute force.",
    "codingamerHandle": "b6e84db56349f182db4996afd456b6e20096161",
    "avatar": 25869843462038,
    "elapsedTime": 168043850000
  },
  {
    "commentId": 33194,
    "codingamerId": 2341954,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 15343724,
    "userVoteValue": 0,
    "nickname": "BetaCorn",
    "content": "✅ Approved the contribution.\nComment: This a simple clash of code which is very interesting.\nSuitable for rapidity",
    "codingamerHandle": "d17b0c8007fb0413a7f7895664117e7d4591432",
    "avatar": 77239068916081,
    "elapsedTime": 168139048000
  },
  {
    "commentId": 33077,
    "codingamerId": 3365379,
    "commentableId": 15210351,
    "responseCount": 6,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 15310078,
    "userVoteValue": 0,
    "nickname": "Skwerl23",
    "content": "Following your directions gets me most the answers. However 7,8,9,10,17, and 18 all fail.\n\nI don't know if it's the clarity of the question, but i'm having issues.\n\nfor example 7 = 169/421\n169%421 != 0 so don't print 0\n421 % (169 * 169 - 169) != 0 so don't print 1\nthus else: print -1\n\nalso flipping it gets me no where either.\n\n(169*169-169) % 421 != 0\n(421*421-421) % 169 != 0\n421%169 != 0 \n\n\nALSO where does B come from? Your explanation is unhelpful. I am now looking up legendre symbols to see what the formulas are.",
    "codingamerHandle": "61fe1c20b13cd887b8fbae0c7d85a7ea9735633",
    "avatar": 29390067652833,
    "elapsedTime": 168446258000
  },
  {
    "commentId": 33047,
    "codingamerId": 2387233,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 15301241,
    "userVoteValue": 0,
    "nickname": "SinOfWrath",
    "content": "✅ Approved the contribution.\nComment: Very well defined. The standard solution requires almost no mathematical knowledge after reading the statement and coding that takes at most a few minutes. Tests cases cover everything (10 of them!) and validators match. As a big plus the author was responsive made quick cmall changes.",
    "codingamerHandle": "c52068985d3835317974dc0dad47019a3327832",
    "avatar": 41207346605394,
    "elapsedTime": 168502401000
  },
  {
    "commentId": 33021,
    "codingamerId": 2387233,
    "commentableId": 15210351,
    "responseCount": 4,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 15295106,
    "userVoteValue": 0,
    "nickname": "SinOfWrath",
    "content": "You should have an upper bound on at least \"p\" but probably \"a\" as well, even though because the modulus \"a\" can be considered less than p.\n\nJust for safety you should add somewhere that p is guaranteed to be a prime number, no need to check it.",
    "codingamerHandle": "c52068985d3835317974dc0dad47019a3327832",
    "avatar": 41207346605394,
    "elapsedTime": 168555483000
  },
  {
    "commentId": 33023,
    "codingamerId": 4003289,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 33021,
    "votableId": 15295375,
    "userVoteValue": 0,
    "nickname": "halworsen",
    "content": "Ah, I haven't written tests where a > p when the symbol is 1! That's an oversight, but I think allowing a > p is important because if a < p the symbol cannot be 0.\n\nI don't really think providing an upper bound on p changes the problem in any meaningful way. The only different approach I can imagine knowing p is bounded is to run the squaring loop up to the upper bound. Feel free to tell me if I'm missing something here.\n\nThe input instructions explicitly state that p is an odd prime number, but I can write it in the problem statement and constraints as well.",
    "codingamerHandle": "6d11a984683a4ee1ff9378ca7dd24c799823004",
    "avatar": 51319349421787,
    "elapsedTime": 168553943000
  },
  {
    "commentId": 33078,
    "codingamerId": 3365379,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15310199,
    "userVoteValue": 0,
    "nickname": "Skwerl23",
    "content": "ok looking at your solution i THINK i get it.\nfor i in range(p+1):\n    if a%p == (i*i)%p: print(1);exit(0)\n\nthis loop says if we can find a square that equals \"a\" or if we can find a multiple of \"a\" that divides evenly basically. Which is not in any way how you explain it. I think the confusion comes from \n\n(1/13) = 1 because 1*1-1 (every number divides 0)\n\nit might be better to use 6/19 as that example.\n(6/19) = 1 because in array [1 through 19], 5*5 = 25 and 25%19 = 6%19\nor possibly\n(6/19) = 1 because b²-6/19 is possible. b is <= 19\n\nIf the instructions were clearer, this is an amazing clash of code challenge.",
    "codingamerHandle": "61fe1c20b13cd887b8fbae0c7d85a7ea9735633",
    "avatar": 29390067652833,
    "elapsedTime": 168445289000
  },
  {
    "commentId": 33079,
    "codingamerId": 4003289,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15310320,
    "userVoteValue": 0,
    "nickname": "halworsen",
    "content": "Doing test 7 step by step:\n169 % 421 = 169 != 0. So 421 doesn't divide 169, and the symbol isn't 0.\n\nNow that we know p doesn't divide a, we have to find out if a is a square modulo p or not.\n\n\"a is a square modulo p\" means that b² - a is divisible by p for some number b. So if we can find a b such that b² - a % p = 0, a is a square modulo p. If we can't, a is not a square.\n\nSpecifically for test 7, we can find that 13² - 169 % 421 = 169 - 169 % 421 = 0. So a is a square modulo 421 and its square root is 13. So the Legendre symbol (169 / 421) is 1.\n\nTo make it clear why this is not a normal \"find the square root problem\", look at case 17: (536 / 229)\n536 % 229 = 78 != 0, so 229 does not divide 536 and the symbol isn't 0.\n\nBut now, the normal square root of 536 is not a whole number, it's 23.151... but 536 is in fact a square modulo 229 because 41² % 229 = 536. So 536 is a square modulo 229, and its square root (modulo 229) is 41.\n\nI think you're confused by what b is. It's probably my fault, formal definitions are a bit tough to get. These are all the same way of expressing \"a is a square modulo p\". Please let me know if any of these make the problem easier to understand:\n\n\"you can find an integer b such that b² - a is divisible by p\"\n\"you can find an integer b such that b² mod p = a mod p\"\n\"p divides b² - a for some integer b\"",
    "codingamerHandle": "6d11a984683a4ee1ff9378ca7dd24c799823004",
    "avatar": 51319349421787,
    "elapsedTime": 168444024000
  },
  {
    "commentId": 33080,
    "codingamerId": 3365379,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15310336,
    "userVoteValue": 0,
    "nickname": "Skwerl23",
    "content": "All i'm saying is that i had to do outside research to understand this problem. Thank you for the help\nI am definitely on this site to learn, but his examples through me off.",
    "codingamerHandle": "61fe1c20b13cd887b8fbae0c7d85a7ea9735633",
    "avatar": 29390067652833,
    "elapsedTime": 168443831000
  },
  {
    "commentId": 33081,
    "codingamerId": 4003289,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15310377,
    "userVoteValue": 0,
    "nickname": "halworsen",
    "content": "Didn't see your reply while writing mine. I can update the (1/13) example to be a less trivial one.",
    "codingamerHandle": "6d11a984683a4ee1ff9378ca7dd24c799823004",
    "avatar": 51319349421787,
    "elapsedTime": 168443362000
  },
  {
    "commentId": 33118,
    "codingamerId": 3365379,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15318122,
    "userVoteValue": 0,
    "nickname": "Skwerl23",
    "content": "Thank you for that. I think it could be a bit better. But it's less confusing as 1 is. That being said not everyone on here has a great grasp of obscure mathematics. I have fun solving these problems. But sometimes I just have to research a lot to understand it. Lol.",
    "codingamerHandle": "61fe1c20b13cd887b8fbae0c7d85a7ea9735633",
    "avatar": 29390067652833,
    "elapsedTime": 168369406000
  },
  {
    "commentId": 33206,
    "codingamerId": 2387233,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33077,
    "votableId": 15348887,
    "userVoteValue": 0,
    "nickname": "SinOfWrath",
    "content": "This is from the description\n\"1 if a is a square modulo p (in other words, if you can find an integer b such that p divides b² - a)\"\n\nIt says that \"if you can find b\", so your whole task for this CoC is to check whether such b exists or not. The definition itself is the whole algorithm.\n\nDon't get me wrong because I have a degree in math so obviously have a huge advantage over the average player in this game, but that's why I left so many comments on how to make this more available to everyone (not that it was bad in the first place). With that said, I'm interested if we do a \"reverse engineering\": would you (based on your solution and spending a little more time on the highlighted sentence and how it describes the steps you have to make) be able to understand the task better?\n\nAlso @halworsen, if in the provided solution you change n to b, probably people will have a higher chance of understanding it in the future.",
    "codingamerHandle": "c52068985d3835317974dc0dad47019a3327832",
    "avatar": 41207346605394,
    "elapsedTime": 168109831000
  },
  {
    "commentId": 33040,
    "codingamerId": 2387233,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 33021,
    "votableId": 15298334,
    "userVoteValue": 0,
    "nickname": "SinOfWrath",
    "content": "Very clearly you need the a>p case.\n\nMy justification for writing p is always a prime (thanks for adding it) is because newer players might feel like they should check it's primeness without thinking it through.\n\nWith that said whenever I see a Python solution I immediately have worries because (seemingly) everyone coding in Python forgets that most other languages have upper bounds on different number types. I cannot tell you how many times I've became 2nd place on less than 5 seconds because I had to redactor every int to be long because the last test case was slighltly higher than the problem originally suggested. Even worse when all of them are small I always fear one of the validators will fail.\n\nBut to more on the point in why to add the upper bound constraint is the fact that this level of number theory is not common in CS degrees. So if you fell in the pitfall of trying to look up how to determine the value of the Legendre symbol you lose a lot of time for google-ing for a solution. If I recall correctly from 13 years ago when I've last seen Legendre symbols the brute-force solution is the \"only\" way as half of the numbers are squares exactly and the distribution is unknown.\n\nYou can always set the limit of p <= 2357 which is a prime number and the concatenation of the first 4 primes. It doesn't matter just for fun. Also it helps people realize that the brute force solution won't time out.\n\nI really like your statement, I've two very small comments:\n* b² ≡ a (mod p) is not a commonly known notation, unless you learnt higher mathematics, so I suggest addin after this \"i.e. p divides b² - a\".\n* The example for 0 suites better in front of the example for 1 to mimic the order of the definition.\n\nAlso a lot of people only scan through text real fast so if you add in Input\nLine 1: a - A positive integer\nthat is a great help for them, even though it's clear from the contraints.\n\nBut yet again, I like this very much and I think it suites a 5 min clash.",
    "codingamerHandle": "c52068985d3835317974dc0dad47019a3327832",
    "avatar": 41207346605394,
    "elapsedTime": 168537524000
  },
  {
    "commentId": 33042,
    "codingamerId": 4003289,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 33021,
    "votableId": 15298838,
    "userVoteValue": 0,
    "nickname": "halworsen",
    "content": "Thanks, that was a far more thorough and well-reflected answer than I was ever expecting.\n\nThe type argument is good, I rarely work with statically typed languages so it's usually not something I think about. I also didn't know 2357 is a prime, that's really cool and it /would/ be a pretty fun limit.\n\nThinking back, the earliest CS course where I saw the congruence notation was in discrete mathematics, so it would make sense that some people don't know it. Keeping that in mind \"p divides b² - a\" should be more accessible.\n\nThe rest of the suggestions for the statement are good, too. I'll make the changes. Thanks for the quality feedback, I appreciate it.",
    "codingamerHandle": "6d11a984683a4ee1ff9378ca7dd24c799823004",
    "avatar": 51319349421787,
    "elapsedTime": 168532882000
  },
  {
    "commentId": 33049,
    "codingamerId": 2387233,
    "commentableId": 15210351,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 33021,
    "votableId": 15301321,
    "userVoteValue": 0,
    "nickname": "SinOfWrath",
    "content": "With that said, I can't see any reason not to approve it.\n\nAlso as one engineer to another, if this was a CR process I would note that in your solution, on line 10, the range can be 1 ,,, p/2 (inclusive both, I don't know Python enough), as n² ≡ (p-n)² (mod p), which cuts runtime in half. For codegolf it's an unnecessary extra two chars, I do see that.",
    "codingamerHandle": "c52068985d3835317974dc0dad47019a3327832",
    "avatar": 41207346605394,
    "elapsedTime": 168501962000
  }
]