[
  {
    "commentId": 381470,
    "codingamerId": 3302714,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 37253142,
    "userVoteValue": 0,
    "nickname": "AmYre",
    "content": "✅ Approved the contribution.\nComment: On perçois qu'il y a eu beaucoup de travail réalisé pour réaliser ce clash",
    "codingamerHandle": "6ecd352bb3559226e2020b496b4c63934172033",
    "avatar": 116974828233732,
    "elapsedTime": 22165502000
  },
  {
    "commentId": 381371,
    "codingamerId": 5778836,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 37251814,
    "userVoteValue": 0,
    "nickname": "padawan90",
    "content": "✅ Approved the contribution.\nComment: The proposed CoC is interesting and probably achievable in the given time  (I was able to pass the tests). However, having a basic understanding of derivatives will probably be of great help.",
    "codingamerHandle": "6adf30278181cd340a5e6ca3a62cb7c36388775",
    "avatar": 125119029378508,
    "elapsedTime": 22179509000
  },
  {
    "commentId": 379893,
    "codingamerId": 5511536,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 37227402,
    "userVoteValue": 0,
    "nickname": "EnderBox",
    "content": "✅ Approved the contribution.\nComment: The problem is quite simple, straightforward, and easy to understand. With good knowledge on programming syntax, it can definitely be solved within the time frame of a CoC.",
    "codingamerHandle": "00868a57e63d21dc8c267a6b2888baa86351155",
    "avatar": 144564965384074,
    "elapsedTime": 22455907000
  },
  {
    "commentId": 374343,
    "codingamerId": 6630787,
    "commentableId": 36669647,
    "responseCount": 4,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 37131715,
    "userVoteValue": 0,
    "nickname": "asuno",
    "content": "great puzzle once i figured it out, but i have issues id like to ask about before approving.\n\n1st. the statement given is honestly a bit confusing, im concerned not everybody will be able to understand what they have to do here and will simply quit the clash before even attempting this.\n\n2nd. when the powers are negative i had to use the rounding function (i use python)  as it was giving me float type values in the output, this would make sense as per my understanding putting x to a negative power is like telling it to make it a divisor instead e.g. x^(-2) would be the same as 1/(x^2), if im not wrong in this then maybe outline in your output section that the output of the last line should always be an integer and not a floating value, or that it should be rounded to the nearest integer value",
    "codingamerHandle": "0bcfb1efd610e6d0b94a93a7380b15877870366",
    "avatar": 143700443993214,
    "elapsedTime": 23544890000
  },
  {
    "commentId": 372922,
    "codingamerId": 5050790,
    "commentableId": 36669647,
    "responseCount": 1,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 37109057,
    "userVoteValue": 0,
    "nickname": "PRabid",
    "content": "The mathematical terminology could be more precise:\ncalculate the derivative of a function -> calculate the derivative of a polynomial function\ncompute the ... at a given x-value  -> evaluate the ... at a given x-value\n\nIn the goal, you gave \"f(x) = ... \" but \"f'(x) can be expressed as...\".  Why not \"f'(x) = ... \" for consistency?\n\nYou explain what a coefficient is, but assume that the reader will know what is meant by the \"number of terms\".  Maybe explain everything or nothing, depending on what level of background you are assuming.  It helps that the example matches Test Case 1.\n\nConstraints say pow != 0, but it is for the constant term.\n\nThe display of superscripts is not consistent for some reason.  In the goal statement x ^(n-1) looks like x^n^(-1)",
    "codingamerHandle": "d3edf60799613712f8ecd4a3fdd97dd00970505",
    "avatar": 89394021626021,
    "elapsedTime": 23803856000
  },
  {
    "commentId": 358271,
    "codingamerId": 2874091,
    "commentableId": 36669647,
    "responseCount": 3,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 36832376,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Goal\n* \"The aim of the problem is to calculate the derivative of a function f'(x) using the power rule and linearity rule.\": The sentence mixes up f(x) and f'(x). Please remove \"f'(x)\" from this sentence.\n\n* The problem statement is lengthy for a clash of code and contains repetition. Consider simplifying by\n\n  • removing the introductory paragraph\n  • omitting the detailed input descriptions (Input section already covers this)\n  • deleting the notes (see below for a remark on Note 1; Note 2 is redundant with Input section)\n  • dropping the final sentence; instead you can add \"(corresponding to Test Case 1)\" to the heading \"EXAMPLE\"\n\nOutput\n* The phrase \"term 0\" in the original Note 1 may be unclear. It should be sufficient to state in Output section that only terms with non-zero coefficients should be included.\n\n* Consider using one line per term in the output, mirroring the input format for consistency and readability.\n\nConstraints\n* Last constraint: Please format \"N\" and \"pow\" as [[variables]].\n\nStub generator\n* Please add a write statement.\n\nGeneral\n* There's another clash on differentiation (see https://www.codingame.com/contribute/view/9243663676e3cb63a1c7114cb5a00fc565f ), but the greater difficulty and format differences here should justify this being as a separate clash. You might also take note of the brevity of that statement as a reference.\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 26630868000
  },
  {
    "commentId": 358372,
    "codingamerId": 4654202,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 358271,
    "votableId": 36835212,
    "userVoteValue": 0,
    "nickname": "ethaneCH3CH3",
    "content": "Thank you for your valuable and detailed feedback. \n\nI’ll certainly work on shortening the statement as you mentioned your feedback that some of it is unnecessary and redundant. \n\nI’ll also fix my minor mistakes in the constrain and the stub generator, as well as some other issues you mentioned. \n\nThanks again for your time and I really appreciate it.",
    "codingamerHandle": "e934c55b792f348170e1a609db3f706c2024564",
    "avatar": 79778741456399,
    "elapsedTime": 26613516000
  },
  {
    "commentId": 373054,
    "codingamerId": 4654202,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 372922,
    "votableId": 37110647,
    "userVoteValue": 0,
    "nickname": "ethaneCH3CH3",
    "content": "Thank you for your detailed feedback. \n\nUnfortunately, regarding the superscript of (n-1), I tried multiple superscript generator and they gave me the same result. \n\nThe constraint states that for N=1 the power of the term will not be 0. As a derivative of a constant will be 0 and I specifically asked the coders not to include terms with zero coefficent, I’ll not be making a test case to ask them to return 0. \n\nI believe “number of terms” is quite self-explanatory so I didn’t add an explanation for it. However, if you believe other coders will have difficulty understanding it I will put an explanation about that. \n\nI’ll fix the terminology and the equation mentioned in the first and second paragraph of your comment. \n\nThank you once again for your detailed comment. If you managed to find a way to fix the superscript please let me know and I’ll fix it right away.\n\nEdit 1: Regarding the explanation for “number of terms”, I had included what a “term” is in the last paragraph in the statement section so I believe the explanation is sufficient. However, if you think there’s a need to add an explanation for “number of terms” I’m happy to do that.",
    "codingamerHandle": "e934c55b792f348170e1a609db3f706c2024564",
    "avatar": 79778741456399,
    "elapsedTime": 23774482000
  },
  {
    "commentId": 374506,
    "codingamerId": 4654202,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 374343,
    "votableId": 37133598,
    "userVoteValue": 0,
    "nickname": "ethaneCH3CH3",
    "content": "Thank you for your feedback. \n\nWould you be able to tell me what section of the statement is confusing so I can adjust the statement slightly to make it a little bit more clearer. \n\nAlso, there is no need to use the rounding function when dealing with negative numbers. Please check my solution at the very bottom of this clash. You are correct that x^-2 is the same as 1/x^2. If you still have your code, feel free to show it to me and I’m more than happy to help. \n\nCheers for your time and feedback.",
    "codingamerHandle": "e934c55b792f348170e1a609db3f706c2024564",
    "avatar": 79778741456399,
    "elapsedTime": 23515875000
  },
  {
    "commentId": 375661,
    "codingamerId": 6630787,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 374343,
    "votableId": 37151805,
    "userVoteValue": 0,
    "nickname": "asuno",
    "content": "i've closed the tab with the code so i no longer have it but i read through the description again and the only problem i really have with it is how wordy it is, i understand the need to use mathematic terminology but what im mainly looking out for is if non math inclined people are doing this problem they might take too long trying to understand what they actually have to do and use up more of the 15 minutes given then they need to, im lucky enough to be doing calculus at school all day long so i understand what it is you want but the main concern is if people don't understand.\n\none way i could think the input could change would maybe be putting it as 1x4 or 1x^4, this would make it a bit more readable what the inputs are giving you because i remember needing to constantly scroll up to the explanation to see what the given inputs were",
    "codingamerHandle": "0bcfb1efd610e6d0b94a93a7380b15877870366",
    "avatar": 143700443993214,
    "elapsedTime": 23331172000
  },
  {
    "commentId": 375662,
    "codingamerId": 6630787,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 374343,
    "votableId": 37151816,
    "userVoteValue": 0,
    "nickname": "asuno",
    "content": "i opened the tab up again and heres the code\n\nn = int(input())\nx_value = int(input())\nnum=0\nfor i in range(n):\n    coeff, _pow = [int(j) for j in input().split()]\n    if (_pow)!=0:\n        print(str(coeff*_pow)+\" \"+str(_pow-1))\n        num+=((coeff*_pow)*x_value**(_pow-1))\n\nprint(round(num))",
    "codingamerHandle": "0bcfb1efd610e6d0b94a93a7380b15877870366",
    "avatar": 143700443993214,
    "elapsedTime": 23331079000
  },
  {
    "commentId": 375869,
    "codingamerId": 4654202,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 374343,
    "votableId": 37155672,
    "userVoteValue": 0,
    "nickname": "ethaneCH3CH3",
    "content": "Thank you for providing your code. I realised I had made an error on my end. I will fix my statement in a minute. \n\nMy statement might look long but it's because I have provided an example to explain the process of differentiation. \n\nThe reason I have the input and output in this way is to save the coders time extracting the input. I am pretty sure the example has already explained it quite well. Could you please tell me which section of my statement needs a little more explanation? \n\nThank you once again for your time and feedback!",
    "codingamerHandle": "e934c55b792f348170e1a609db3f706c2024564",
    "avatar": 79778741456399,
    "elapsedTime": 23297823000
  },
  {
    "commentId": 358963,
    "codingamerId": 4654202,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 358271,
    "votableId": 36852670,
    "userVoteValue": 0,
    "nickname": "ethaneCH3CH3",
    "content": "I have made some changes to my CoC and shortened the statement. \n\nI have also asked the coder to calculate the instantaneous rate of change at a given x value in line 2 of the input. \n\nIf possible would you be able to review it again? Thank you!",
    "codingamerHandle": "e934c55b792f348170e1a609db3f706c2024564",
    "avatar": 79778741456399,
    "elapsedTime": 26501944000
  },
  {
    "commentId": 358996,
    "codingamerId": 2874091,
    "commentableId": 36669647,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 358271,
    "votableId": 36853752,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "No problem. Below are my comments on the updated version:\n\nOutput\n* For simplicity, you may change \"First M lines\" to \"A number of lines\", and \"Line M + 1\" to \"Last line\". After that, the constraints \"M = N\" and \"M = N - 1\" may be removed.\n\nCases\n* Please revise the last pair of cases so that the absolute value of any intermediate result would not exceed (2 ^ 64). The reason is that not all programming languages available on CG are able to handle arbitrarily large numbers.\n\nStub generator\n* There seem to be too many details/hints for Reverse mode. Please either revise the stub or disable Reverse mode. (In case there was misunderstanding, when I mentioned that a write statement should be added, I merely meant adding a line such as \"write derivative\" or \"write answer\" instead of whole sections of STATEMENT, INPUT and OUTPUT.)\n\nGeneral\n* I'm not so sure about having essentially two problems in one clash of code, but I'll leave others and you to decide whether this is ok or too complex. (As mentioned before, there is a clash of code which asks players to output the derivative of a function. I think there also exists a clash of code or two where the players are provided the value of a variable and asked to calculate the value of a polynomial function in that variable.)\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 26495346000
  }
]