[
  {
    "commentId": 481888,
    "codingamerId": 2874091,
    "commentableId": 38809330,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 38976774,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Binary output issue\n* According to the contribution guidelines, binary outputs should be avoided for clashes. That's exactly the issue with your clash, as it allows only two possible answers (either \"Legal\" or \"Not legal\"). Please modify the output requirement to allow for more than two possible answers.\n\n* One possible way to address this is to require the player to output the first invalid rank when the board is illegal. If this approach is adopted, the statement must clearly clarify what constitutes a rank when a board is malformed. Maybe simplify the cases to be *always* illegal.\n\nGame modes\n* Consider disabling the Reverse mode, as it's difficult to infer the rules from visible test cases, especially for players with little or no chess knowledge.\n\nGoal\n* The word \"chess\" should appear at the very beginning to clearly establish the theme.\n\n* Please format \"/\" (the rank separator) as a {{constant}}.\n\n* Several chess-specific definitions are currently missing and should be added:\n\n  • The dimensions of a chessboard\n\n  • The definition of a rank\n\n  • FEN is a way of notation (Note: \"FEN\", not \"fen\". Alternatively, you may omit the term and explain its rules only.)\n\n* Consider replacing the term \"space\" with \"empty square\" to avoid its misinterpretation as the space character.\n\n* The list of legal piece characters should appear before the example, not after it.\n\n* The FEN notation should be explained more thoroughly, including but not limited to:\n\n  • How empty squares are represented\n\n  • Can digits appear consecutively\n\n  • Which characters are invalid (including space characters)\n\n* The example contains imprecise wording. \"3 space is there\" and \"2 space is there\" suggest that \"3 space\" and \"2 space\" are pieces. This is further compounded by the statement that there are 8 pieces on the rank, whereas the example actually contains 3 pieces and 5 empty squares.\n\nCases\n* While some tests and their corresponding validators address similar scenarios, they should be separated into distinct pairs because of their distinct fundamental features. For example,\n\n  • \"8 on each rank\": The test covers a rank with 9 empty squares (too many), while its validator covers a rank with 7 empty squares (too few).\n\n  • \"number of ranks\": The test covers a board with only 7 valid ranks, while its validator uses a board with only a single slash. These are very different cases.\n\n  • \"spaces\": The test includes a single space character at the beginning of a rank, whereas its validator includes a single slash followed by multiple space characters. These are very different cases.\n\nPlease ensure each test and its validator are more similar.\n\n* \"Mixed number/pieces\" (test and validator) don't cover the same scenario.\n\n* \"full board\" (the last test) and \"Full but not board\" (the last validator) don't cover the same scenario.\n\n(reached character limit)",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770722470459,
    "avatar": 134264063920528,
    "elapsedTime": 2250894000
  },
  {
    "commentId": 481789,
    "codingamerId": 6098968,
    "commentableId": 38809330,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 38976199,
    "userVoteValue": 0,
    "nickname": "APenguin",
    "content": "My attempt to golf it: \nb=gets.split(\"/\")\nputs b.size==8&&b.all?{|r|r.chars.sum{|c|c[/\\d/]?c.to_i : \"pnbrqkPNBRQK\"[c]?1:(puts\"Not legal\";exit)}==8}?\"Legal\":\"Not legal\"\ntry it yourself!",
    "codingamerHandle": "fefa7cfe5973e1eac226e818e081f63e8698906",
    "avatar": 145858585609373,
    "elapsedTime": 2257093000
  },
  {
    "commentId": 481889,
    "codingamerId": 2874091,
    "commentableId": 38809330,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 481888,
    "votableId": 38976778,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "(continued)\n\n* The intended focus in some cases is unclear. For example, in \"Invalid pieces\" (validator), the rank \"3-q4\" is invalid both because \"-\" is an illegal character and because the total number of squares exceeds 8 (if we consider \"-\" as a piece).\n\n* Some illegal scenarios aren't covered by any test cases, including:\n\n  • Consecutive rank separators (//)\n\n  • Consecutive digits (e.g. P24Q in a rank)\n\n  • The digit 0 appearing in a rank\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770722470459,
    "avatar": 134264063920528,
    "elapsedTime": 2250857000
  }
]