[
  {
    "commentId": 7465,
    "codingamerId": 218189,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 4769870,
    "userVoteValue": 0,
    "nickname": "[CG]Maxime",
    "content": "\"- move the smallest disk one axis to the right if the number of disks is even, to the left if the number of disks is odd\" => With N = 3, what should be the first move?",
    "codingamerHandle": "a858cb9483b31957524b33a65ae29846981812",
    "onlineSince": 1770713882722,
    "avatar": 2925297592678,
    "elapsedTime": 284012472000
  },
  {
    "commentId": 7066,
    "codingamerId": 1691929,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 2,
    "downVotes": 0,
    "votableId": 4552942,
    "userVoteValue": 0,
    "nickname": "Blubbor",
    "content": "Wouldn't it be easier to draw the disks as plain digits (0-9) in this case?\n\nExample:\n| | |\n| | 1\n0 | 2",
    "codingamerHandle": "6f5bc9831713526e19561bddd96a9ab69291961",
    "avatar": 8734602753318,
    "elapsedTime": 286692277000
  },
  {
    "commentId": 6885,
    "codingamerId": 1546047,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 1,
    "votableId": 4500569,
    "userVoteValue": 0,
    "content": "There are actually much simpler ways to solve it\nfor example there is a Hanoi module in python",
    "codingamerHandle": "9b6f917d8ba745e1194e9922b5ef3dd67406451",
    "elapsedTime": 287555514000
  },
  {
    "commentId": 3310,
    "codingamerId": 154906,
    "commentableId": 2969610,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3061105,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Ok. So I did solve it. Random thoughts follow.\n\n* I'm not quite sure what use the requirement for the number of turns needed to complete the game is. I may be biased by final thought, see below.\n\n* the AA manages to be a pain (mostly because trailing space, and no, specifying doesn't excuse the insult) while not even representing a significant part of the solution. Please drop it.\n\n* though its [AA] specification would benefit greatly from an addition along the lines of \"each axis layer is W(=f(N)) characters wide before stripping; an additional single space comes as an added separator\"\n\n* I'm aware you mention axes are space-separated, but that's ambiguous: if the axes bear disks, the disks are expected to be space-separated as well but it isn't said.\n\n* the algorithm specification was a bit confusing to me. Why not give the common recursive one? (I know they're equivalent since there's only one optimal one, and your turn counts in the validation match, but this could prove confusing to newer users) (I actually solved using the recursive one, because come on)\n\n* as an example of confusion, I suppose you meant \"if the number of disks _in the smallest disk's pile_ is even/odd\"\n\n* the conundrum. This problem could be a lot more interesting IMHO if N was allowed to grow high enough to prevent turn-by-turn simulation. But that's not going to fit in 1000 characters if AA is kept :P\n\nSo I *am* a bit confused as to your initial intention in submitting that. Were you expecting people to simulate the whole game so as to count the steps, and save one specific step along the way?",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 302226078000
  },
  {
    "commentId": 3299,
    "codingamerId": 1188212,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3058463,
    "userVoteValue": 0,
    "nickname": "superredlark",
    "content": "You may describe the action of \"to the Right\" and \"to the Left\" more clearly, so people could understand that means \"axis 1->2, 2->3, 3->1\" or \"axis 1->3, 3->2, 2->1\"",
    "codingamerHandle": "1d2d89304a3bbb4c205b841516bda13d2128811",
    "avatar": 2920737364455,
    "elapsedTime": 302263690000
  },
  {
    "commentId": 3262,
    "codingamerId": 154906,
    "commentableId": 2969610,
    "responseCount": 2,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 3050039,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "I'd upvote this if it weren't ASCII-art in disguise O:-)\nEdit: O:-)",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 302375510000
  },
  {
    "commentId": 3151,
    "codingamerId": 788361,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 3022500,
    "userVoteValue": 0,
    "nickname": "Bob",
    "content": "A simple one for you all, but it's a nice classic.\nI have tried to make the output description as clear as possible - it's really longer to write than to understand with the example...",
    "codingamerHandle": "73a5c7e75cde8949ee1fe332045d6d23163887",
    "avatar": 29407964997640,
    "elapsedTime": 302760370000
  },
  {
    "commentId": 3280,
    "codingamerId": 788361,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3262,
    "votableId": 3053854,
    "userVoteValue": 0,
    "nickname": "Bob",
    "content": "Sure, I could just ask for the sizes od disks on each axis...\nBut I find that when you start implementing a game engine, one of the first things you need is also a simple, not too abstract representation of the game state, and usually that means some form of ASCII art, so for me it makes sense to have it that way.",
    "codingamerHandle": "73a5c7e75cde8949ee1fe332045d6d23163887",
    "avatar": 29407964997640,
    "elapsedTime": 302315736000
  },
  {
    "commentId": 3379,
    "codingamerId": 788361,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3310,
    "votableId": 3080248,
    "userVoteValue": 0,
    "nickname": "Bob",
    "content": "Generally, yes the intent is to effectively implement the algorithm as described and output the display at the requested step. As I did mention right from the start, this is not a complicated puzzle. You could in fact even argue it's hardly a puzzle at all :) \n\nRegarding the algorithm, this is indeed the iterative one, which I believe is reasonably popular too, and very simple to implement and reproduce manually. Also, the description I am giving is equivalent to yours, just worded differently - and yes I do mean the full number of disks.\n\nThis is really just a classic \"game\", one of the first things I remember programming on my CPC some 30 years ago, so I thought it would make a good exercise for beginners. It is really not intended as more than that.\n\nRegarding the AA, I agree the description isn't very good and the examples are much clearer. It could certainly be dropped in favour of a more abstract representation of the game state but I feel that as a beginner's puzzle it is nicer to have a graphical representation.",
    "codingamerHandle": "73a5c7e75cde8949ee1fe332045d6d23163887",
    "avatar": 29407964997640,
    "elapsedTime": 301904800000
  },
  {
    "commentId": 7426,
    "codingamerId": 512097,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 1,
    "parentCommentId": 3310,
    "votableId": 4730573,
    "userVoteValue": 0,
    "nickname": "Stilgart",
    "content": "Even if the statement can still be improved, I am quite happy with it in its current version. \n\nThe only point that looks strange to me is when we are asked to output the number of turn to complete the game. This number is given in the last constraint of the statement. Are we supposed to check that this value is the right one ?",
    "codingamerHandle": "f6389a8319f07b08072b207feb2572c9790215",
    "avatar": 69893904259383,
    "elapsedTime": 284399003000
  },
  {
    "commentId": 3303,
    "codingamerId": 154906,
    "commentableId": 2969610,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 3262,
    "votableId": 3059278,
    "userVoteValue": 0,
    "nickname": "JBM",
    "content": "Mulling over this some more, what makes the AA most painful here is the way a fixed-width output would be so convenient, yet isn't what is tested for in the comparison engine.\n\nStill going through implementation since I'm such a nice person (in disguise O:-)",
    "codingamerHandle": "0d71f9df5da706f9f77c07c34d12480e609451",
    "elapsedTime": 302245252000
  }
]