[
  {
    "commentId": 214206,
    "codingamerId": 3589763,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 33739940,
    "userVoteValue": 0,
    "nickname": "rndll32",
    "content": "✅ Approved the contribution.\nComment: Beautiful & clear puzzle!",
    "codingamerHandle": "e53a0fbfb9d1bb812b5889b3181218743679853",
    "avatar": 72201885031318,
    "elapsedTime": 54787072000
  },
  {
    "commentId": 213961,
    "codingamerId": 1760772,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 33730523,
    "userVoteValue": 0,
    "nickname": "Tarannon",
    "content": "✅ Approved the contribution.\nComment: La contribution est claire, elle permet de tester si l'utilisateur est capable de manipuler des chaînes de caractères (chr, ord, split in Python)",
    "codingamerHandle": "47cc8262326fe7c3d06986ac5b9d90d52770671",
    "avatar": 20913714604132,
    "elapsedTime": 54866954000
  },
  {
    "commentId": 213764,
    "codingamerId": 4792610,
    "commentableId": 32438578,
    "responseCount": 1,
    "upVotes": 0,
    "downVotes": 2,
    "votableId": 33724162,
    "userVoteValue": 0,
    "nickname": "TheEagleOne",
    "content": "The assessment provided for encoding messages using a Caesar cipher and removing specific agent signatures is well-structured and clear in its goal. The instructions are straightforward, explaining the need to encode messages and remove the agent's signature, providing a clear example to illustrate the process. This clarity ensures that participants understand what is expected, which is essential for a fair assessment.\n\nHowever, the assessment can be improved by expanding the allowed programming languages beyond C. While C is a robust choice, allowing solutions in languages like Python, JavaScript, and Java would make the assessment more inclusive and accessible to a broader range of developers. Additionally, incorporating more diverse test cases, including edge cases and boundary conditions, would better test the robustness and performance of the solutions. Ensuring that the examples cover a variety of scenarios, including different message lengths and offsets, would provide a comprehensive understanding of the problem requirements.",
    "codingamerHandle": "bf8ec2cf1055f9612f6fbfa9e3462a2e0162974",
    "avatar": 124989784556451,
    "elapsedTime": 54931485000
  },
  {
    "commentId": 213717,
    "codingamerId": 5300766,
    "commentableId": 32438578,
    "responseCount": 2,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 33719578,
    "userVoteValue": 0,
    "nickname": "jddingemanse",
    "content": "I suggest a slight rephrasing of the statement to make it clearer that 'except the spaces...' and '...which also deletes the signature' are actually two separate instructions (I now read it as somehow the signature will automatically be deleted if the spaces stay as they are):\n\"...which removes the signature at the end, and which encodes all characters of the remaining message except for space characters with the Ceasar code (...). The signature ...\"\n\n\nAlso, you say \"a constant offset is added to the ASCII value\", but instead the given offset is deducted it right?",
    "codingamerHandle": "d95f1456c7409de3e7dcc202f89a3d646670035",
    "avatar": 98376709796567,
    "elapsedTime": 54959228000
  },
  {
    "commentId": 213541,
    "codingamerId": 3479792,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 33709205,
    "userVoteValue": 0,
    "nickname": "StepBack13",
    "content": "✅ Approved the contribution.\nComment: Yes, it is another Caesar shift clash, but the rules say that even identical puzzles are allowed if the 'story' behind it and the tests themselves are unique.\n\nThis one is unique in even more ways. With the signature removal and the fact that letters don't simply loop back around from a-z and A-Z, but rather can shift to any ASCII character, I feel this is plenty to make this a fun and unique clash. Still easy to solve, but takes a bit more thought than you expect. Nice one.",
    "codingamerHandle": "da2fe4fbf3c0ab008c6dcf304920ec602979743",
    "avatar": 33990586394707,
    "elapsedTime": 55053031000
  },
  {
    "commentId": 210047,
    "codingamerId": 5639399,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "votableId": 33575184,
    "userVoteValue": 0,
    "nickname": "Code-Parser",
    "content": "Removing my Rejection because of @5DN1L's reply:\n\nCODE_PARSER:\n```\n❌ Rejected the contribution.\nComment: Similar to a IN/OUT Puzzle by @Jnath:\nhttps://www.codingame.com/...\n\nThe name \"Agent X\" has already been taken.\n\nThere are plenty of \"Caesar Cipher\" Contributions on CodinGame already.\n\n(Please don't hate me for stating this fact or rejecting.)\n```\n\n5DN1L:\n```\n\"Agent X\" is just a confusing example. It's been mentioned earlier in the statement, though, the actual format is \"Agent \" + first letter of agent's name.\n\nThis clash is not similar to Jnath's puzzle, because here, you're **given** the shift, and you're asked to **encode** (not decode) the message AND remove the signature of the agent (which always appears at the end).\n\nIndeed there are lots of Caesar Cipher contributions here. The question is whether the signature removal twist makes this contribution distinct or still very similar to the existing ones.\n```\n\nI am also removing myself from approving/rejecting.",
    "codingamerHandle": "f61f9ba36b2da3c2fc30e835fb33b3339939365",
    "avatar": 146649782093145,
    "elapsedTime": 56399789000
  },
  {
    "commentId": 192511,
    "codingamerId": 2671545,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 1,
    "votableId": 32913704,
    "userVoteValue": 0,
    "nickname": "CodinBot",
    "content": "I hope you received enough feedback from the community to improve your contribution. Once you have made the necessary updates, publish your contribution!",
    "codingamerHandle": "79ae4f668f3f26561f3408f3de3c13375451762",
    "avatar": 19333912201092,
    "elapsedTime": 61858927000
  },
  {
    "commentId": 182809,
    "codingamerId": 2874091,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 32585113,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Goal\n* Please format \"Agent\" as a {{constant}} and remove the quotation marks.\n\nOutput\n* Please do not format \"message\" as a variable.\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1770727666105,
    "avatar": 134264063920528,
    "elapsedTime": 64436977000
  },
  {
    "commentId": 213774,
    "codingamerId": 5923035,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 213717,
    "votableId": 33724783,
    "userVoteValue": 0,
    "nickname": "twyzzi",
    "content": "I never thought about it but it is true that the construction of the phrase was misleading, is it better now?\nI also changed added to subtracted because even though you can add a negative number it could be misunderstood.\n\nThanks for the feedback",
    "codingamerHandle": "ea2004400c05c78ce22f073ca4a684405303295",
    "avatar": 117950369870462,
    "elapsedTime": 54926258000
  },
  {
    "commentId": 213834,
    "codingamerId": 5300766,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 213764,
    "votableId": 33727671,
    "userVoteValue": 0,
    "nickname": "jddingemanse",
    "content": "I am not sure whether your text is auto-generated or well-thought. In case of the latter, let me reply to some of the points:\n- This is a contribution page. The creator of a contribution submits a challenge, and needs to submit with that solution code - here it happens to be in C, but when this contribution becomes accepted, any player playing this clash can select any of the available languages. Hence, there is no need for 'expanding the allowed programming languages'.\n- This is a clash, meant for <5 minutes of fun. No need to \"incorporat[e] more diverse test cases, including edge cases and boundary conditions\". If you have actual examples of relevant edge cases to include, please specify them, but the general remark 'include edge cases' does not really help the creator of the contribution.\n- This location is no place to 'encourage participants to write clean, well-structured code with comments'. A contribution should be simply an explanation of the task at hand, and a collection of relevant cases. Here at codingame, people learn by having to solve puzzles. For explicit explanations and well-commented code, there are other locations.",
    "codingamerHandle": "d95f1456c7409de3e7dcc202f89a3d646670035",
    "avatar": 98376709796567,
    "elapsedTime": 54886370000
  },
  {
    "commentId": 213835,
    "codingamerId": 5300766,
    "commentableId": 32438578,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 213717,
    "votableId": 33727688,
    "userVoteValue": 0,
    "nickname": "jddingemanse",
    "content": "Oh wait on the offset I now understand it better - your sentence regarding the offset is a small explanation of the Ceasar code (in which an offset is added when encrypting) - and since we are decrypting, we of course need to subtract the offset. My bad.\nBest to change:\n\" (a constant offset is subtracted to the ASCII value of each character) \"\nback into\n\" (a constant offset is added to the ASCII value of each character) \".\nApologies!",
    "codingamerHandle": "d95f1456c7409de3e7dcc202f89a3d646670035",
    "avatar": 98376709796567,
    "elapsedTime": 54886125000
  }
]