[
  {
    "commentId": 499642,
    "codingamerId": 2874091,
    "commentableId": 39028421,
    "responseCount": 2,
    "upVotes": 1,
    "downVotes": 0,
    "votableId": 39196273,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "General\n* Please study the formatting syntax on this page: https://www.codingame.com/playgrounds/40701/help-center/statement , and format your statement properly as described in the points below.\n\n* The clash currently lacks any key programming elements such as lists, sets, dictionaries, string manipulation, loops, conditions… Please add one or more programming elements so that the clash is more of a programming problem than a maths problem.\n\nGoal\n* The units for weight, dose, and drug concentration are not specified. Please clearly state the units.\n\n* The relationship between weight, dose, and concentration is not explained. Please describe how the volume is calculated from these values.\n\nInput\n* The description currently placed under \"Input\" actually describes the output. Please move it to the Output section.\n\n* Please refer to the earlier link for an example of how this section should be written.\n\nOutput\n* The content under \"Output\" contains constraints rather than an output description. Please move it to the Constraints section.\n\nStub generator / Constraints\n* Please use the same variable names in the stub generator and the Constraints section.\n\nConstraints\n* Please format all [[variables]].\n\n* Please change 150 and 500 to 100, because the inputs never exceed 100.\n\nThanks.",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1771682069510,
    "avatar": 134264063920528,
    "elapsedTime": 5247000
  },
  {
    "commentId": 499675,
    "codingamerId": 2315647,
    "commentableId": 39028421,
    "responseCount": 0,
    "upVotes": 1,
    "downVotes": 0,
    "parentCommentId": 499642,
    "votableId": 39196365,
    "userVoteValue": 0,
    "nickname": "DJA-TAY",
    "content": "Thank you for the detailed feedback! I have applied all your suggestions:\n- Added units (kg, mg/kg, mg/ml) and the formula in the Goal section\n- Moved the output description to the Output section\n- Moved the constraints to the Constraints section\n- Used consistent variable names (weightKg, doseMg, conc) across the stub generator and Constraints\n- Updated the constraints max values to 100\n\nLet me know if anything else needs improvement!",
    "codingamerHandle": "6b2c8b6f7fb3aedce4098a878dd8f4ba7465132",
    "onlineSince": 1771681513071,
    "avatar": 15920216537139,
    "elapsedTime": 3700000
  },
  {
    "commentId": 499708,
    "codingamerId": 2874091,
    "commentableId": 39028421,
    "responseCount": 0,
    "upVotes": 0,
    "downVotes": 0,
    "parentCommentId": 499642,
    "votableId": 39196568,
    "userVoteValue": 0,
    "nickname": "5DN1L",
    "content": "Thank you. The clash looks better now.\n\nAs mentioned before, the clash is more of a programming problem than a maths problem.\n\nHere are a few ideas you might consider (you’re welcome to come up with your own as well) to modify the task:\n* add a maximum volume limit\n* add a minimum volume limit\n* dose is halved if weight is below a certain threshold",
    "codingamerHandle": "bbb8f47ea4601179303c20acdbf5fb6c1904782",
    "onlineSince": 1771682069510,
    "avatar": 134264063920528,
    "elapsedTime": 85000
  }
]